{
  "nav-home": "الصفحة الرئيسية",
  "nav-about": "نبذة",
  "nav-tech": "المجموعة التقنية",
  "nav-resume": "السيرة الذاتية",
  "nav-portfolio": "المحفظة",
  "nav-contact": "جهة الاتصال",
  "language-label": "اللغة",
  "language-selector-header": "حدد اللغة ({count} متاحة)",
  "hero-subtitle": "جعل الذكاء الاصطناعي يتحدث لغتك، نموذج واحد في كل مرة",
  "multilingual-typed": [
    "I train LLMs to speak your language.",
    "我训练大型语言模型来讲你的语言。",
    "Entreno LLMs para hablar tu idioma.",
    "Ich trainiere LLMs, damit sie deine Sprache sprechen.",
    "J'entraîne des LLM pour qu'ils parlent votre langue.",
    "あなたの言語を话せるように、LLMを訓練しています。",
    "Treino LLMs para falar o seu idioma.",
    "أقوم بتدريب LLM لتتحدث لغتك.",
    "Alleno LLM per parlare la tua lingua.",
    "Я обучаю LLM говорить на вашем языке."
  ],
  "about-title": "نبذة عني في O(1)",
  "about-description": "أنا باحث ومهندس في مجال الذكاء الاصطناعي أركز على نماذج اللغات الكبيرة متعددة اللغات.",
  "about-role": "مهندس وباحث في الذكاء الاصطناعي",
  "about-intro": "في Translated، ساعدت في بناء Lara من اليوم الأول، وهي نموذج لغة كبير للترجمة الآلية يعمل على تشغيل المحتوى في الوقت الفعلي لـ Airbnb وUber وShopify وغيرها، ليصل إلى أكثر من 200 مليون مستخدم.",
  "birth-place-label": "مكان الميلاد:",
  "birth-place": "نابولي، إيطاليا",
  "email-label": "البريد الإلكتروني:",
  "city-label": "المدينة:",
  "city": "روما، إيطاليا",
  "masters-label": "درجة الماجستير:",
  "masters-degree": "الذكاء الاصطناعي وهندسة البيانات",
  "bachelors-label": "درجة البكالوريوس:",
  "bachelors-degree": "هندسة الحاسبات",
  "university-label": "الجامعة:",
  "university": "جامعة بيزا",
  "languages-label": "اللغات:",
  "languages": "الإيطالية، الإنجليزية",
  "focus-label": "التركيز:",
  "focus": "نماذج اللغة الكبيرة متعددة اللغات",
  "about-conclusion": "لقد قمت بتوسيع نطاق التدريب إلى أكثر من 1000 وحدة معالجة رسومات (GPU) وتوسيع تغطية الترجمة الآلية إلى 201 لغة. شاركت في تأسيس <a href=\"https://picarta.ai/\" target=\"_blank\" style=\"color: var(--accent-primary); text-decoration: none; font-weight: 600;\">Picarta.ai</a>، وهي شركة ناشئة في مجال الذكاء الاصطناعي تبني منصة لتحديد الموقع الجغرافي للصور. أنا متعلم نهم يسعى باستمرار لتحسين طريقة تفكيري وتدريبي وبنائي. لا يمكنني تخيل حياة بدون شكل من أشكال التدريب، سواء كان ذلك على وحدات معالجة الرسومات (GPU) أو ألواح التمارين الرياضية أو التحضير للماراثون.",
  "tech-title": "التقنيات والأدوات",
  "focus-title": "التركيز الحالي",
  "focus-description": "ما أقوم ببنائه والبحث عنه الآن",
  "focus-scaling-title": "توسيع نطاق الترجمة الآلية إلى 201 لغة",
  "focus-scaling-desc": "توسيع تغطية الترجمة الآلية مع الحفاظ على الجودة. العمل مع مجموعات البيانات الضخمة متعددة اللغات وتحسين اللغات منخفضة الموارد باستخدام تقنيات التعلم النقلي المتقدمة.",
  "focus-production-title": "الذكاء الاصطناعي متعدد اللغات في الإنتاج",
  "focus-production-desc": "بناء أنظمة ترجمة قوية تتعامل مع تعقيدات العالم الحقيقي على نطاق واسع. مواجهة تحديات مثل التبديل البرمجي وتكييف المجال والمحتوى الصاخب الذي ينشئه المستخدمون والحفاظ على الجودة عبر أكثر من 200 مليون مستخدم يوميًا.",
  "tag-realtime": "تقديم الخدمة في الوقت الفعلي",
  "tag-quality": "ضمان الجودة",
  "resume-title": "السيرة الذاتية",
  "resume-description": "مهندس وباحث في مجال الذكاء الاصطناعي يتمتع بخبرة واسعة في بناء وتوسيع نطاق أنظمة الترجمة الآلية متعددة اللغات. سجل حافل في خدمة أكثر من 200 مليون مستخدم من خلال حلول LLM المبتكرة.",
  "experience-title": "الخبرة المهنية",
  "current-role": "مهندس وباحث في الذكاء الاصطناعي",
  "current-company": "Translated، روما، إيطاليا",
  "lara-desc": "<strong>لارا:</strong> عملت على خط أنابيب البحث والتطوير الكامل لنموذج LLM المحسّن للترجمة الآلية: من جمع البيانات وتدريب النماذج إلى المحاذاة وتحسين الاستدلال. تم بناؤه من الصفر ضمن فريق من أربعة أشخاص يعملون داخل الشركة. الآن المنتج الرئيسي بين الشركات، يترجم جميع المحتويات في جميع أنحاء العالم لـ Airbnb ومعظم محتويات Uber وShopify وNike والمزيد، ليصل إلى أكثر من 200 مليون مستخدم على مستوى العالم. كما تم إطلاق نسخة B2C مؤخرًا.",
  "try-here": "جرِّبها هنا",
  "lara-grande-desc": "<strong>لارا غراندي:</strong> دور رئيسي في توسيع نطاق LLM لمطابقة جودة أفضل 1% من المترجمين المحترفين. استخدمت أكثر من 1000 وحدة معالجة رسومات على مجموعة CINECA للحوسبة عالية الأداء للتدريب الموزع على نطاق واسع.",
  "language-expansion-desc": "<strong>التوسع اللغوي:</strong> حددت وقادت مشروعًا بحثيًا ناجحًا لتوسيع تغطية إنتاج الترجمة الآلية من 56 إلى 201 لغة، بزيادة قدرها 4×، مما يجعله أول محرك ترجمة آلية تجاري يدعم مثل هذا النطاق. اقترحت التوجيه، وصممت خطة التنفيذ، وقادتها إلى الاكتمال في غضون ثمانية أشهر.",
  "instruction-mt-desc": "<strong>الترجمة الآلية باتباع التعليمات:</strong> قيادة البحث لمواءمة LLM لاتباع أدلة الأسلوب التفصيلية باستخدام SFT وDPO.",
  "trust-attention-desc": "<strong>الاهتمام بالثقة:</strong> اقترحت تقنية جديدة تم التحقق من صحتها تعطي الأولوية لبيانات التدريب عالية القيمة، مما يحقق أهم تحسينات جودة الترجمة الآلية في خمس سنوات.",
  "polyglot-desc": "<strong>متعدد اللغات:</strong> طور نموذجًا لتحديد اللغة يدعم 201 لغة.",
  "startup-title": "تجربة الشركات الناشئة",
  "startup-role": "المؤسس المشارك ومهندس الذكاء الاصطناعي",
  "italy": "إيطاليا",
  "startup-desc1": "شارك في تأسيس شركة ناشئة في مجال الذكاء الاصطناعي كجزء من فريق تأسيس مكون من ثلاثة أشخاص لبناء منصة تحديد الموقع الجغرافي للصور",
  "startup-desc2": "تطوير النموذج الأساسي لتحديد الموقع الجغرافي للصور باستخدام محولات الرؤية والتقنيات القائمة على الاسترجاع",
  "startup-desc3": "اكتساب خبرة قيمة في بيئة الشركات الناشئة سريعة الخطى وتطوير المنتجات",
  "startup-desc4": "تعلم دروسًا مهمة حول ديناميكيات الفريق وإدارة عدم اليقين والتكرار السريع",
  "education-title": "التعليم",
  "masters-full": "ماجستير في الذكاء الاصطناعي وهندسة البيانات",
  "university-location": "جامعة بيزا، بيزا، إيطاليا",
  "masters-description": "110/110 بامتياز مع مرتبة الشرف (4.0 GPA). متخصص في استخراج البيانات والتعلم الآلي ورؤية الكمبيوتر ومعالجة اللغة الطبيعية ونظرية التحسين واستخراج العمليات. اكتسبت خبرة عملية في الأنظمة الموزعة والحوسبة السحابية وأدوات مثل MongoDB وNeo4j وDocker وKubernetes وTensorFlow وPyTorch.",
  "bachelors-full": "بكالوريوس هندسة الكمبيوتر",
  "bachelors-description": "110/110 (4.0 GPA). أساس قوي في هندسة الكمبيوتر بما في ذلك الرياضيات والفيزياء والخوارزميات وقواعد البيانات وهندسة الكمبيوتر وشبكات الكمبيوتر وأنظمة التشغيل والبرمجة في C و C++ و Java و Python و Matlab و SQL و JavaScript و PHP.",
  "portfolio-title": "المحفظة",
  "portfolio-description": "مجموعة من مشاريع الذكاء الاصطناعي والتعلم الآلي الخاصة بي، من البحث الأكاديمي إلى أنظمة الإنتاج التي تخدم ملايين المستخدمين في جميع أنحاء العالم.",
  "t4sa-desc": "نظام تحليل المشاعر المرئية عبر الوسائط باستخدام تقطير المعرفة من النص إلى نماذج الرؤية. نُشر في ECAI 2023، وحقق أحدث النتائج في التنبؤ بالمشاعر المرئية.",
  "numpygpt-desc": "GPT من الصفر مبني بمكتبة NumPy وPython القياسية. لا توجد تدرج تلقائي، ولا أطر عمل: يتم إعادة تنفيذ كل طبقة مع تمريرها للأمام والخلف. يتم حساب التدرجات يدويًا، والتحديثات شفافة، ويتم توضيح كل عملية.",
  "fake-news-desc": "نظام ذكاء اصطناعي متعدد الوسائط للكشف عن المعلومات المضللة باستخدام هياكل المحولات. يتميز بتحليل الموقف ودرجات مصداقية المصدر.",
  "unimusic-desc": "منصة اكتشاف موسيقى قابلة للتطوير مع بنية هجينة من MongoDB/Neo4j. يتعامل مع ملايين المسارات باستخدام خوارزميات التوصية في الوقت الفعلي.",
  "voice-vibes-desc": "نظام التعرف على عواطف الكلام مع ست بنيات ذكاء اصطناعي جديدة. حقق دقة 94% باستخدام طرق المجموعة وهندسة الميزات المتقدمة.",
  "federated-dbscan-desc": "التجميع الموزع للحفاظ على الخصوصية مع التعلم الموحد. يتيح التعلم التعاوني بدون مشاركة البيانات، مما يحقق الحفاظ على الخصوصية بنسبة 99%.",
  "pagerank-desc": "تنفيذ خوارزمية PageRank عالية الأداء مع عمليات مصفوفة متفرقة محسنة. يتعامل مع الرسوم البيانية بملايين العقد بكفاءة.",
  "contact-title": "جهة الاتصال",
  "contact-description": "دعنا نتواصل! سواء كنت ترغب في مناقشة الذكاء الاصطناعي أو التعلم الآلي أو التعاون المحتمل، فأنا دائمًا منفتح على المحادثات المثيرة للاهتمام.",
  "location-label": "الموقع",
  "location": "روما، إيطاليا",
  "form-name": "اسمك",
  "form-email": "بريدك الإلكتروني",
  "form-subject": "الموضوع",
  "form-message": "الرسالة",
  "form-loading": "جارٍ التحميل",
  "form-success": "تم إرسال رسالتك. شكرًا لك!",
  "form-send": "إرسال رسالة"
}