{
  "nav-home": "Начало",
  "nav-about": "За мен",
  "nav-tech": "Технологичен стек",
  "nav-resume": "Резюме",
  "nav-portfolio": "Портфолио",
  "nav-contact": "Контакт",
  "language-label": "Език",
  "language-selector-header": "Избор на език ({count} налични)",
  "hero-subtitle": "Да накараме изкуствения интелект да говори на вашия език, модел по модел",
  "multilingual-typed": [
    "I train LLMs to speak your language.",
    "我训练大型语言模型来讲你的语言。",
    "Entreno LLMs para hablar tu idioma.",
    "Ich trainiere LLMs, damit sie deine Sprache sprechen.",
    "J'entraîne des LLM pour qu'ils parlent votre langue.",
    "あなたの言語を话せるように、LLMを訓練しています。",
    "Treino LLMs para falar o seu idioma.",
    "أقوم بتدريب LLM لتتحدث لغتك.",
    "Alleno LLM per parlare la tua lingua.",
    "Я обучаю LLM говорить на вашем языке."
  ],
  "about-title": "За мен в O(1)",
  "about-description": "Аз съм изследовател и инженер в областта на изкуствения интелект, фокусиран върху многоезични големи езикови модели.",
  "about-role": "Инженер и изследовател в областта на изкуствения интелект",
  "about-intro": "В Translated помогнах за изграждането на Lara от първия ден, голяма езикова модел за машинен превод, която захранва съдържание в реално време за Airbnb, Uber, Shopify и други, достигайки до над 200 милиона потребители.",
  "birth-place-label": "Място на раждане:",
  "birth-place": "Неапол, Италия",
  "email-label": "Имейл:",
  "city-label": "Град:",
  "city": "Рим, Италия",
  "masters-label": "Магистърска степен:",
  "masters-degree": "Изкуствен интелект и инженеринг на данни",
  "bachelors-label": "Бакалавърска степен:",
  "bachelors-degree": "Компютърно инженерство",
  "university-label": "Университет:",
  "university": "Университет на Пиза",
  "languages-label": "Езици:",
  "languages": "Италиански, английски",
  "focus-label": "Фокус:",
  "focus": "Многоезични LLM",
  "about-conclusion": "Мащабирах обучението до над 1000 GPU и разширих обхвата на машинния превод до 201 езика. Аз съм съосновател на <a href=\"https://picarta.ai/\" target=\"_blank\" style=\"color: var(--accent-primary); text-decoration: none; font-weight: 600;\">Picarta.ai</a>, стартираща компания в областта на изкуствения интелект, която изгражда платформа за геолокализация на изображения. Аз съм ненаситен ученик, който постоянно се стреми да подобрява начина, по който мисля, обучавам и изграждам. Не мога да си представя живот без някаква форма на обучение, независимо дали става въпрос за графични процесори, тежести в залата или подготовка за маратон.",
  "tech-title": "Технологии и инструменти",
  "tech-pytorch": "Дълбоко обучение",
  "tech-python": "Основен език",
  "tech-slurm": "Планиране на задания за HPC",
  "tech-vllm": "Високоефективна услуга за LLM",
  "tech-transformers": "LLMs и NLP",
  "tech-mongodb": "Съхранение на данни",
  "tech-docker": "Контейнеризация",
  "tech-git": "Контрол на версиите",
  "focus-title": "Текущ фокус",
  "focus-description": "Какво изграждам и изследвам в момента",
  "focus-scaling-title": "Мащабиране на машинния превод до 201 езика",
  "focus-scaling-desc": "Разширяване на обхвата на машинния превод, като същевременно се запазва качеството. Работа с масивни многоезични набори от данни и оптимизиране за езици с малко ресурси, като се използват усъвършенствани техники за трансферно обучение.",
  "focus-production-title": "Многоезичен ИИ в производството",
  "focus-production-desc": "Изграждане на стабилни системи за превод, които да се справят с реалната сложност в мащаб. Справяне с предизвикателства като превключване на кодове, адаптиране на домейни, шумно генерирано от потребители съдържание и поддържане на качеството за над 200 милиона потребители дневно.",
  "tag-realtime": "Обслужване в реално време",
  "tag-quality": "Осигуряване на качеството",
  "tag-data": "Данни",
  "resume-title": "Резюме",
  "resume-description": "Инженер и изследовател в областта на изкуствения интелект с богат опит в изграждането и мащабирането на многоезични системи за машинен превод. Доказана репутация за обслужване на над 200 милиона потребители чрез иновативни решения за големи езикови модели (LLM).",
  "experience-title": "Професионален опит",
  "current-role": "Инженер и изследовател в областта на изкуствения интелект",
  "current-company": "Translated, Рим, Италия",
  "lara-desc": "<strong>Лара:</strong> Работила е по пълния процес на научноизследователска и развойна дейност на голям езиков модел (LLM), оптимизиран за машинен превод: от събиране на данни и обучение на модели до оптимизиране на настройката и извеждането на резултати. Създаден е от нулата в рамките на екип от четирима души в стил стартъп, работещи в компанията. Сега водещият продукт за бизнес клиенти превежда цялото съдържание в световен мащаб за Airbnb и по-голямата част от Uber, Shopify, Nike и други, достигайки до над 200 милиона потребители в световен мащаб. Наскоро стартира и B2C версия.",
  "try-here": "Опитайте тук",
  "lara-grande-desc": "<strong>Lara Grande:</strong> ключова роля в мащабирането на LLM, за да съответства на качеството на най-добрите 1% професионални преводачи. Използвани са над 1000 GPU на HPC клъстера на CINECA за мащабно разпределено обучение.",
  "language-expansion-desc": "<strong>Разширяване на езиците:</strong> Идентифицирах и ръководих успешен изследователски проект за разширяване на обхвата на машинния превод от 56 на 201 езика, което е 4-кратно увеличение, което го прави първия търговски механизъм за машинен превод, който поддържа такъв диапазон. Предложих посоката, проектирах плана за изпълнение и го доведох до завършване в рамките на осем месеца.",
  "instruction-mt-desc": "<strong>Машинен превод, следващ инструкции:</strong> ръководи изследвания, насочващи големия езиков модел (LLM) да следва подробни указания за стил, използвайки SFT и DPO.",
  "trust-attention-desc": "<strong>Внимание към доверието:</strong> Предложих и валидирах нова техника, която приоритизира високостойностни данни за обучение, като постигна най-значителните подобрения в качеството на машинния превод за пет години.",
  "polyglot-desc": "<strong>Полиглот:</strong> Разработих модел за идентификация на езика, поддържащ 201 езика.",
  "startup-title": "Опит в стартиране на бизнес",
  "startup-role": "Съосновател и инженер по изкуствен интелект",
  "italy": "Италия",
  "startup-desc1": "Съосновател на стартъп за изкуствен интелект като част от тричленен учредителен екип, изграждащ платформа за геолокализация на изображения",
  "startup-desc2": "Разработих основния модел за геолокализация на изображения, използвайки визуални трансформатори и техники, базирани на извличане",
  "startup-desc3": "Придобих ценен опит в бързо развиваща се среда на стартиране и разработване на продукти",
  "startup-desc4": "Научих важни уроци за динамиката на екипа, управлението на несигурността и бързата итерация",
  "education-title": "Образование",
  "masters-full": "Магистърска степен по изкуствен интелект и инженеринг на данни",
  "university-location": "Университет на Пиза, Пиза, Италия",
  "masters-description": "110/110 с отличие (4.0 GPA). Специализиран в извличането на данни, машинното обучение, компютърното зрение, обработката на естествен език, теорията на оптимизацията и извличането на процеси. Придобих практически опит с разпределени системи, изчисления в облак и инструменти като MongoDB, Neo4j, Docker, Kubernetes, TensorFlow и PyTorch.",
  "bachelors-full": "Бакалавър по компютърно инженерство",
  "bachelors-description": "110/110 (4.0 GPA). Силна основа в компютърното инженерство, включително математика, физика, алгоритми, бази данни, компютърна архитектура, компютърни мрежи, операционни системи и програмиране в C, C++, Java, Python, Matlab, SQL, JavaScript и PHP.",
  "portfolio-title": "Портфолио",
  "portfolio-description": "Колекция от моите проекти за изкуствен интелект и машинно обучение, от академични изследвания до производствени системи, обслужващи милиони потребители по целия свят.",
  "t4sa-desc": "Система за анализ на визуални настроения, използваща дестилация на знания от текстови към визуални модели. Публикувано на ECAI 2023, постигайки най-съвременни резултати при визуалното прогнозиране на настроенията.",
  "numpygpt-desc": "GPT, изграден от нулата с NumPy и стандартната библиотека на Python. Без автоматично градиране, без рамки: всеки слой се внедрява отново със собствен пренос напред и назад. Градиентите се изчисляват ръчно, актуализациите са прозрачни и всяка операция е изписана.",
  "fake-news-desc": "Мултимодална система с изкуствен интелект за откриване на невярна информация с помощта на трансформаторни архитектури. Включва анализ на позицията и оценка на достоверността на източника.",
  "unimusic-desc": "Мащабируема платформа за откриване на музика с хибридна архитектура MongoDB/Neo4j. Обработва милиони песни с алгоритми за препоръки в реално време.",
  "voice-vibes-desc": "Система за разпознаване на емоции в речта с шест нови архитектури на ИИ. Постигната е точност от 94% с помощта на ансамблови методи и усъвършенствано инженерство на функциите.",
  "federated-dbscan-desc": "Разпределено клъстеризиране, запазващо поверителността, с федерално обучение. Позволява съвместно машинно обучение без споделяне на данни, като се постига 99% запазване на поверителността.",
  "pagerank-desc": "Високоефективна реализация на алгоритъма PageRank с оптимизирани операции с разреждени матрици. Ефективно обработва графики с милиони възли.",
  "contact-title": "Контакт",
  "contact-description": "Да се свържем! Независимо дали искате да обсъдим изкуствен интелект, машинно обучение или потенциално сътрудничество, винаги съм отворен за интересни разговори.",
  "location-label": "Местоположение:",
  "location": "Рим, Италия",
  "form-name": "Вашето име",
  "form-email": "Вашият имейл",
  "form-subject": "Тема",
  "form-message": "Съобщение",
  "form-loading": "Зареждане",
  "form-success": "Съобщението ви е изпратено. Благодарим ви!",
  "form-send": "Изпращане на съобщение"
}