{
  "nav-home": "Inici",
  "nav-about": "Informació",
  "nav-tech": "Pila tecnològica",
  "nav-resume": "Currículum",
  "nav-portfolio": "Portafoli",
  "nav-contact": "Contacte",
  "language-label": "Idioma",
  "language-selector-header": "Selecciona l'idioma ({count} disponible)",
  "hero-subtitle": "Fem que la IA parli el teu idioma, un model cada vegada",
  "multilingual-typed": [
    "I train LLMs to speak your language.",
    "我训练大型语言模型来讲你的语言。",
    "Entreno LLMs para hablar tu idioma.",
    "Ich trainiere LLMs, damit sie deine Sprache sprechen.",
    "J'entraîne des LLM pour qu'ils parlent votre langue.",
    "あなたの言語を话せるように、LLMを訓練しています。",
    "Treino LLMs para falar o seu idioma.",
    "أقوم بتدريب LLM لتتحدث لغتك.",
    "Alleno LLM per parlare la tua lingua.",
    "Я обучаю LLM говорить на вашем языке."
  ],
  "about-title": "Sobre mi a O(1)",
  "about-description": "Soc investigador i enginyer d'IA centrat en models lingüístics multilingües de grans dimensions.",
  "about-role": "Enginyer i investigador d'IA",
  "about-intro": "A Translated, vaig ajudar a construir Lara des del primer dia, un LLM de traducció automàtica que genera contingut en temps real per a Airbnb, Uber, Shopify i altres, arribant a més de 200 milions d'usuaris.",
  "birth-place-label": "Lloc de naixement:",
  "birth-place": "Nàpols, Itàlia",
  "email-label": "Correu electrònic:",
  "city-label": "Ciutat:",
  "city": "Roma, Itàlia",
  "masters-label": "Màster:",
  "masters-degree": "IA i enginyeria de dades",
  "bachelors-label": "Llicenciatura:",
  "bachelors-degree": "Enginyeria Informàtica",
  "university-label": "Universitat:",
  "university": "Universitat de Pisa",
  "languages-label": "Idiomes:",
  "languages": "Italià, anglès",
  "focus-label": "Enfocament:",
  "focus": "LLM multilingües",
  "about-conclusion": "He escalat l'entrenament a més de 1000 GPU i he ampliat la cobertura de la traducció automàtica a 201 idiomes. Vaig cofundar <a href=\"https://picarta.ai/\" target=\"_blank\" style=\"color: var(--accent-primary); text-decoration: none; font-weight: 600;\">Picarta.ai</a>, una empresa emergent d'IA que crea una plataforma per a la geolocalització d'imatges. M'encanta aprendre i sempre intento millorar la manera en què penso, m'entreno i construeixo. No puc imaginar una vida sense algun tipus d'entrenament, ja sigui amb GPU, plaques de gimnàs o preparació per a maratons.",
  "tech-title": "Tecnologies i eines",
  "tech-pytorch": "Aprenentatge profund",
  "tech-python": "Idioma principal",
  "tech-slurm": "Planificació de tasques HPC",
  "tech-vllm": "Servei LLM d'alt rendiment",
  "tech-transformers": "LLM i PNL",
  "tech-mongodb": "Emmagatzematge de dades",
  "tech-docker": "Contenidorització",
  "tech-git": "Control de versions",
  "focus-title": "Enfocament actual",
  "focus-description": "Què estic construint i investigant ara mateix",
  "focus-scaling-title": "Ampliar la traducció automàtica a 201 idiomes",
  "focus-scaling-desc": "Ampliar la cobertura de la traducció automàtica mantenint la qualitat. Treballar amb grans conjunts de dades multilingües i optimitzar per a idiomes amb pocs recursos mitjançant tècniques avançades d'aprenentatge per transferència.",
  "focus-production-title": "IA multilingüe en producció",
  "focus-production-desc": "Construïm sistemes de traducció robustos que gestionen la complexitat del món real a escala. Afrontem reptes com el canvi de codi, l'adaptació de dominis, el contingut sorollós generat pels usuaris i el manteniment de la qualitat per a més de 200 milions d'usuaris diaris.",
  "tag-realtime": "Servei en temps real",
  "tag-quality": "Garantia de qualitat",
  "tag-data": "Dades",
  "resume-title": "Currículum",
  "resume-description": "Enginyer i investigador d'IA amb una àmplia experiència en la construcció i l'escalat de sistemes de traducció automàtica multilingües. Tinc un historial demostrat de més de 200 milions d'usuaris a través de solucions innovadores de LLM.",
  "experience-title": "Experiència professional",
  "current-role": "Enginyer i investigador d'IA",
  "current-company": "Translated, Roma, Itàlia",
  "lara-desc": "<strong>Lara:</strong> Va treballar en el procés complet d'R+D d'un LLM optimitzat per a la traducció automàtica: des de la recopilació de dades i l'entrenament de models fins a l'alineació i l'optimització de la inferència. S'ha creat des de zero dins d'un equip de quatre persones d'estil startup que treballa dins de l'empresa. Ara és el producte estrella B2B, que tradueix tot el contingut a tot el món per a Airbnb i la majoria de Uber, Shopify, Nike i més, arribant a més de 200 milions d'usuaris a tot el món. També s'ha llançat recentment una versió B2C.",
  "try-here": "Prova-ho aquí",
  "lara-grande-desc": "<strong>Lara Grande:</strong> Paper clau en l'escalat de LLM per igualar la qualitat de l'1 % dels traductors professionals. S'han utilitzat més de 1000 GPU al clúster HPC de CINECA per a l'entrenament distribuït a gran escala.",
  "language-expansion-desc": "<strong>Expansió lingüística:</strong> Va identificar i dirigir un projecte de recerca amb èxit per ampliar la cobertura de producció de traducció automàtica de 56 a 201 idiomes, un augment de 4 vegades, convertint-lo en el primer motor de traducció automàtica comercial que admet aquesta gamma. Vaig proposar la direcció, vaig dissenyar el pla d'implementació i el vaig dur a terme en vuit mesos.",
  "instruction-mt-desc": "<strong>Traducció automàtica que segueix instruccions:</strong> Vaig liderar una investigació per alinear LLM per seguir guies d'estil detallades mitjançant SFT i DPO.",
  "trust-attention-desc": "<strong>Atenció de confiança:</strong> Vaig proposar i validar una nova tècnica que prioritza les dades d'entrenament d'alt valor, i vaig aconseguir les millores més significatives en la qualitat de la traducció automàtica en cinc anys.",
  "polyglot-desc": "<strong>Polyglot:</strong> Desenvolupació d'un model d'identificació de llengües que admet 201 idiomes.",
  "startup-title": "Experiència en una empresa emergent",
  "startup-role": "Cofundador i enginyer d'IA",
  "italy": "Itàlia",
  "startup-desc1": "Va cofundar una empresa emergent d'IA com a part d'un equip fundador de tres persones que creava una plataforma de geolocalització d'imatges",
  "startup-desc2": "Va desenvolupar el model bàsic per a la geolocalització d'imatges mitjançant transformadors de visió i tècniques basades en la recuperació.",
  "startup-desc3": "Vaig adquirir una experiència valuosa en un entorn d'empresa emergent i de desenvolupament de productes d'alt ritme",
  "startup-desc4": "Hem après lliçons crucials sobre la dinàmica de l'equip, la gestió de la incertesa i la ràpida iteració",
  "education-title": "Educació",
  "masters-full": "Màster en Intel·ligència Artificial i Enginyeria de Dades",
  "university-location": "Universitat de Pisa, Pisa, Itàlia",
  "masters-description": "110/110 summa cum laude (4,0 GPA). Especialitzat en mineria de dades, aprenentatge automàtic, visió per ordinador, processament del llenguatge natural, teoria de l'optimització i mineria de processos. Vaig adquirir experiència pràctica amb sistemes distribuïts, computació en núvol i eines com MongoDB, Neo4j, Docker, Kubernetes, TensorFlow i PyTorch.",
  "bachelors-full": "Llicenciatura en Enginyeria Informàtica",
  "bachelors-description": "110/110 (4.0 GPA). Sòlids fonaments en enginyeria informàtica, incloent-hi matemàtiques, física, algoritmes, bases de dades, arquitectura informàtica, xarxes informàtiques, sistemes operatius i programació en C, C++, Java, Python, Matlab, SQL, JavaScript i PHP.",
  "portfolio-title": "Portafoli",
  "portfolio-description": "Una col·lecció dels meus projectes d'IA i aprenentatge automàtic, des de la recerca acadèmica fins als sistemes de producció que donen servei a milions d'usuaris a tot el món.",
  "t4sa-desc": "Sistema d'anàlisi de sentiments visuals intermodal mitjançant la destil·lació de coneixements de models de text a visió. Publicat a l'ECAI 2023, aconseguint resultats d'última generació en la predicció del sentiment visual.",
  "numpygpt-desc": "Un GPT des de zero construït amb la biblioteca estàndard de NumPy i Python. Sense autograd, sense marcs: cada capa es torna a implementar amb el seu propi pas endavant i enrere. Els gradients es calculen manualment, les actualitzacions són transparents i totes les operacions s'expliquen.",
  "fake-news-desc": "Sistema d'IA multimodal per a la detecció de desinformació mitjançant arquitectures de transformadors. Inclou l'anàlisi de la postura i la puntuació de la credibilitat de la font.",
  "unimusic-desc": "Plataforma d'exploració musical escalable amb arquitectura híbrida MongoDB/Neo4j. Gestiona milions de pistes amb algoritmes de recomanació en temps real.",
  "voice-vibes-desc": "Sistema de reconeixement d'emocions de la veu amb sis noves arquitectures d'IA. Va aconseguir una precisió del 94 % mitjançant mètodes d'ensemble i enginyeria de característiques avançada.",
  "federated-dbscan-desc": "Agrupació distribuïda que preserva la privacitat amb aprenentatge federat. Permet un ML col·laboratiu sense compartir dades, i aconsegueix preservar la privacitat en un 99 %.",
  "pagerank-desc": "Implementació de l'algoritme PageRank d'alt rendiment amb operacions optimitzades de matrius disperses. Gestiona gràfics amb milions de nodes de manera eficient.",
  "contact-title": "Contacte",
  "contact-description": "Posem-nos en contacte! Tant si vols parlar d'IA, d'aprenentatge automàtic o de possibles col·laboracions, sempre estic obert a converses interessants.",
  "location-label": "Ubicació:",
  "location": "Roma, Itàlia",
  "form-name": "El teu nom",
  "form-email": "El teu correu electrònic",
  "form-subject": "Assumpte",
  "form-message": "Missatge",
  "form-loading": "S'està carregant",
  "form-success": "El teu missatge s'ha enviat. Gràcies!",
  "form-send": "Envia un missatge"
}