{
  "nav-home": "Hjem",
  "nav-about": "Om",
  "nav-tech": "Teknologier",
  "nav-resume": "CV",
  "nav-portfolio": "Portefølje",
  "nav-contact": "Kontakt",
  "language-label": "Sprog",
  "language-selector-header": "Vælg sprog ({count} tilgængelige)",
  "hero-subtitle": "Få AI til at tale dit sprog, én model ad gangen",
  "multilingual-typed": [
    "I train LLMs to speak your language.",
    "我训练大型语言模型来讲你的语言。",
    "Entreno LLMs para hablar tu idioma.",
    "Ich trainiere LLMs, damit sie deine Sprache sprechen.",
    "J'entraîne des LLM pour qu'ils parlent votre langue.",
    "あなたの言語を话せるように、LLMを訓練しています。",
    "Treino LLMs para falar o seu idioma.",
    "أقوم بتدريب LLM لتتحدث لغتك.",
    "Alleno LLM per parlare la tua lingua.",
    "Я обучаю LLM говорить на вашем языке."
  ],
  "about-title": "Om mig i O(1)",
  "about-description": "Jeg er AI-forsker og -ingeniør med fokus på flersprogede store sprogmodeller.",
  "about-role": "AI-ingeniør og forsker",
  "about-intro": "Hos Translated hjalp jeg med at bygge Lara fra dag ét, en maskinoversættelses-LLM, der leverer indhold i realtid til Airbnb, Uber, Shopify og andre, og når ud til over 200 millioner brugere.",
  "birth-place-label": "Fødselssted:",
  "birth-place": "Napoli, Italien",
  "email-label": "E-mail:",
  "city-label": "By:",
  "city": "Rom, Italien",
  "masters-label": "Kandidatgrad:",
  "masters-degree": "AI og datateknik",
  "bachelors-label": "Bachelorgrad:",
  "bachelors-degree": "Computerteknik",
  "university-label": "Universitet:",
  "university": "Universitetet i Pisa",
  "languages-label": "Sprog:",
  "languages": "Italiensk, engelsk",
  "focus-label": "Fokus:",
  "focus": "Flersprogede LLM'er",
  "about-conclusion": "Jeg har skaleret træning til 1.000+ GPU'er og udvidet maskinoversættelsesdækning til 201 sprog. Jeg er medstifter af <a href=\"https://picarta.ai/\" target=\"_blank\" style=\"color: var(--accent-primary); text-decoration: none; font-weight: 600;\">Picarta.ai</a>, en AI-startup, der bygger en platform til billedgeolokalisering. Jeg er en nysgerrig elev, der konstant stræber efter at forbedre min måde at tænke, træne og bygge på. Jeg kan ikke forestille mig et liv uden en eller anden form for træning, hvad enten det er GPU'er, vægte i fitnesscentret eller forberedelse til et maraton.",
  "tech-title": "Teknologier og værktøjer",
  "tech-pytorch": "Deep Learning",
  "tech-python": "Primært sprog",
  "tech-slurm": "HPC-jobplanlægning",
  "tech-vllm": "Højtydende LLM-servering",
  "tech-transformers": "LLMs og NLP",
  "tech-mongodb": "Datalagring",
  "tech-docker": "Containerisering",
  "tech-git": "Versionskontrol",
  "focus-title": "Nuværende fokus",
  "focus-description": "Det, jeg bygger og forsker i lige nu",
  "focus-scaling-title": "Skalering af maskinoversættelse til 201 sprog",
  "focus-scaling-desc": "Udvidelse af maskinoversættelsesdækning, samtidig med at kvaliteten opretholdes. Arbejde med massive flersprogede datasæt og optimering til sprog med få ressourcer ved hjælp af avancerede teknikker til overførsel af læring.",
  "focus-production-title": "Flersproget AI i produktion",
  "focus-production-desc": "Vi udvikler robuste oversættelsessystemer, der håndterer kompleksiteten i den virkelige verden i stor skala. Vi tackler udfordringer som kode-skift, domæne-tilpasning, støjende brugergenereret indhold og opretholder kvaliteten for mere end 200 millioner daglige brugere.",
  "tag-realtime": "Real-time servering",
  "tag-quality": "Kvalitetssikring",
  "tag-data": "Data",
  "resume-title": "CV",
  "resume-description": "AI-ingeniør og -forsker med omfattende erfaring i at bygge og skalere flersprogede maskinoversættelsessystemer. Dokumenteret erfaring med at betjene mere end 200 millioner brugere gennem innovative LLM-løsninger.",
  "experience-title": "Erhvervserfaring",
  "current-role": "AI-ingeniør og forsker",
  "current-company": "Translated, Rom, Italien",
  "lara-desc": "<strong>Lara:</strong> Arbejdede på hele F&U-pipelinen for en LLM, der er optimeret til maskinoversættelse: fra dataindsamling og modeltræning til justering og optimering af konklusioner. Bygget fra bunden i et startup-lignende team på fire, der opererer inden for virksomheden. Nu er det det vigtigste B2B-produkt, der oversætter alt indhold over hele verden for Airbnb og det meste af Uber, Shopify, Nike og flere, og når ud til over 200 millioner brugere globalt. Der er også for nylig lanceret en B2C-version.",
  "try-here": "Prøv det her",
  "lara-grande-desc": "<strong>Lara Grande:</strong> Nøglerolle i skalering af LLM for at matche kvaliteten af de bedste 1 % af professionelle oversættere. Brugte over 1.000 GPU'er på CINECA's HPC-klynge til storstilet distribueret træning.",
  "language-expansion-desc": "<strong>Sprogudvidelse:</strong> Identificerede og ledede et vellykket forskningsprojekt for at udvide maskinoversættelsesproduktionens dækning fra 56 til 201 sprog, en 4× stigning, hvilket gør det til den første kommercielle maskinoversættelsesmotor, der understøtter et sådant interval. Foreslog retningen, designede implementeringsplanen og ledede den til færdiggørelse inden for otte måneder.",
  "instruction-mt-desc": "<strong>Instruktionsfølgende maskinoversættelse:</strong> Ledede forskning, der justerer LLM til at følge detaljerede stilguider ved hjælp af SFT og DPO.",
  "trust-attention-desc": "<strong>Trust Attention:</strong> Foreslog og validerede en ny teknik, der prioriterer træningsdata af høj værdi, og opnåede de mest betydelige forbedringer af maskinoversættelseskvaliteten på fem år.",
  "polyglot-desc": "<strong>Polyglot:</strong> Udviklede en sprogidentifikationsmodel, der understøtter 201 sprog.",
  "startup-title": "Erfaring fra en startup",
  "startup-role": "Medstifter og AI-ingeniør",
  "italy": "Italien",
  "startup-desc1": "Medstiftede AI-startup som en del af en tre-personers stiftelsesteam, der byggede en billedgeolokaliseringsplatform",
  "startup-desc2": "Udviklede kernemodellen til billedgeolokalisering ved hjælp af visionstransformere og hentningsbaserede teknikker",
  "startup-desc3": "Fik værdifuld erfaring i et tempofyldt startup-miljø og produktudvikling",
  "startup-desc4": "Lærte vigtige ting om teamdynamik, usikkerhedsstyring og hurtig iteration",
  "education-title": "Uddannelse",
  "masters-full": "M.S. kunstig intelligens og datateknik",
  "university-location": "Universitetet i Pisa, Pisa, Italien",
  "masters-description": "110/110 summa cum laude (4,0 GPA). Specialiseret i datamining, maskinlæring, computervision, naturlig sprogbehandling, optimeringsteori og procesmining. Fik praktisk erfaring med distribuerede systemer, cloud computing og værktøjer som MongoDB, Neo4j, Docker, Kubernetes, TensorFlow og PyTorch.",
  "bachelors-full": "Bachelor i datateknik",
  "bachelors-description": "110/110 (4,0 GPA). Stærkt fundament inden for datateknik, herunder matematik, fysik, algoritmer, databaser, computerarkitektur, computernetværk, operativsystemer og programmering i C, C++, Java, Python, Matlab, SQL, JavaScript og PHP.",
  "portfolio-title": "Portefølje",
  "portfolio-description": "En samling af mine AI- og maskinlæringsprojekter, fra akademisk forskning til produktionssystemer, der betjener millioner af brugere over hele verden.",
  "t4sa-desc": "Krydsmodal visuel følelsesanalysesystem ved hjælp af viden destillation fra tekst til visuelle modeller. Offentliggjort på ECAI 2023, hvor der opnås topmoderne resultater inden for visuel følelsesforudsigelse.",
  "numpygpt-desc": "En GPT bygget fra bunden med NumPy og Pythons standardbibliotek. Ingen autograd, ingen frameworks: hvert lag er re-implementeret med sin egen forward og backward pass. Gradienter beregnes manuelt, opdateringer er gennemsigtige, og hver operation er stavet ud.",
  "fake-news-desc": "Multimodalt AI-system til detektering af misinformation ved hjælp af transformerarkitekturer. Indeholder holdningsanalyse og vurdering af kildens troværdighed.",
  "unimusic-desc": "Skalerbar musikopdagelsesplatform med hybrid MongoDB/Neo4j-arkitektur. Håndterer millioner af numre med algoritmer til anbefalinger i realtid.",
  "voice-vibes-desc": "Taleemotionsgenkendelsessystem med seks nye AI-arkitekturer. Opnåede 94 % nøjagtighed ved hjælp af ensemblemetoder og avanceret funktionskonstruktion.",
  "federated-dbscan-desc": "Privatlivsbeskyttende distribueret clustering med fødereret læring. Muliggør samarbejdende ML uden datadeling, hvilket opnår 99 % beskyttelse af privatlivets fred.",
  "pagerank-desc": "Højtydende PageRank-algoritmeimplementering med optimerede sparse matrix-operationer. Håndterer grafer med millioner af noder effektivt.",
  "contact-title": "Kontakt",
  "contact-description": "Lad os komme i kontakt! Uanset om du vil diskutere AI, maskinlæring eller potentielle samarbejder, er jeg altid åben for interessante samtaler.",
  "location-label": "Beliggenhed:",
  "location": "Rom, Italien",
  "form-name": "Dit navn",
  "form-email": "Din e-mail",
  "form-subject": "Emne",
  "form-message": "Besked",
  "form-loading": "Indlæser",
  "form-success": "Din besked er blevet sendt. Tak!",
  "form-send": "Send besked"
}