{
  "nav-home": "Startseite",
  "nav-about": "Über mich",
  "nav-tech": "Technologiestack",
  "nav-resume": "Lebenslauf",
  "nav-portfolio": "Portfolio",
  "nav-contact": "Kontakt",
  "language-label": "Sprache",
  "language-selector-header": "Sprache wählen ({count} verfügbar)",
  "hero-subtitle": "KI Ihre Sprache sprechen lassen, ein Modell nach dem anderen",
  "multilingual-typed": [
    "I train LLMs to speak your language.",
    "我训练大型语言模型来讲你的语言。",
    "Entreno LLMs para hablar tu idioma.",
    "Ich trainiere LLMs, damit sie deine Sprache sprechen.",
    "J'entraîne des LLM pour qu'ils parlent votre langue.",
    "あなたの言語を话せるように、LLMを訓練しています。",
    "Treino LLMs para falar o seu idioma.",
    "أقوم بتدريب LLM لتتحدث لغتك.",
    "Alleno LLM per parlare la tua lingua.",
    "Я обучаю LLM говорить на вашем языке."
  ],
  "about-title": "Über mich in O(1)",
  "about-description": "Ich bin KI-Forscher und -Ingenieur und konzentriere mich auf mehrsprachige große Sprachmodelle.",
  "about-role": "KI-Ingenieur:in und -Forscher:in",
  "about-intro": "Bei Translated habe ich geholfen, Lara von Grund auf neu zu entwickeln, ein LLM für maschinelle Übersetzung, das Inhalte für Airbnb, Uber, Shopify und andere bereitstellt und über 200 Millionen Benutzer erreicht.",
  "birth-place-label": "Geburtsort:",
  "birth-place": "Neapel, Italien",
  "email-label": "E-Mail:",
  "city-label": "Stadt:",
  "city": "Rom, Italien",
  "masters-label": "M.Sc. Abschluss:",
  "masters-degree": "KI & Daten-Engineering",
  "bachelors-label": "Bachelor-Abschluss:",
  "bachelors-degree": "Technische Informatik",
  "university-label": "Universität:",
  "university": "Universität Pisa",
  "languages-label": "Sprachen:",
  "languages": "Italienisch, Englisch",
  "focus-label": "Fokus:",
  "focus": "Mehrsprachige LLMs",
  "about-conclusion": "Ich habe das Training auf über 1.000 GPUs skaliert und die Abdeckung der maschinellen Übersetzung auf 201 Sprachen erweitert. Ich war Mitbegründer von <a href=\"https://picarta.ai/\" target=\"_blank\" style=\"color: var(--accent-primary); text-decoration: none; font-weight: 600;\">Picarta.ai</a>, einem KI-Start-up, das eine Bild-Geolokalisierungsplattform entwickelt. Ich bin ein unersättlicher Lerner, der ständig danach strebt, seine Denkweise, sein Training und seine Bauweise zu verbessern. Ich kann mir ein Leben ohne irgendeine Form von Training nicht vorstellen, sei es mit GPUs, Hantelscheiben im Fitnessstudio oder bei der Vorbereitung auf einen Marathon.",
  "tech-title": "Technologien und Werkzeuge",
  "focus-title": "Aktueller Fokus",
  "focus-description": "Was ich gerade baue und erforsche",
  "focus-scaling-title": "Skalierung der maschinellen Übersetzung auf 201 Sprachen",
  "focus-scaling-desc": "Erweiterung der maschinellen Übersetzung bei gleichbleibender Qualität. Arbeiten mit umfangreichen mehrsprachigen Datensätzen und Optimierung für Sprachen mit geringen Ressourcen mithilfe fortschrittlicher Techniken des Transferlernens.",
  "focus-production-title": "Mehrsprachige KI in der Produktion",
  "focus-production-desc": "Wir entwickeln robuste Übersetzungssysteme, die die Komplexität der realen Welt in großem Maßstab bewältigen. Wir meistern Herausforderungen wie Code-Switching, Domänenanpassung, verrauschte benutzergenerierte Inhalte und die Aufrechterhaltung der Qualität bei über 200 Millionen täglichen Nutzern.",
  "tag-realtime": "Echtzeit-Bereitstellung",
  "tag-quality": "Qualitätssicherung",
  "resume-title": "Lebenslauf",
  "resume-description": "KI-Ingenieur und -Forscher mit umfassender Erfahrung im Aufbau und der Skalierung mehrsprachiger maschineller Übersetzungssysteme. Nachgewiesene Erfolgsbilanz bei der Betreuung von über 200 Millionen Nutzern durch innovative LLM-Lösungen.",
  "experience-title": "Berufserfahrung",
  "current-role": "KI-Ingenieur:in und -Forscher:in",
  "current-company": "Translated, Rom, Italien",
  "lara-desc": "<strong>Lara:</strong> Arbeitete an der gesamten F&E-Pipeline eines für die maschinelle Übersetzung optimierten LLM: von der Datenerfassung und dem Modelltraining bis hin zur Ausrichtungs- und Inferenzoptimierung. Von Grund auf neu aufgebaut in einem vierköpfigen Team im Startup-Stil, das innerhalb des Unternehmens tätig ist. Heute ist es das Flaggschiff unter den B2B-Produkten und übersetzt alle Inhalte weltweit für Airbnb und den Großteil von Uber, Shopify, Nike und anderen Unternehmen, mit über 200 Millionen Nutzern weltweit. Vor kurzem wurde auch eine B2C-Version auf den Markt gebracht.",
  "try-here": "Hier ausprobieren",
  "lara-grande-desc": "<strong>Lara Grande:</strong> Schlüsselrolle bei der Skalierung von LLM, um die Qualität der besten 1 % der professionellen Übersetzer zu erreichen. Verwendete über 1.000 GPUs auf dem HPC-Cluster von CINECA für groß angelegte verteilte Schulungen.",
  "language-expansion-desc": "<strong>Spracherweiterung:</strong> Identifizierung und Leitung eines erfolgreichen Forschungsprojekts zur Erweiterung der Produktionsabdeckung für maschinelle Übersetzungen von 56 auf 201 Sprachen, eine 4-fache Steigerung, wodurch es die erste kommerzielle maschinelle Übersetzungsmaschine ist, die einen solchen Bereich unterstützt. Schlug die Richtung vor, entwarf den Umsetzungsplan und führte ihn innerhalb von acht Monaten zum Abschluss.",
  "instruction-mt-desc": "<strong>Anweisungsfolgende maschinelle Übersetzung:</strong> Leitung der Forschung zur Ausrichtung von LLM, um detaillierte Stilrichtlinien mit SFT und DPO zu befolgen.",
  "trust-attention-desc": "<strong>Vertrauenswürdigkeit:</strong> Entwicklung und Validierung einer neuartigen Technik, die hochwertige Trainingsdaten priorisiert und die bedeutendsten Verbesserungen der maschinellen Übersetzungsqualität in fünf Jahren erzielt.",
  "polyglot-desc": "<strong>Polyglot:</strong> Entwickelte ein Sprachidentifikationsmodell, das 201 Sprachen unterstützt.",
  "startup-title": "Erfahrung in Start-ups",
  "startup-role": "Mitbegründerin und KI-Ingenieurin",
  "italy": "Italien",
  "startup-desc1": "Mitbegründung eines KI-Startups als Teil eines dreiköpfigen Gründungsteams, das eine Bild-Geolokalisierungsplattform aufbaut",
  "startup-desc2": "Entwicklung des Kernmodells für die Bildgeolokalisierung unter Verwendung von Vision-Transformern und abrufbasierten Techniken",
  "startup-desc3": "Sammelte wertvolle Erfahrungen in einem schnelllebigen Startup-Umfeld und in der Produktentwicklung",
  "startup-desc4": "Wichtige Erkenntnisse über Teamdynamik, Umgang mit Unsicherheiten und schnelle Iteration gewonnen",
  "education-title": "Bildung",
  "masters-full": "M.S. Künstliche Intelligenz & Dateningenieurwesen",
  "university-location": "Universität Pisa, Pisa, Italien",
  "masters-description": "110/110 summa cum laude (4,0 GPA). Spezialisiert auf Data Mining, maschinelles Lernen, Computer Vision, Verarbeitung natürlicher Sprache, Optimierungstheorie und Process Mining. Praktische Erfahrung mit verteilten Systemen, Cloud Computing und Tools wie MongoDB, Neo4j, Docker, Kubernetes, TensorFlow und PyTorch.",
  "bachelors-full": "B.S. Computertechnik",
  "bachelors-description": "110/110 (4,0 GPA). Starke Grundlagen in Informatik, einschließlich Mathematik, Physik, Algorithmen, Datenbanken, Computerarchitektur, Computernetzwerke, Betriebssysteme und Programmierung in C, C++, Java, Python, Matlab, SQL, JavaScript und PHP.",
  "portfolio-title": "Portfolio",
  "portfolio-description": "Eine Sammlung meiner KI- und maschinellen Lernprojekte, von akademischer Forschung bis hin zu Produktionssystemen, die Millionen von Nutzern weltweit dienen.",
  "t4sa-desc": "Kreuzmodales visuelles Stimmungsanalysesystem mit Wissensdestillation von Text- zu Bildmodellen. Veröffentlicht auf der ECAI 2023, mit hochmodernen Ergebnissen bei der visuellen Stimmungsvorhersage.",
  "numpygpt-desc": "Ein von Grund auf neu erstelltes GPT, das mit NumPy und der Standardbibliothek von Python erstellt wurde. Kein Autograd, keine Frameworks: Jede Schicht wird mit ihrem eigenen Vorwärts- und Rückwärtsdurchlauf neu implementiert. Gradienten werden manuell berechnet, Aktualisierungen sind transparent und jede Operation wird buchstabiert.",
  "fake-news-desc": "Multimodales KI-System zur Erkennung von Fehlinformationen mit Hilfe von Transformatorarchitekturen. Mit Stance-Analyse und Bewertung der Glaubwürdigkeit der Quelle.",
  "unimusic-desc": "Skalierbare Musikentdeckungsplattform mit hybrider MongoDB/Neo4j-Architektur. Verarbeitet Millionen von Titeln mit Echtzeit-Empfehlungsalgorithmen.",
  "voice-vibes-desc": "Sprachemotionserkennungssystem mit sechs neuartigen KI-Architekturen. Erreichte 94 % Genauigkeit mit Ensemble-Methoden und fortschrittlichem Feature-Engineering.",
  "federated-dbscan-desc": "Datenschutzbewahrendes verteiltes Clustering mit föderiertem Lernen. Ermöglicht kollaboratives ML ohne Datenaustausch und erreicht 99 % Datenschutz.",
  "pagerank-desc": "Hochleistungs-PageRank-Algorithmus-Implementierung mit optimierten Sparse-Matrix-Operationen. Verarbeitet effizient Graphen mit Millionen von Knoten.",
  "contact-title": "Kontakt",
  "contact-description": "Lassen Sie uns in Kontakt treten! Egal, ob Sie über KI, maschinelles Lernen oder mögliche Kooperationen sprechen möchten, ich bin immer offen für interessante Gespräche.",
  "location-label": "Standort:",
  "location": "Rom, Italien",
  "form-name": "Ihr Name",
  "form-email": "Ihre E-Mail-Adresse",
  "form-subject": "Betreff",
  "form-message": "Nachricht",
  "form-loading": "Laden",
  "form-success": "Ihre Nachricht wurde erfolgreich versendet. Vielen Dank!",
  "form-send": "Nachricht senden",
  "tech-pytorch": "Deep Learning",
  "tech-python": "Hauptsprache",
  "tech-slurm": "HPC-Job-Planung",
  "tech-vllm": "Hochleistungs-LLM-Bereitstellung",
  "tech-transformers": "LLMs & NLP",
  "tech-mongodb": "Datenspeicherung",
  "tech-docker": "Containerisierung",
  "tech-git": "Versionskontrolle",
  "tag-data": "Daten"
}