{
  "nav-home": "Startseite",
  "nav-about": "Über mich",
  "nav-tech": "Technologien",
  "nav-resume": "Lebenslauf",
  "nav-portfolio": "Portfolio",
  "nav-contact": "Kontakt",
  "language-label": "Sprache",
  
  "hero-subtitle": "KI dazu bringen, deine Sprache zu sprechen, ein Modell nach dem anderen",
  "hero-typed": ["ein KI-Forscher", "ein Ingenieur", "ein Entwickler"],
  
  "about-title": "Über mich in O(1)",
  "about-description": "Ich bin ein KI-Forscher und -Ingenieur, spezialisiert auf mehrsprachige große Sprachmodelle, die LLMs dazu bringen, deine Sprache zu sprechen.",
  "about-role": "KI-Ingenieur & Forscher",
  "about-intro": "Bei Translated half ich dabei, Lara von Grund auf zu entwickeln, ein maschinelles Übersetzungs-LLM, das Inhalte für Airbnb, Uber, Shopify und andere bereitstellt und über 200 Millionen Nutzer erreicht.",
  "birth-place-label": "Geburtsort:",
  "birth-place": "Neapel, Italien",
  "email-label": "E-Mail:",
  "city-label": "Stadt:",
  "city": "Rom, Italien",
  "masters-label": "Master-Abschluss:",
  "masters-degree": "KI & Daten-Engineering",
  "bachelors-label": "Bachelor-Abschluss:",
  "bachelors-degree": "Informatik-Ingenieurwesen",
  "university-label": "Universität:",
  "university": "Universität Pisa",
  "languages-label": "Sprachen:",
  "languages": "Italienisch, Englisch",
  "focus-label": "Fokus:",
  "focus": "Mehrsprachige LLMs",
  "about-conclusion": "Ich habe das Training auf über 1.000 GPUs skaliert und die MT-Abdeckung auf 201 Sprachen erweitert. In Abend- und Wochenendarbeit gründete ich ein KI-Startup mit, das eine Bildgeolokalisierungsplattform entwickelt. Ich bin ein wissbegieriger Lerner, der ständig danach strebt zu verbessern, wie ich denke, trainiere und entwickle. Ich kann mir ein Leben ohne eine Form des Trainings nicht vorstellen, sei es GPUs, Gewichte im Fitnessstudio oder Marathon-Vorbereitung.",
  
  "tech-title": "Technologien & Werkzeuge 🛠️",
  
  "focus-title": "Aktueller Fokus 🎯",
  "focus-description": "Woran ich gerade arbeite und forsche",
  "focus-scaling-title": "Skalierung von MT auf 201 Sprachen",
  "focus-scaling-desc": "Erweiterung der maschinellen Übersetzungsabdeckung bei gleichzeitiger Qualitätserhaltung. Arbeit mit massiven mehrsprachigen Datensätzen und Optimierung für ressourcenarme Sprachen unter Verwendung fortgeschrittener Transfer-Learning-Techniken.",
  "focus-production-title": "Mehrsprachige KI in der Produktion",
  "focus-production-desc": "Aufbau robuster Übersetzungssysteme, die reale Komplexität im großen Maßstab bewältigen. Bewältigung von Herausforderungen wie Code-Switching, Domänenanpassung und Qualitätserhaltung für über 200 Millionen tägliche Nutzer.",
  "tag-realtime": "Echtzeit-Serving",
  "tag-quality": "Qualitätssicherung",
  
  "resume-title": "Lebenslauf",
  "resume-description": "KI-Ingenieur und -Forscher mit umfangreicher Erfahrung im Aufbau und der Skalierung mehrsprachiger maschineller Übersetzungssysteme. Bewährte Erfolgsbilanz bei der Bedienung von 200+ Millionen Nutzern durch innovative LLM-Lösungen.",
  "education-title": "Ausbildung",
  "masters-full": "Master in Künstlicher Intelligenz & Daten-Engineering",
  "university-location": "Universität Pisa, Pisa, Italien",
  "masters-description": "110/110 summa cum laude (4.0 GPA). Spezialisiert auf Data Mining, Machine Learning, Computer Vision, Natural Language Processing, Optimierungstheorie und Process Mining. Praktische Erfahrung mit verteilten Systemen, Cloud Computing und Tools wie MongoDB, Neo4j, Docker, Kubernetes, TensorFlow und PyTorch.",
  "bachelors-full": "Bachelor in Informatik-Ingenieurwesen",
  "bachelors-description": "110/110 (4.0 GPA). Solide Grundlage in Informatik-Ingenieurwesen einschließlich Mathematik, Physik, Algorithmen, Datenbanken, Computerarchitektur, Computernetzwerke, Betriebssysteme und Programmierung in C, C++, Java, Python, Matlab, SQL, JavaScript und PHP.",
  "experience-title": "Berufserfahrung",
  "current-role": "KI-Ingenieur & Forscher",
  "current-company": "Translated, Rom, Italien",
  "lara-desc": "<strong>Lara:</strong> Arbeitete an der vollständigen F&E-Pipeline eines für MT optimierten LLM: von Datensammlung und Modelltraining bis hin zu Alignment und Inferenz-Optimierung. Von Grund auf innerhalb eines startup-ähnlichen Teams von vier Personen entwickelt, das innerhalb des Unternehmens operiert. Jetzt das Flaggschiff-B2B-Produkt, übersetzt es alle weltweiten Inhalte für Airbnb und den Großteil von Uber, Shopify, Nike und mehr, erreicht über 200M Nutzer global. Eine B2C-Version wurde ebenfalls kürzlich gestartet.",
  "lara-grande-desc": "<strong>Lara Grande:</strong> Schlüsselrolle bei der Skalierung des LLM, um die Qualität des oberen 1% professioneller Übersetzer zu erreichen. Verwendete über 1.000 GPUs auf CINECAs HPC-Cluster für großangelegtes verteiltes Training.",
  "language-expansion-desc": "<strong>Spracherweiterung:</strong> Identifizierte und leitete ein erfolgreiches Forschungsprojekt zur Erweiterung der maschinellen Übersetzungsabdeckung in der Produktion von 56 auf 201 Sprachen, eine 4×-Erhöhung, wodurch es die erste kommerzielle MT-Engine wurde, die eine solche Bandbreite unterstützt. Schlug die Richtung vor, entwarf den Implementierungsplan und führte es innerhalb von acht Monaten zur Vollendung.",
  "instruction-mt-desc": "<strong>Instruktions-folgende MT:</strong> Leitete Forschung zur Ausrichtung von LLM auf detaillierte Stilrichtlinien unter Verwendung von SFT und DPO.",
  "trust-attention-desc": "<strong>Trust Attention:</strong> Schlug eine neuartige Technik vor und validierte sie, die hochwertige Trainingsdaten priorisiert und die bedeutendsten MT-Qualitätsverbesserungen in fünf Jahren erreichte.",
  "polyglot-desc": "<strong>Polyglot:</strong> Entwickelte ein Sprachidentifikationsmodell, das 201 Sprachen unterstützt.",
  "startup-role": "Mitgründer & KI-Ingenieur",
  "italy": "Italien",
  "startup-desc1": "Mitgründung eines KI-Startups als Teil des dreiköpfigen Gründerteams, das eine Bildgeolokalisierungsplattform entwickelt",
  "startup-desc2": "Entwickelte das Kernmodell für Bildgeolokalisierung unter Verwendung von Vision Transformers und retrieval-basierten Techniken",
  "startup-desc3": "Sammelte wertvolle Erfahrungen in schnelllebiger Startup-Umgebung und Produktentwicklung",
  "startup-desc4": "Lernte entscheidende Lektionen über Teamdynamik, Unsicherheitsmanagement und schnelle Iteration",
  "try-here": "Hier ausprobieren",
  
  "portfolio-title": "Portfolio 🚀",
  "portfolio-description": "Eine Sammlung meiner KI- und Machine-Learning-Projekte, von akademischer Forschung bis hin zu Produktionssystemen, die Millionen von Nutzern weltweit bedienen.",
  "t4sa-desc": "Cross-modales visuelles Sentiment-Analysesystem unter Verwendung von Wissensdestillation von Text- zu Vision-Modellen. Veröffentlicht bei ECAI 2023, erreichte state-of-the-art Ergebnisse bei visueller Sentiment-Vorhersage.",
  "numpygpt-desc": "Ein von Grund auf erstelltes GPT mit NumPy und Pythons Standardbibliothek. Kein Autograd, keine Frameworks: jede Schicht wird mit eigenem Vorwärts- und Rückwärtspass neu implementiert. Gradienten werden manuell berechnet, Updates sind transparent, und jede Operation ist spezifiziert.",
  "fake-news-desc": "Multi-modales KI-System zur Desinformationserkennung unter Verwendung von Transformer-Architekturen. Beinhaltet Stance-Analyse und Glaubwürdigkeitsbewertung von Quellen.",
  "unimusic-desc": "Skalierbare Musikentdeckungsplattform mit hybrider MongoDB/Neo4j-Architektur. Verwaltet Millionen von Tracks mit Echtzeit-Empfehlungsalgorithmen.",
  "voice-vibes-desc": "Sprachemotion-Erkennungssystem mit sechs neuartigen KI-Architekturen. Erreichte 94% Genauigkeit unter Verwendung von Ensemble-Methoden und fortgeschrittener Feature-Engineering.",
  "federated-dbscan-desc": "Datenschutz-erhaltender verteilter Clustering mit Federated Learning. Ermöglicht kollaboratives ML ohne Datenaustausch, erreicht 99% Datenschutzerhaltung.",
  "pagerank-desc": "Hochleistungs-PageRank-Algorithmus-Implementierung mit optimierten sparse Matrix-Operationen. Verwaltet Graphen mit Millionen von Knoten effizient.",
  
  "cta-title": "Lass uns gemeinsam die Zukunft der KI gestalten",
  "cta-description": "Ob du an bahnbrechender Forschung zusammenarbeiten, die neuesten Entwicklungen in mehrsprachigen LLMs diskutieren oder erkunden möchtest, wie KI dein Unternehmen transformieren kann, ich bin immer begeistert, mich mit Innovatoren und Problemlösern zu vernetzen.",
  "cta-button1": "Gespräch beginnen",
  "cta-button2": "Direkte E-Mail senden",
  
  "contact-title": "Kontakt",
  "contact-description": "Lass uns vernetzen! Ob du über KI, Machine Learning oder potenzielle Kooperationen sprechen möchtest, ich bin immer offen für interessante Gespräche.",
  "location-label": "Standort",
  "location": "Rom, Italien",
  "form-name": "Dein Name",
  "form-email": "Deine E-Mail",
  "form-subject": "Betreff",
  "form-message": "Nachricht",
  "form-loading": "Lädt",
  "form-success": "Deine Nachricht wurde gesendet. Danke!",
  "form-send": "Nachricht senden"
} 