{
  "nav-home": "Αρχική σελίδα",
  "nav-about": "Σχετικά",
  "nav-tech": "Τεχνολογικό Stack",
  "nav-resume": "Βιογραφικό",
  "nav-portfolio": "Χαρτοφυλάκιο",
  "nav-contact": "Επικοινωνία",
  "language-label": "Γλώσσα",
  "language-selector-header": "Επιλέξτε γλώσσα ({count} διαθέσιμη)",
  "hero-subtitle": "Κάνουμε την τεχνητή νοημοσύνη να μιλάει τη γλώσσα σας, ένα μοντέλο τη φορά",
  "multilingual-typed": [
    "I train LLMs to speak your language.",
    "我训练大型语言模型来讲你的语言。",
    "Entreno LLMs para hablar tu idioma.",
    "Ich trainiere LLMs, damit sie deine Sprache sprechen.",
    "J'entraîne des LLM pour qu'ils parlent votre langue.",
    "あなたの言語を话せるように、LLMを訓練しています。",
    "Treino LLMs para falar o seu idioma.",
    "أقوم بتدريب LLM لتتحدث لغتك.",
    "Alleno LLM per parlare la tua lingua.",
    "Я обучаю LLM говорить на вашем языке."
  ],
  "about-title": "Σχετικά με εμένα στο O(1)",
  "about-description": "Είμαι ερευνητής και μηχανικός τεχνητής νοημοσύνης που επικεντρώνεται σε πολύγλωσσα μεγάλα γλωσσικά μοντέλα.",
  "about-role": "Μηχανικός και Ερευνητής Τεχνητής Νοημοσύνης",
  "about-intro": "Στην Translated, βοήθησα στην ανάπτυξη της Lara από την πρώτη μέρα, ενός LLM μηχανικής μετάφρασης που τροφοδοτεί περιεχόμενο σε πραγματικό χρόνο για την Airbnb, την Uber, τη Shopify και άλλες εταιρείες, φτάνοντας πάνω από 200 εκατομμύρια χρήστες.",
  "birth-place-label": "Τόπος Γέννησης:",
  "birth-place": "Νάπολη, Ιταλία",
  "email-label": "Email:",
  "city-label": "Πόλη:",
  "city": "Ρώμη, Ιταλία",
  "masters-label": "Μεταπτυχιακό Δίπλωμα:",
  "masters-degree": "Τεχνητή νοημοσύνη και μηχανική δεδομένων",
  "bachelors-label": "Πτυχίο B.S.:",
  "bachelors-degree": "Μηχανικός Υπολογιστών",
  "university-label": "Πανεπιστήμιο:",
  "university": "Πανεπιστήμιο της Πίζας",
  "languages-label": "Γλώσσες:",
  "languages": "Ιταλικά, Αγγλικά",
  "focus-label": "Εστίαση:",
  "focus": "Πολύγλωσσα LLM",
  "about-conclusion": "Έχω κλιμακώσει την εκπαίδευση σε 1.000+ GPU και έχω επεκτείνει την κάλυψη της μηχανικής μετάφρασης σε 201 γλώσσες. Έχω συνιδρύσει την <a href=\"https://picarta.ai/\" target=\"_blank\" style=\"color: var(--accent-primary); text-decoration: none; font-weight: 600;\">Picarta.ai</a>, μια νεοσύστατη εταιρεία τεχνητής νοημοσύνης που δημιουργεί μια πλατφόρμα για τη γεωγραφική τοποθέτηση εικόνων. Είμαι ένας αδηφάγος μαθητής που προσπαθεί συνεχώς να βελτιώσει τον τρόπο που σκέφτεται, εκπαιδεύεται και δημιουργεί. Δεν μπορώ να φανταστώ μια ζωή χωρίς κάποια μορφή εκπαίδευσης, είτε πρόκειται για GPU, βάρη γυμναστηρίου ή προετοιμασία για μαραθώνιο.",
  "tech-title": "Τεχνολογίες και Εργαλεία",
  "tech-pytorch": "Βαθιά Μάθηση",
  "tech-python": "Κύρια Γλώσσα",
  "tech-slurm": "Προγραμματισμός Εργασιών HPC",
  "tech-vllm": "Υπηρεσία LLM Υψηλής Απόδοσης",
  "tech-transformers": "LLM και NLP",
  "tech-mongodb": "Αποθήκευση Δεδομένων",
  "tech-docker": "Εμπορευματοκιβώτια",
  "tech-git": "Έλεγχος Έκδοσης",
  "focus-title": "Τρέχουσα εστίαση",
  "focus-description": "Τι δημιουργώ και ερευνώ αυτήν τη στιγμή",
  "focus-scaling-title": "Κλιμάκωση της μηχανικής μετάφρασης σε 201 γλώσσες",
  "focus-scaling-desc": "Επέκταση της κάλυψης της μηχανικής μετάφρασης με παράλληλη διατήρηση της ποιότητας. Εργασία με τεράστια πολύγλωσσα σύνολα δεδομένων και βελτιστοποίηση για γλώσσες με περιορισμένους πόρους, χρησιμοποιώντας προηγμένες τεχνικές μεταφοράς γνώσης.",
  "focus-production-title": "Πολύγλωσση τεχνητή νοημοσύνη στην παραγωγή",
  "focus-production-desc": "Δημιουργία ισχυρών συστημάτων μετάφρασης που διαχειρίζονται την πολυπλοκότητα του πραγματικού κόσμου σε μεγάλη κλίμακα. Αντιμετώπιση προκλήσεων, όπως η εναλλαγή κώδικα, η προσαρμογή τομέα, το περιεχόμενο που δημιουργείται από χρήστες και η διασφάλιση ποιότητας για πάνω από 200 εκατομμύρια καθημερινούς χρήστες.",
  "tag-realtime": "Εξυπηρέτηση σε Πραγματικό Χρόνο",
  "tag-quality": "Διασφάλιση Ποιότητας",
  "tag-data": "Δεδομένα",
  "resume-title": "Βιογραφικό",
  "resume-description": "Μηχανικός και ερευνητής τεχνητής νοημοσύνης με μεγάλη εμπειρία στη δημιουργία και την κλιμάκωση πολύγλωσσων συστημάτων μηχανικής μετάφρασης. Αποδεδειγμένη επιτυχία στην εξυπηρέτηση περισσότερων από 200 εκατομμυρίων χρηστών μέσω καινοτόμων λύσεων LLM.",
  "experience-title": "Επαγγελματική Εμπειρία",
  "current-role": "Μηχανικός και Ερευνητής Τεχνητής Νοημοσύνης",
  "current-company": "Translated, Ρώμη, Ιταλία",
  "lara-desc": "<strong>Lara:</strong> Εργάστηκε στην πλήρη διαδικασία έρευνας και ανάπτυξης ενός LLM που είναι βελτιστοποιημένο για μηχανική μετάφραση: από τη συλλογή δεδομένων και την εκπαίδευση μοντέλων έως την ευθυγράμμιση και τη βελτιστοποίηση των συμπερασμάτων. Δημιουργήθηκε από το μηδέν από μια τετραμελή ομάδα τύπου startup που δραστηριοποιείται εντός της εταιρείας. Πλέον, το εμβληματικό προϊόν B2B μεταφράζει όλο το περιεχόμενο παγκοσμίως για την Airbnb και το μεγαλύτερο μέρος της Uber, της Shopify, της Nike και άλλων, φτάνοντας σε πάνω από 200 εκατομμύρια χρήστες παγκοσμίως. Πρόσφατα κυκλοφόρησε και μια έκδοση B2C.",
  "try-here": "Δοκιμάστε το εδώ",
  "lara-grande-desc": "<strong>Lara Grande:</strong> Βασικός ρόλος στην κλιμάκωση του LLM για να ταιριάζει με την ποιότητα του κορυφαίου 1% των επαγγελματιών μεταφραστών. Χρησιμοποιήθηκαν πάνω από 1.000 GPU στο σύμπλεγμα HPC της CINECA για εκτεταμένη κατανεμημένη εκπαίδευση.",
  "language-expansion-desc": "<strong>Επέκταση γλώσσας:</strong> Προσδιόρισε και ηγήθηκε ενός επιτυχημένου ερευνητικού έργου για την επέκταση της κάλυψης παραγωγής μηχανικής μετάφρασης από 56 σε 201 γλώσσες, μια τετραπλάσια αύξηση, καθιστώντας την πρώτη εμπορική μηχανή μηχανικής μετάφρασης που υποστηρίζει ένα τέτοιο εύρος. Πρότεινα την κατεύθυνση, σχεδίασα το σχέδιο υλοποίησης και το ολοκλήρωσα μέσα σε οκτώ μήνες.",
  "instruction-mt-desc": "<strong>Μηχανική μετάφραση βάσει οδηγιών:</strong> Ηγήθηκα έρευνας για την ευθυγράμμιση του LLM με λεπτομερείς οδηγούς ύφους χρησιμοποιώντας SFT και DPO.",
  "trust-attention-desc": "<strong>Προσοχή εμπιστοσύνης:</strong> Πρότεινα και επικύρωσα μια νέα τεχνική που δίνει προτεραιότητα σε δεδομένα εκπαίδευσης υψηλής αξίας, επιτυγχάνοντας τις πιο σημαντικές βελτιώσεις στην ποιότητα της μηχανικής μετάφρασης σε πέντε χρόνια.",
  "polyglot-desc": "<strong>Polyglot:</strong> Αναπτύχθηκε ένα μοντέλο αναγνώρισης γλώσσας που υποστηρίζει 201 γλώσσες.",
  "startup-title": "Εμπειρία σε Νεοφυή Επιχείρηση",
  "startup-role": "Συνιδρύτρια και Μηχανικός Τεχνητής Νοημοσύνης",
  "italy": "Ιταλία",
  "startup-desc1": "Συνιδρύσατε μια νεοσύστατη εταιρεία τεχνητής νοημοσύνης ως μέλος μιας ομάδας τριών ατόμων που δημιούργησε μια πλατφόρμα γεωγραφικής καταγραφής εικόνων",
  "startup-desc2": "Ανέπτυξε το βασικό μοντέλο για τη γεωγραφική τοποθέτηση εικόνων χρησιμοποιώντας μετασχηματιστές όρασης και τεχνικές που βασίζονται στην ανάκτηση",
  "startup-desc3": "Απέκτησε πολύτιμη εμπειρία σε ένα ταχέως εξελισσόμενο περιβάλλον νεοσύστατων επιχειρήσεων και ανάπτυξης προϊόντων",
  "startup-desc4": "Αποκόμισε σημαντικά διδάγματα σχετικά με τη δυναμική της ομάδας, τη διαχείριση της αβεβαιότητας και την ταχεία επανάληψη",
  "education-title": "Εκπαίδευση",
  "masters-full": "M.S. Τεχνητή Νοημοσύνη & Μηχανική Δεδομένων",
  "university-location": "Πανεπιστήμιο της Πίζας, Πίζα, Ιταλία",
  "masters-description": "110/110 με άριστα (4,0 GPA). Ειδικεύεται στην εξόρυξη δεδομένων, τη μηχανική μάθηση, την όραση υπολογιστών, την επεξεργασία φυσικής γλώσσας, τη θεωρία βελτιστοποίησης και την εξόρυξη διαδικασιών. Απέκτησα πρακτική εμπειρία με κατανεμημένα συστήματα, υπολογιστικό νέφος και εργαλεία όπως MongoDB, Neo4j, Docker, Kubernetes, TensorFlow και PyTorch.",
  "bachelors-full": "Πτυχίο Μηχανικού Υπολογιστών",
  "bachelors-description": "110/110 (4.0 GPA). Ισχυρά θεμέλια στη μηχανική υπολογιστών, συμπεριλαμβανομένων των μαθηματικών, της φυσικής, των αλγορίθμων, των βάσεων δεδομένων, της αρχιτεκτονικής υπολογιστών, των δικτύων υπολογιστών, των λειτουργικών συστημάτων και του προγραμματισμού σε C, C++, Java, Python, Matlab, SQL, JavaScript και PHP.",
  "portfolio-title": "Χαρτοφυλάκιο",
  "portfolio-description": "Μια συλλογή των έργων μου για την τεχνητή νοημοσύνη και τη μηχανική μάθηση, από την ακαδημαϊκή έρευνα έως τα συστήματα παραγωγής που εξυπηρετούν εκατομμύρια χρήστες παγκοσμίως.",
  "t4sa-desc": "Σύστημα ανάλυσης οπτικής διάθεσης με χρήση απόσταξης γνώσεων από μοντέλα κειμένου σε οπτικά μοντέλα. Δημοσιεύθηκε στο ECAI 2023, επιτυγχάνοντας αποτελέσματα τελευταίας τεχνολογίας στην πρόβλεψη οπτικού συναισθήματος.",
  "numpygpt-desc": "Ένα GPT από το μηδέν, που δημιουργήθηκε με τη NumPy και την τυπική βιβλιοθήκη της Python. Χωρίς αυτόματη διαβάθμιση, χωρίς πλαίσια: κάθε επίπεδο υλοποιείται εκ νέου με το δικό του πέρασμα προς τα εμπρός και προς τα πίσω. Οι βαθμίδες υπολογίζονται χειροκίνητα, οι ενημερώσεις είναι διαφανείς και κάθε λειτουργία αναλύεται λεπτομερώς.",
  "fake-news-desc": "Πολυτροπικό σύστημα τεχνητής νοημοσύνης για την ανίχνευση παραπληροφόρησης με χρήση αρχιτεκτονικών μετασχηματιστών. Διαθέτει ανάλυση στάσης και βαθμολογία αξιοπιστίας πηγής.",
  "unimusic-desc": "Κλιμακούμενη πλατφόρμα ανακάλυψης μουσικής με υβριδική αρχιτεκτονική MongoDB/Neo4j. Διαχειρίζεται εκατομμύρια κομμάτια με αλγόριθμους προτάσεων σε πραγματικό χρόνο.",
  "voice-vibes-desc": "Σύστημα αναγνώρισης συναισθημάτων ομιλίας με έξι νέες αρχιτεκτονικές τεχνητής νοημοσύνης. Επιτεύχθηκε ακρίβεια 94% χρησιμοποιώντας μεθόδους συνόλου και προηγμένη μηχανική χαρακτηριστικών.",
  "federated-dbscan-desc": "Διανομή συστάδων που προστατεύει το απόρρητο με ομοσπονδιακή μάθηση. Επιτρέπει τη συνεργατική ML χωρίς κοινή χρήση δεδομένων, επιτυγχάνοντας διατήρηση της ιδιωτικότητας κατά 99%.",
  "pagerank-desc": "Υλοποίηση αλγορίθμου PageRank υψηλής απόδοσης με βελτιστοποιημένες λειτουργίες αραιής μήτρας. Διαχειρίζεται αποτελεσματικά γραφήματα με εκατομμύρια κόμβους.",
  "contact-title": "Επικοινωνία",
  "contact-description": "Ας συνδεθούμε! Είτε θέλετε να συζητήσετε για την τεχνητή νοημοσύνη, τη μηχανική μάθηση ή πιθανές συνεργασίες, είμαι πάντα ανοιχτός/ή σε ενδιαφέρουσες συζητήσεις.",
  "location-label": "Τοποθεσία:",
  "location": "Ρώμη, Ιταλία",
  "form-name": "Το όνομά σας",
  "form-email": "Το email σας",
  "form-subject": "Θέμα",
  "form-message": "Μήνυμα",
  "form-loading": "Φόρτωση",
  "form-success": "Το μήνυμά σας έχει σταλεί. Σας ευχαριστούμε!",
  "form-send": "Αποστολή"
}