{
  "nav-home": "Home",
  "nav-about": "About",
  "nav-tech": "Tech Stack",
  "nav-resume": "Resume",
  "nav-portfolio": "Portfolio",
  "nav-contact": "Contact",
  "language-label": "Language",
  
  "hero-subtitle": "Making AI speak your language, one model at a time",
  "hero-typed": ["an AI Researcher", "an Engineer", "a Builder"],
  
  "about-title": "About me in O(1)",
  "about-description": "I'm an AI researcher and engineer focused on multilingual large language models, making LLMs speak your language.",
  "about-role": "AI Engineer & Researcher",
  "about-intro": "At Translated, I helped build Lara from scratch, a machine translation LLM that powers content for Airbnb, Uber, Shopify, and others, reaching over 200 million users.",
  "birth-place-label": "Birth Place:",
  "birth-place": "Naples, Italy",
  "email-label": "Email:",
  "city-label": "City:",
  "city": "Rome, Italy",
  "masters-label": "M.S. Degree:",
  "masters-degree": "AI & Data Engineering",
  "bachelors-label": "B.S. Degree:",
  "bachelors-degree": "Computer Engineering",
  "university-label": "University:",
  "university": "University of Pisa",
  "languages-label": "Languages:",
  "languages": "Italian, English",
  "focus-label": "Focus:",
  "focus": "Multilingual LLMs",
  "about-conclusion": "I've scaled training to 1,000+ GPUs and expanded MT coverage to 201 languages. Working nights and weekends, I co-founded an AI startup building an image geolocalization platform. I'm a voracious learner who constantly pushes to improve how I think, train, and build. I can't imagine a life without some form of training, whether it's GPUs, gym plates, or marathon prep.",
  
  "tech-title": "Technologies & Tools 🛠️",
  
  "focus-title": "Current Focus 🎯",
  "focus-description": "What I'm building and researching right now",
  "focus-scaling-title": "Scaling MT to 201 Languages",
  "focus-scaling-desc": "Expanding machine translation coverage while maintaining quality. Working with massive multilingual datasets and optimizing for low-resource languages using advanced transfer learning techniques.",
  "focus-production-title": "Multilingual AI in Production",
  "focus-production-desc": "Building robust translation systems that handle real-world complexity at scale. Tackling challenges like code-switching, domain adaptation, and maintaining quality across 200+ million daily users.",
  "tag-realtime": "Real-time Serving",
  "tag-quality": "Quality Assurance",
  
  "resume-title": "Resume",
  "resume-description": "AI Engineer and Researcher with extensive experience in building and scaling multilingual machine translation systems. Proven track record of serving 200+ million users through innovative LLM solutions.",
  "education-title": "Education",
  "masters-full": "M.S. Artificial Intelligence & Data Engineering",
  "university-location": "University of Pisa, Pisa, Italy",
  "masters-description": "110/110 summa cum laude (4.0 GPA). Specialized in Data Mining, Machine Learning, Computer Vision, Natural Language Processing, Optimization Theory, and Process Mining. Gained hands-on experience with Distributed Systems, Cloud Computing, and tools like MongoDB, Neo4j, Docker, Kubernetes, TensorFlow, and PyTorch.",
  "bachelors-full": "B.S. Computer Engineering",
  "bachelors-description": "110/110 (4.0 GPA). Strong foundation in computer engineering including mathematics, physics, algorithms, databases, computer architecture, computer networks, operating systems, and programming in C, C++, Java, Python, Matlab, SQL, JavaScript, and PHP.",
  "experience-title": "Professional Experience",
  "current-role": "AI Engineer & Researcher",
  "current-company": "Translated, Rome, Italy",
  "lara-desc": "<strong>Lara:</strong> Worked on the full R&D pipeline of an LLM optimized for MT: from data collection and model training to alignment and inference optimization. Built from scratch within a startup-style team of four operating within the company. Now the flagship B2B product, it translates all content worldwide for Airbnb and most of Uber, Shopify, Nike, and more, reaching over 200M users globally. A B2C version has also recently launched.",
  "lara-grande-desc": "<strong>Lara Grande:</strong> Key role in scaling LLM to match the quality of the top 1% of professional translators. Used over 1,000 GPUs on CINECA's HPC cluster for large-scale distributed training.",
  "language-expansion-desc": "<strong>Language Expansion:</strong> Identified and led a successful research project to expand machine translation production coverage from 56 to 201 languages, a 4× increase, making it the first commercial MT engine to support such a range. Proposed the direction, designed the implementation plan, and led it to completion within eight months.",
  "instruction-mt-desc": "<strong>Instruction-following MT:</strong> Led research aligning LLM to follow detailed style guides using SFT and DPO.",
  "trust-attention-desc": "<strong>Trust Attention:</strong> Proposed and validated a novel technique prioritizing high-value training data, achieving the most significant MT quality improvements in five years.",
  "polyglot-desc": "<strong>Polyglot:</strong> Developed a Language Identification model supporting 201 languages.",
  "startup-role": "Co-Founder & AI Engineer",
  "italy": "Italy",
  "startup-desc1": "Co-founded AI startup as part of three-person founding team building image geolocalization platform",
  "startup-desc2": "Developed the core model for image geolocalization using vision transformers and retrieval-based techniques",
  "startup-desc3": "Gained valuable experience in fast-paced startup environment and product development",
  "startup-desc4": "Learned crucial lessons about team dynamics, uncertainty management, and rapid iteration",
  "try-here": "Try it here",
  
  "portfolio-title": "Portfolio 🚀",
  "portfolio-description": "A collection of my AI and machine learning projects, from academic research to production systems serving millions of users worldwide.",
  "t4sa-desc": "Cross-modal visual sentiment analysis system using knowledge distillation from text to vision models. Published at ECAI 2023, achieving state-of-the-art results on visual sentiment prediction.",
  "numpygpt-desc": "A from-scratch GPT built with NumPy and Python's standard library. No autograd, no frameworks: every layer is re-implemented with its own forward and backward pass. Gradients are computed manually, updates are transparent, and every operation is spelled out.",
  "fake-news-desc": "Multi-modal AI system for misinformation detection using transformer architectures. Features stance analysis and source credibility scoring.",
  "unimusic-desc": "Scalable music discovery platform with hybrid MongoDB/Neo4j architecture. Handles millions of tracks with real-time recommendation algorithms.",
  "voice-vibes-desc": "Speech emotion recognition system with six novel AI architectures. Achieved 94% accuracy using ensemble methods and advanced feature engineering.",
  "federated-dbscan-desc": "Privacy-preserving distributed clustering with federated learning. Enables collaborative ML without data sharing, achieving 99% privacy preservation.",
  "pagerank-desc": "High-performance PageRank algorithm implementation with optimized sparse matrix operations. Handles graphs with millions of nodes efficiently.",
  
  "cta-title": "Let's Build the Future of AI Together",
  "cta-description": "Whether you're looking to collaborate on cutting-edge research, discuss the latest in multilingual LLMs, or explore how AI can transform your business, I'm always excited to connect with fellow innovators and problem solvers.",
  "cta-button1": "Start a Conversation",
  "cta-button2": "Send Direct Email",
  
  "contact-title": "Contact",
  "contact-description": "Let's connect! Whether you want to discuss AI, machine learning, or potential collaborations, I'm always open to interesting conversations.",
  "location-label": "Location",
  "location": "Rome, Italy",
  "form-name": "Your Name",
  "form-email": "Your Email",
  "form-subject": "Subject",
  "form-message": "Message",
  "form-loading": "Loading",
  "form-success": "Your message has been sent. Thank you!",
  "form-send": "Send Message"
} 