{
  "nav-home": "Inicio",
  "nav-about": "Acerca de",
  "nav-tech": "Tecnologías",
  "nav-resume": "Currículum",
  "nav-portfolio": "Portafolio",
  "nav-contact": "Contacto",
  "language-label": "Idioma",
  "language-selector-header": "Seleccionar idioma ({count} disponibles)",
  "hero-subtitle": "Haciendo que la IA hable tu idioma, un modelo a la vez",
  "multilingual-typed": [
    "I train LLMs to speak your language.",
    "我训练大型语言模型来讲你的语言。",
    "Entreno LLMs para hablar tu idioma.",
    "Ich trainiere LLMs, damit sie deine Sprache sprechen.",
    "J'entraîne des LLM pour qu'ils parlent votre langue.",
    "あなたの言語を话せるように、LLMを訓練しています。",
    "Treino LLMs para falar o seu idioma.",
    "أقوم بتدريب LLM لتتحدث لغتك.",
    "Alleno LLM per parlare la tua lingua.",
    "Я обучаю LLM говорить на вашем языке."
  ],
  "about-title": "Sobre mí en O(1)",
  "about-description": "Soy investigadora e ingeniera de IA especializada en grandes modelos de lenguaje multilingües.",
  "about-role": "Ingeniero e investigador en IA",
  "about-intro": "En Translated, ayudé a crear desde cero a Lara, un LLM de traducción automática que potencia el contenido de Airbnb, Uber, Shopify y otros, llegando a más de 200 millones de usuarios.",
  "birth-place-label": "Lugar de nacimiento:",
  "birth-place": "Nápoles, Italia",
  "email-label": "Correo electrónico:",
  "city-label": "Ciudad:",
  "city": "Roma, Italia",
  "masters-label": "Título de máster:",
  "masters-degree": "IA e ingeniería de datos",
  "bachelors-label": "Licenciatura:",
  "bachelors-degree": "Ingeniería Informática",
  "university-label": "Universidad:",
  "university": "Universidad de Pisa",
  "languages-label": "Idiomas:",
  "languages": "Italiano, inglés",
  "focus-label": "Enfoque:",
  "focus": "LLM multilingües",
  "about-conclusion": "He escalado el entrenamiento a más de 1000 GPU y he ampliado la cobertura de traducción automática a 201 idiomas. Cofundé <a href=\"https://picarta.ai/\" target=\"_blank\" style=\"color: var(--accent-primary); text-decoration: none; font-weight: 600;\">Picarta.ai</a>, una empresa emergente de IA que desarrolla una plataforma de geolocalización de imágenes. Soy un aprendiz voraz que se esfuerza constantemente por mejorar su forma de pensar, entrenar y construir. No puedo imaginar una vida sin algún tipo de entrenamiento, ya sean GPU, pesas de gimnasio o preparación para una maratón.",
  "tech-title": "Tecnologías y herramientas",
  "focus-title": "Enfoque actual",
  "focus-description": "Lo que estoy construyendo e investigando en este momento",
  "focus-scaling-title": "Ampliación de la traducción automática a 201 idiomas",
  "focus-scaling-desc": "Ampliación de la cobertura de la traducción automática manteniendo la calidad. Trabajar con conjuntos de datos multilingües masivos y optimizar para idiomas de bajos recursos utilizando técnicas avanzadas de aprendizaje por transferencia.",
  "focus-production-title": "IA multilingüe en producción",
  "focus-production-desc": "Construimos sistemas de traducción robustos que manejan la complejidad del mundo real a gran escala. Abordamos desafíos como el cambio de código, la adaptación de dominios, el contenido generado por usuarios ruidosos y el mantenimiento de la calidad para más de 200 millones de usuarios diarios.",
  "tag-realtime": "Servicio en tiempo real",
  "tag-quality": "Garantía de calidad",
  "resume-title": "Currículum",
  "resume-description": "Ingeniero e investigador de IA con amplia experiencia en la creación y ampliación de sistemas de traducción automática multilingües. Trayectoria demostrada de servicio a más de 200 millones de usuarios a través de soluciones innovadoras de LLM.",
  "experience-title": "Experiencia profesional",
  "current-role": "Ingeniero e investigador en IA",
  "current-company": "Translated, Roma, Italia",
  "lara-desc": "<strong>Lara:</strong> Trabajó en el proceso completo de I+D de un LLM optimizado para la traducción automática: desde la recopilación de datos y el entrenamiento de modelos hasta la alineación y la optimización de la inferencia. Creado desde cero por un equipo de cuatro personas al estilo de una empresa emergente que opera dentro de la empresa. Ahora, el producto B2B insignia traduce todo el contenido en todo el mundo para Airbnb y la mayoría de Uber, Shopify, Nike y más, llegando a más de 200 millones de usuarios en todo el mundo. También se ha lanzado recientemente una versión B2C.",
  "try-here": "Pruébalo aquí",
  "lara-grande-desc": "<strong>Lara Grande:</strong> papel clave en la ampliación de LLM para igualar la calidad del 1 % de los mejores traductores profesionales. Se utilizaron más de 1000 GPU en el clúster HPC de CINECA para el entrenamiento distribuido a gran escala.",
  "language-expansion-desc": "<strong>Expansión lingüística:</strong> Identifiqué y dirigí un proyecto de investigación que logró ampliar la cobertura de la producción de traducción automática de 56 a 201 idiomas, un aumento de 4 veces, lo que la convierte en el primer motor de traducción automática comercial que admite tal rango. Propuse la dirección, diseñé el plan de implementación y lo llevé a cabo en un plazo de ocho meses.",
  "instruction-mt-desc": "<strong>Traducción automática que sigue instrucciones:</strong> Lideré la investigación para alinear el LLM para seguir guías de estilo detalladas utilizando SFT y DPO.",
  "trust-attention-desc": "<strong>Atención de confianza:</strong> propuse y validé una técnica novedosa que prioriza los datos de entrenamiento de alto valor, logrando las mejoras más significativas en la calidad de la traducción automática en cinco años.",
  "polyglot-desc": "<strong>Polyglot:</strong> Desarrolló un modelo de identificación de idiomas que admite 201 idiomas.",
  "startup-title": "Experiencia en startups",
  "startup-role": "Cofundador e ingeniero en IA",
  "italy": "Italia",
  "startup-desc1": "Cofundé una startup de IA como parte de un equipo fundador de tres personas para crear una plataforma de geolocalización de imágenes",
  "startup-desc2": "Desarrollé el modelo central para la geolocalización de imágenes utilizando transformadores de visión y técnicas basadas en la recuperación.",
  "startup-desc3": "Adquirí una valiosa experiencia en un entorno de puesta en marcha y desarrollo de productos de ritmo rápido",
  "startup-desc4": "Aprendimos lecciones cruciales sobre la dinámica de equipo, la gestión de la incertidumbre y la iteración rápida",
  "education-title": "Educación",
  "masters-full": "Máster en Inteligencia Artificial e Ingeniería de Datos",
  "university-location": "Universidad de Pisa, Pisa, Italia",
  "masters-description": "110/110 summa cum laude (4,0 GPA). Especializado en minería de datos, aprendizaje automático, visión por ordenador, procesamiento del lenguaje natural, teoría de la optimización y minería de procesos. Adquirí experiencia práctica con sistemas distribuidos, computación en la nube y herramientas como MongoDB, Neo4j, Docker, Kubernetes, TensorFlow y PyTorch.",
  "bachelors-full": "Licenciatura en Ingeniería Informática",
  "bachelors-description": "110/110 (4,0 GPA). Sólida base en ingeniería informática, incluyendo matemáticas, física, algoritmos, bases de datos, arquitectura informática, redes informáticas, sistemas operativos y programación en C, C++, Java, Python, Matlab, SQL, JavaScript y PHP.",
  "portfolio-title": "Portafolio",
  "portfolio-description": "Una colección de mis proyectos de IA y aprendizaje automático, desde la investigación académica hasta los sistemas de producción que atienden a millones de usuarios en todo el mundo.",
  "t4sa-desc": "Sistema de análisis de sentimientos visuales intermodal mediante la destilación de conocimientos de modelos de texto a visión. Publicado en ECAI 2023, logrando resultados de vanguardia en la predicción del sentimiento visual.",
  "numpygpt-desc": "Un GPT desde cero construido con NumPy y la biblioteca estándar de Python. Sin autograd, sin marcos: cada capa se vuelve a implementar con su propio paso hacia adelante y hacia atrás. Los gradientes se calculan manualmente, las actualizaciones son transparentes y cada operación se explica.",
  "fake-news-desc": "Sistema de IA multimodal para la detección de información errónea mediante arquitecturas de transformadores. Incluye análisis de postura y puntuación de credibilidad de la fuente.",
  "unimusic-desc": "Plataforma de descubrimiento de música escalable con arquitectura híbrida MongoDB/Neo4j. Gestiona millones de pistas con algoritmos de recomendación en tiempo real.",
  "voice-vibes-desc": "Sistema de reconocimiento de emociones en el habla con seis arquitecturas de IA novedosas. Se logró una precisión del 94 % utilizando métodos de conjunto e ingeniería de características avanzadas.",
  "federated-dbscan-desc": "Agrupamiento distribuido que preserva la privacidad con aprendizaje federado. Permite el aprendizaje automático colaborativo sin compartir datos, logrando una preservación de la privacidad del 99 %.",
  "pagerank-desc": "Implementación de algoritmos de PageRank de alto rendimiento con operaciones de matriz dispersa optimizadas. Gestiona gráficos con millones de nodos de manera eficiente.",
  "contact-title": "Contacto",
  "contact-description": "¡Conectémonos! Si quieres hablar de IA, aprendizaje automático o posibles colaboraciones, siempre estoy abierto a conversaciones interesantes.",
  "location-label": "Ubicación:",
  "location": "Roma, Italia",
  "form-name": "Tu nombre",
  "form-email": "Tu correo electrónico",
  "form-subject": "Asunto",
  "form-message": "Mensaje",
  "form-loading": "Cargando",
  "form-success": "Tu mensaje se ha enviado. ¡Gracias!",
  "form-send": "Enviar mensaje",
  "tech-pytorch": "Aprendizaje profundo",
  "tech-python": "Lenguaje principal",
  "tech-slurm": "Programación de trabajos HPC",
  "tech-vllm": "Servicio LLM de alto rendimiento",
  "tech-transformers": "LLM y NLP",
  "tech-mongodb": "Almacenamiento de datos",
  "tech-docker": "Contenedorización",
  "tech-git": "Control de versiones",
  "tag-data": "Datos"
}