{
  "nav-home": "Inicio",
  "nav-about": "Acerca de",
  "nav-tech": "Tecnologías",
  "nav-resume": "CV",
  "nav-portfolio": "Portafolio",
  "nav-contact": "Contacto",
  "language-label": "Idioma",
  
  "hero-subtitle": "Haciendo que la IA hable tu idioma, un modelo a la vez",
  "hero-typed": ["un Investigador de IA", "un Ingeniero", "un Constructor"],
  
  "about-title": "Acerca de mí en O(1)",
  "about-description": "Soy un investigador e ingeniero de IA enfocado en modelos de lenguaje multilingües, haciendo que los LLM hablen tu idioma.",
  "about-role": "Ingeniero e Investigador de IA",
  "about-intro": "En Translated, ayudé a construir Lara desde cero, un LLM de traducción automática que potencia el contenido para Airbnb, Uber, Shopify y otros, alcanzando más de 200 millones de usuarios.",
  "birth-place-label": "Lugar de Nacimiento:",
  "birth-place": "Nápoles, Italia",
  "email-label": "Email:",
  "city-label": "Ciudad:",
  "city": "Roma, Italia",
  "masters-label": "Maestría:",
  "masters-degree": "IA e Ingeniería de Datos",
  "bachelors-label": "Licenciatura:",
  "bachelors-degree": "Ingeniería Informática",
  "university-label": "Universidad:",
  "university": "Universidad de Pisa",
  "languages-label": "Idiomas:",
  "languages": "Italiano, Inglés",
  "focus-label": "Enfoque:",
  "focus": "LLM Multilingües",
  "about-conclusion": "He escalado entrenamiento a más de 1,000 GPUs y expandido la cobertura MT a 201 idiomas. Trabajando noches y fines de semana, co-fundé una startup de IA construyendo una plataforma de geolocalización de imágenes. Soy un aprendiz voraz que constantemente se esfuerza por mejorar cómo pienso, entreno y construyo. No puedo imaginar una vida sin alguna forma de entrenamiento, ya sean GPUs, pesas en el gimnasio o preparación para maratones.",
  
  "tech-title": "Tecnologías y Herramientas 🛠️",
  
  "focus-title": "Enfoque Actual 🎯",
  "focus-description": "En qué estoy trabajando e investigando ahora mismo",
  "focus-scaling-title": "Escalando MT a 201 Idiomas",
  "focus-scaling-desc": "Expandiendo la cobertura de traducción automática mientras mantengo la calidad. Trabajando con datasets multilingües masivos y optimizando para idiomas de pocos recursos usando técnicas avanzadas de transfer learning.",
  "focus-production-title": "IA Multilingüe en Producción",
  "focus-production-desc": "Construyendo sistemas de traducción robustos que manejan la complejidad del mundo real a escala. Abordando desafíos como code-switching, adaptación de dominio y mantenimiento de calidad en más de 200 millones de usuarios diarios.",
  "tag-realtime": "Servicio en Tiempo Real",
  "tag-quality": "Aseguramiento de Calidad",
  
  "resume-title": "Currículum",
  "resume-description": "Ingeniero e Investigador de IA con amplia experiencia en construcción y escalado de sistemas de traducción automática multilingües. Historial comprobado sirviendo 200+ millones de usuarios a través de soluciones LLM innovadoras.",
  "education-title": "Educación",
  "masters-full": "Maestría en Inteligencia Artificial e Ingeniería de Datos",
  "university-location": "Universidad de Pisa, Pisa, Italia",
  "masters-description": "110/110 summa cum laude (4.0 GPA). Especializado en Minería de Datos, Machine Learning, Visión por Computadora, Procesamiento de Lenguaje Natural, Teoría de Optimización y Process Mining. Experiencia práctica con Sistemas Distribuidos, Cloud Computing y herramientas como MongoDB, Neo4j, Docker, Kubernetes, TensorFlow y PyTorch.",
  "bachelors-full": "Licenciatura en Ingeniería Informática",
  "bachelors-description": "110/110 (4.0 GPA). Base sólida en ingeniería informática incluyendo matemáticas, física, algoritmos, bases de datos, arquitectura de computadores, redes informáticas, sistemas operativos y programación en C, C++, Java, Python, Matlab, SQL, JavaScript y PHP.",
  "experience-title": "Experiencia Profesional",
  "current-role": "Ingeniero e Investigador de IA",
  "current-company": "Translated, Roma, Italia",
  "lara-desc": "<strong>Lara:</strong> Trabajé en todo el pipeline de I+D de un LLM optimizado para MT: desde recolección de datos y entrenamiento del modelo hasta alineación y optimización de inferencia. Construido desde cero dentro de un equipo estilo startup de cuatro personas operando dentro de la empresa. Ahora es el producto B2B insignia, traduce todo el contenido mundial para Airbnb y la mayoría de Uber, Shopify, Nike y más, alcanzando más de 200M usuarios globalmente. También se lanzó recientemente una versión B2C.",
  "lara-grande-desc": "<strong>Lara Grande:</strong> Papel clave en escalar LLM para igualar la calidad del 1% superior de traductores profesionales. Utilicé más de 1,000 GPUs en el cluster HPC de CINECA para entrenamiento distribuido a gran escala.",
  "language-expansion-desc": "<strong>Expansión de Idiomas:</strong> Identifiqué y lideré un proyecto de investigación exitoso para expandir la cobertura de traducción automática en producción de 56 a 201 idiomas, un aumento de 4×, convirtiéndolo en el primer motor MT comercial en soportar tal rango. Propuse la dirección, diseñé el plan de implementación y lo llevé a completar en ocho meses.",
  "instruction-mt-desc": "<strong>MT que sigue instrucciones:</strong> Lideré investigación alineando LLM para seguir guías de estilo detalladas usando SFT y DPO.",
  "trust-attention-desc": "<strong>Trust Attention:</strong> Propuse y validé una técnica novedosa priorizando datos de entrenamiento de alto valor, logrando las mejoras de calidad MT más significativas en cinco años.",
  "polyglot-desc": "<strong>Polyglot:</strong> Desarrollé un modelo de Identificación de Idiomas que soporta 201 idiomas.",
  "startup-role": "Co-Fundador e Ingeniero de IA",
  "italy": "Italia",
  "startup-desc1": "Co-fundé startup de IA como parte del equipo fundador de tres personas construyendo plataforma de geolocalización de imágenes",
  "startup-desc2": "Desarrollé el modelo central para geolocalización de imágenes usando vision transformers y técnicas basadas en retrieval",
  "startup-desc3": "Obtuve experiencia valiosa en ambiente startup de ritmo rápido y desarrollo de productos",
  "startup-desc4": "Aprendí lecciones cruciales sobre dinámicas de equipo, gestión de incertidumbre e iteración rápida",
  "try-here": "Pruébalo aquí",
  
  "portfolio-title": "Portafolio 🚀",
  "portfolio-description": "Una colección de mis proyectos de IA y machine learning, desde investigación académica hasta sistemas de producción sirviendo millones de usuarios mundialmente.",
  "t4sa-desc": "Sistema de análisis de sentimiento visual cross-modal usando destilación de conocimiento de modelos de texto a visión. Publicado en ECAI 2023, logrando resultados estado del arte en predicción de sentimiento visual.",
  "numpygpt-desc": "Un GPT construido desde cero con NumPy y la librería estándar de Python. Sin autograd, sin frameworks: cada capa se re-implementa con su propio pase hacia adelante y hacia atrás. Los gradientes se calculan manualmente, las actualizaciones son transparentes, y cada operación se especifica.",
  "fake-news-desc": "Sistema de IA multi-modal para detección de desinformación usando arquitecturas transformer. Incluye análisis de stance y puntuación de credibilidad de fuentes.",
  "unimusic-desc": "Plataforma escalable de descubrimiento musical con arquitectura híbrida MongoDB/Neo4j. Maneja millones de pistas con algoritmos de recomendación en tiempo real.",
  "voice-vibes-desc": "Sistema de reconocimiento de emociones de voz con seis arquitecturas de IA novedosas. Logró 94% de precisión usando métodos ensemble e ingeniería de características avanzada.",
  "federated-dbscan-desc": "Clustering distribuido preservando privacidad con federated learning. Habilita ML colaborativo sin compartir datos, logrando 99% de preservación de privacidad.",
  "pagerank-desc": "Implementación de alto rendimiento del algoritmo PageRank con operaciones optimizadas de matrices dispersas. Maneja grafos con millones de nodos eficientemente.",
  
  "cta-title": "Construyamos Juntos el Futuro de la IA",
  "cta-description": "Ya sea que busques colaborar en investigación de vanguardia, discutir lo último en LLM multilingües, o explorar cómo la IA puede transformar tu negocio, siempre estoy emocionado de conectar con compañeros innovadores y solucionadores de problemas.",
  "cta-button1": "Iniciar una Conversación",
  "cta-button2": "Enviar Email Directo",
  
  "contact-title": "Contacto",
  "contact-description": "¡Conectemos! Ya sea que quieras discutir IA, machine learning, o colaboraciones potenciales, siempre estoy abierto a conversaciones interesantes.",
  "location-label": "Ubicación",
  "location": "Roma, Italia",
  "form-name": "Tu Nombre",
  "form-email": "Tu Email",
  "form-subject": "Asunto",
  "form-message": "Mensaje",
  "form-loading": "Cargando",
  "form-success": "Tu mensaje ha sido enviado. ¡Gracias!",
  "form-send": "Enviar Mensaje"
} 