{
  "nav-home": "Etusivu",
  "nav-about": "Tietoa",
  "nav-tech": "Teknologiapino",
  "nav-resume": "Ansioluettelo",
  "nav-portfolio": "Portfolio",
  "nav-contact": "Ota yhteyttä",
  "language-label": "Kieli",
  "language-selector-header": "Valitse kieli ({count} saatavilla)",
  "hero-subtitle": "Tekoälyn saaminen puhumaan kieltäsi, yksi malli kerrallaan",
  "multilingual-typed": [
    "I train LLMs to speak your language.",
    "我训练大型语言模型来讲你的语言。",
    "Entreno LLMs para hablar tu idioma.",
    "Ich trainiere LLMs, damit sie deine Sprache sprechen.",
    "J'entraîne des LLM pour qu'ils parlent votre langue.",
    "あなたの言語を话せるように、LLMを訓練しています。",
    "Treino LLMs para falar o seu idioma.",
    "أقوم بتدريب LLM لتتحدث لغتك.",
    "Alleno LLM per parlare la tua lingua.",
    "Я обучаю LLM говорить на вашем языке."
  ],
  "about-title": "Tietoa minusta O(1):ssä",
  "about-description": "Olen tekoälytutkija ja -insinööri, joka keskittyy monikielisiin suuriin kielimalleihin.",
  "about-role": "Tekoälyinsinööri ja -tutkija",
  "about-intro": "Translatedilla olen auttanut rakentamaan ensimmäisestä päivästä lähtien Laraa, koneellisen käännöksen LLM:ää, joka tuottaa sisältöä reaaliajassa Airbnb:lle, Uberille, Shopifylle ja muille yli 200 miljoonalle käyttäjälle.",
  "birth-place-label": "Syntymäpaikka:",
  "birth-place": "Napoli, Italia",
  "email-label": "Sähköposti:",
  "city-label": "Kaupunki:",
  "city": "Rooma, Italia",
  "masters-label": "Maisterin tutkinto:",
  "masters-degree": "Tekoäly ja datainsinöörit",
  "bachelors-label": "Alempi korkeakoulututkinto:",
  "bachelors-degree": "Tietokoneinsinööri",
  "university-label": "Yliopisto:",
  "university": "Pisan yliopisto",
  "languages-label": "Kielet:",
  "languages": "Italia, englanti",
  "focus-label": "Painopiste:",
  "focus": "Monikieliset suuret kielimallit",
  "about-conclusion": "Olen skaalannut koulutuksen yli 1 000 GPU:lle ja laajentanut konekäännöksen kattavuuden 201 kielelle. Olen yksi perustajista <a href=\"https://picarta.ai/\" target=\"_blank\" style=\"color: var(--accent-primary); text-decoration: none; font-weight: 600;\">Picarta.ai</a>, tekoälystartupissa, joka rakentaa alustaa kuvien geolokalisointiin. Olen ahne oppija, joka pyrkii jatkuvasti parantamaan ajattelutapaansa, koulutustaan ja rakentamistaan. En voi kuvitella elämää ilman jonkinlaista koulutusta, olipa kyse sitten GPU:ista, kuntosalin painoista tai maratonin valmistautumisesta.",
  "tech-title": "Teknologiat ja työkalut",
  "tech-pytorch": "Syväoppiminen",
  "tech-python": "Pääasiallinen kieli",
  "tech-slurm": "HPC-työaikataulutus",
  "tech-vllm": "Suorituskykyinen LLM-palvelu",
  "tech-transformers": "LLM:t ja NLP",
  "tech-mongodb": "Tietojen tallennus",
  "tech-docker": "Konttikuljetus",
  "tech-git": "Versionhallinta",
  "focus-title": "Nykyinen painopiste",
  "focus-description": "Mitä rakennan ja tutkin juuri nyt",
  "focus-scaling-title": "Konekäännöksen skaalaus 201 kielelle",
  "focus-scaling-desc": "Konekäännösten kattavuuden laajentaminen laadun säilyttämisen ohella. Työskentelemme massiivisten monikielisten tietojoukkojen parissa ja optimoimme vähäresurssisia kieliä edistyneillä siirtämisoppimistekniikoilla.",
  "focus-production-title": "Monikielinen tekoäly tuotannossa",
  "focus-production-desc": "Rakennamme kestäviä käännösjärjestelmiä, jotka käsittelevät todellisen maailman monimutkaisuutta laajassa mittakaavassa. Käsittelemme haasteita, kuten kielen vaihtoa, alan mukauttamista, häiritsevää käyttäjien luomaa sisältöä ja laadun ylläpitoa yli 200 miljoonan päivittäisen käyttäjän keskuudessa.",
  "tag-realtime": "Reaaliaikainen palvelu",
  "tag-quality": "Laadunvarmistus",
  "tag-data": "Data",
  "resume-title": "Ansioluettelo",
  "resume-description": "Tekoälyinsinööri ja -tutkija, jolla on laaja kokemus monikielisten konekäännösjärjestelmien rakentamisesta ja skaalaamisesta. Todistettu kokemus yli 200 miljoonan käyttäjän palvelemisesta innovatiivisten LLM-ratkaisujen avulla.",
  "experience-title": "Työkokemus",
  "current-role": "Tekoälyinsinööri ja -tutkija",
  "current-company": "Translated, Rooma, Italia",
  "lara-desc": "<strong>Lara:</strong> Työskenteli koneelliseen käännökseen optimoidun suuren kielimallin koko tutkimus- ja kehityspipelineen parissa: aina tiedonkeruusta ja mallin koulutuksesta kohdistuksen ja päätelmien optimointiin. Rakennettu tyhjästä startup-tyyppisessä neljän hengen tiimissä, joka toimii yrityksen sisällä. Nyt lippulaivana toimiva B2B-tuote kääntää kaiken sisällön maailmanlaajuisesti Airbnb:lle ja suurimmalle osalle Uberin, Shopifyn, Niken ja muiden sisällöstä ja saavuttaa yli 200 miljoonaa käyttäjää maailmanlaajuisesti. Myös B2C-versio on julkaistu äskettäin.",
  "try-here": "Kokeile sitä täällä",
  "lara-grande-desc": "<strong>Lara Grande:</strong> Avainasema LLM:n skaalaamisessa vastaamaan ammattikääntäjien ylimmän 1 %:n laatua. Käytettiin yli 1 000 GPU:ta CINECA:n HPC-klusterissa laajamittaiseen hajautettuun koulutukseen.",
  "language-expansion-desc": "<strong>Kielivalikoiman laajentaminen:</strong> Tunnisti ja johti onnistunutta tutkimusprojektia, joka laajensi konekäännösten tuotannon kattavuuden 56 kielestä 201 kieleen, mikä on nelinkertainen kasvu. Se on ensimmäinen kaupallinen konekäännöskone, joka tukee näin laajaa valikoimaa. Ehdotin suuntaa, suunnittelin toteutussuunnitelman ja johdin sen loppuun kahdeksassa kuukaudessa.",
  "instruction-mt-desc": "<strong>Ohjeita seuraava konekäännös:</strong> Johtanut tutkimusta, jossa LLM linjataan noudattamaan yksityiskohtaisia tyylioppaita SFT:n ja DPO:n avulla.",
  "trust-attention-desc": "<strong>Luottamuksen huomio:</strong> Ehdotin ja validoin uuden tekniikan, joka priorisoi arvokkaita koulutustietoja, ja saavutin merkittävimmät konekäännöksen laadun parannukset viiteen vuoteen.",
  "polyglot-desc": "<strong>Polyglot:</strong> Kehitti kielitunnistusmallin, joka tukee 201 kieltä.",
  "startup-title": "Startup-kokemus",
  "startup-role": "Perustajakumppani ja tekoälyinsinööri",
  "italy": "Italia",
  "startup-desc1": "Perusti yhdessä kolmen hengen perustajaryhmän kanssa tekoälystartupin, joka kehitti maantieteellisen sijainnin määrittämiseen perustuvan alustan.",
  "startup-desc2": "Kehitti ydinmallin kuvien geolokalisointiin käyttämällä visuaalisia muuntajia ja hakuun perustuvia tekniikoita.",
  "startup-desc3": "Sain arvokasta kokemusta nopeatempoisessa startup-ympäristössä ja tuotekehityksessä",
  "startup-desc4": "Opimme tärkeitä asioita tiimien dynamiikasta, epävarmuuden hallinnasta ja nopeasta iteraatiosta.",
  "education-title": "Koulutus",
  "masters-full": "Maisterin tutkinto tekoäly- ja datainsinöörinä",
  "university-location": "Pisan yliopisto, Pisa, Italia",
  "masters-description": "110/110 summa cum laude (4,0 GPA). Erikoistunut tietojen louhintaan, koneoppimiseen, tietokonevisioon, luonnollisen kielen käsittelyyn, optimointiteoriaan ja prosessien louhintaan. Käytännön kokemusta hajautetuista järjestelmistä, pilvilaskennasta ja työkaluista, kuten MongoDB, Neo4j, Docker, Kubernetes, TensorFlow ja PyTorch.",
  "bachelors-full": "Tietokoneinsinööri",
  "bachelors-description": "110/110 (4.0 GPA). Vahva tietotekniikan perusta, mukaan lukien matematiikka, fysiikka, algoritmit, tietokannat, tietokonearkkitehtuuri, tietokoneverkot, käyttöjärjestelmät ja ohjelmointi seuraavilla kielillä: C, C++, Java, Python, Matlab, SQL, JavaScript ja PHP.",
  "portfolio-title": "Portfolio",
  "portfolio-description": "Kokoelma tekoäly- ja koneoppimisprojekteistani, jotka vaihtelevat akateemisesta tutkimuksesta miljoonia käyttäjiä ympäri maailmaa palveleviin tuotantojärjestelmiin.",
  "t4sa-desc": "Kuvamallien välinen visuaalinen tunneanalyysijärjestelmä, jossa käytetään tiedon tislaus tekstistä visiomalleihin. Julkaistu ECAI 2023:ssa, saavuttaen huippuluokan tulokset visuaalisen tunteen ennustamisessa.",
  "numpygpt-desc": "NumPyn ja Pythonin vakiokirjaston avulla rakennettu GPT tyhjästä. Ei autogradia, ei kehikkoja: jokainen kerros toteutetaan uudelleen omalla eteen- ja taaksepäin suuntautuvalla läpäisyllään. Gradientit lasketaan manuaalisesti, päivitykset ovat läpinäkyviä ja jokainen toiminto on yksityiskohtaisesti selitetty.",
  "fake-news-desc": "Monimuotoinen tekoälyjärjestelmä harhaanjohtavan tiedon havaitsemiseen muuntaja-arkkitehtuurien avulla. Sisältää asenteen analyysin ja lähteen luotettavuuspisteytys.",
  "unimusic-desc": "Skaalautuva musiikin löytöalusta, jossa on hybridi MongoDB/Neo4j -arkkitehtuuri. Käsittelee miljoonia kappaleita reaaliaikaisilla suositusalgoritmeilla.",
  "voice-vibes-desc": "Puheemotion tunnistusjärjestelmä, jossa on kuusi uutta tekoälyarkkitehtuuria. Saavutti 94 %:n tarkkuuden käyttämällä ensemblemetodeja ja edistynyttä ominaisuussuunnittelua.",
  "federated-dbscan-desc": "Yksityisyyttä suojaava hajautettu klusterointi yhdistetyn oppimisen avulla. Mahdollistaa yhteistyöhön perustuvan ML:n ilman tietojen jakamista, jolloin tietosuoja säilyy 99-prosenttisesti.",
  "pagerank-desc": "Korkean suorituskyvyn PageRank-algoritmin toteutus optimoiduilla harvamatriisitoiminnoilla. Käsittelee tehokkaasti kaavioita, joissa on miljoonia solmuja.",
  "contact-title": "Ota yhteyttä",
  "contact-description": "Ota yhteyttä! Halusitpa keskustella tekoälystä, koneoppimisesta tai mahdollisista yhteistyöprojekteista, olen aina avoin mielenkiintoisille keskusteluille.",
  "location-label": "Sijainti:",
  "location": "Rooma, Italia",
  "form-name": "Nimesi",
  "form-email": "Sähköpostiosoitteesi",
  "form-subject": "Aihe",
  "form-message": "Viesti",
  "form-loading": "Ladataan",
  "form-success": "Viestisi on lähetetty. Kiitos!",
  "form-send": "Lähetä viesti"
}