{
  "nav-home": "Accueil",
  "nav-about": "À propos",
  "nav-tech": "Technologies",
  "nav-resume": "CV",
  "nav-portfolio": "Portfolio",
  "nav-contact": "Contact",
  "language-label": "Langue",
  
  "hero-subtitle": "Faire parler l'IA votre langue, un modèle à la fois",
  "hero-typed": ["un Chercheur en IA", "un Ingénieur", "un Constructeur"],
  
  "about-title": "À propos de moi en O(1)",
  "about-description": "Je suis un chercheur et ingénieur en IA spécialisé dans les modèles de langage multilingues, faisant parler votre langue aux LLM.",
  "about-role": "Ingénieur et Chercheur en IA",
  "about-intro": "Chez Translated, j'ai aidé à construire Lara depuis zéro, un LLM de traduction automatique qui alimente le contenu pour Airbnb, Uber, Shopify et d'autres, atteignant plus de 200 millions d'utilisateurs.",
  "birth-place-label": "Lieu de Naissance:",
  "birth-place": "Naples, Italie",
  "email-label": "Email:",
  "city-label": "Ville:",
  "city": "Rome, Italie",
  "masters-label": "Master:",
  "masters-degree": "IA et Ingénierie des Données",
  "bachelors-label": "Licence:",
  "bachelors-degree": "Ingénierie Informatique",
  "university-label": "Université:",
  "university": "Université de Pise",
  "languages-label": "Langues:",
  "languages": "Italien, Anglais",
  "focus-label": "Focus:",
  "focus": "LLM Multilingues",
  "about-conclusion": "J'ai étendu l'entraînement à plus de 1 000 GPU et élargi la couverture MT à 201 langues. Travaillant les soirs et week-ends, j'ai co-fondé une startup IA construisant une plateforme de géolocalisation d'images. Je suis un apprenant vorace qui pousse constamment pour améliorer ma façon de penser, d'entraîner et de construire. Je ne peux pas imaginer une vie sans une forme d'entraînement, qu'il s'agisse de GPU, de poids en salle de sport ou de préparation de marathon.",
  
  "tech-title": "Technologies et Outils 🛠️",
  
  "focus-title": "Focus Actuel 🎯",
  "focus-description": "Ce sur quoi je travaille et recherche en ce moment",
  "focus-scaling-title": "Mise à l'échelle MT vers 201 Langues",
  "focus-scaling-desc": "Élargir la couverture de traduction automatique tout en maintenant la qualité. Travailler avec des ensembles de données multilingues massifs et optimiser pour les langues à faibles ressources en utilisant des techniques avancées de transfer learning.",
  "focus-production-title": "IA Multilingue en Production",
  "focus-production-desc": "Construire des systèmes de traduction robustes qui gèrent la complexité du monde réel à grande échelle. Relever les défis comme le code-switching, l'adaptation de domaine et maintenir la qualité pour plus de 200 millions d'utilisateurs quotidiens.",
  "tag-realtime": "Service Temps Réel",
  "tag-quality": "Assurance Qualité",
  
  "resume-title": "CV",
  "resume-description": "Ingénieur et Chercheur en IA avec une vaste expérience dans la construction et la mise à l'échelle de systèmes de traduction automatique multilingues. Historique prouvé servant 200+ millions d'utilisateurs grâce à des solutions LLM innovantes.",
  "education-title": "Formation",
  "masters-full": "Master en Intelligence Artificielle et Ingénierie des Données",
  "university-location": "Université de Pise, Pise, Italie",
  "masters-description": "110/110 summa cum laude (4.0 GPA). Spécialisé en Data Mining, Machine Learning, Vision par Ordinateur, Traitement du Langage Naturel, Théorie de l'Optimisation et Process Mining. Expérience pratique avec les Systèmes Distribués, Cloud Computing et des outils comme MongoDB, Neo4j, Docker, Kubernetes, TensorFlow et PyTorch.",
  "bachelors-full": "Licence en Ingénierie Informatique",
  "bachelors-description": "110/110 (4.0 GPA). Base solide en ingénierie informatique incluant mathématiques, physique, algorithmes, bases de données, architecture informatique, réseaux informatiques, systèmes d'exploitation et programmation en C, C++, Java, Python, Matlab, SQL, JavaScript et PHP.",
  "experience-title": "Expérience Professionnelle",
  "current-role": "Ingénieur et Chercheur en IA",
  "current-company": "Translated, Rome, Italie",
  "lara-desc": "<strong>Lara:</strong> J'ai travaillé sur tout le pipeline R&D d'un LLM optimisé pour MT : de la collecte de données et l'entraînement du modèle à l'alignement et l'optimisation d'inférence. Construit depuis zéro au sein d'une équipe style startup de quatre personnes opérant dans l'entreprise. Maintenant le produit B2B phare, il traduit tout le contenu mondial pour Airbnb et la plupart d'Uber, Shopify, Nike et plus, atteignant plus de 200M d'utilisateurs globalement. Une version B2C a également été récemment lancée.",
  "lara-grande-desc": "<strong>Lara Grande:</strong> Rôle clé dans la mise à l'échelle LLM pour égaler la qualité du top 1% des traducteurs professionnels. Utilisé plus de 1 000 GPU sur le cluster HPC de CINECA pour l'entraînement distribué à grande échelle.",
  "language-expansion-desc": "<strong>Expansion Linguistique:</strong> Identifié et dirigé un projet de recherche réussi pour étendre la couverture de traduction automatique en production de 56 à 201 langues, une augmentation de 4×, en faisant le premier moteur MT commercial à supporter une telle gamme. Proposé la direction, conçu le plan d'implémentation et mené à achèvement en huit mois.",
  "instruction-mt-desc": "<strong>MT suivant les instructions:</strong> Dirigé la recherche alignant LLM pour suivre des guides de style détaillés en utilisant SFT et DPO.",
  "trust-attention-desc": "<strong>Trust Attention:</strong> Proposé et validé une technique novatrice priorisant les données d'entraînement de haute valeur, obtenant les améliorations de qualité MT les plus significatives en cinq ans.",
  "polyglot-desc": "<strong>Polyglot:</strong> Développé un modèle d'Identification de Langue supportant 201 langues.",
  "startup-role": "Co-Fondateur et Ingénieur IA",
  "italy": "Italie",
  "startup-desc1": "Co-fondé startup IA en tant que membre de l'équipe fondatrice de trois personnes construisant une plateforme de géolocalisation d'images",
  "startup-desc2": "Développé le modèle central pour la géolocalisation d'images en utilisant des vision transformers et des techniques basées sur la récupération",
  "startup-desc3": "Acquis une expérience précieuse dans un environnement startup à rythme rapide et le développement de produits",
  "startup-desc4": "Appris des leçons cruciales sur la dynamique d'équipe, la gestion de l'incertitude et l'itération rapide",
  "try-here": "Essayez ici",
  
  "portfolio-title": "Portfolio 🚀",
  "portfolio-description": "Une collection de mes projets IA et machine learning, de la recherche académique aux systèmes de production servant des millions d'utilisateurs dans le monde.",
  "t4sa-desc": "Système d'analyse de sentiment visuel cross-modal utilisant la distillation de connaissances des modèles de texte vers vision. Publié à ECAI 2023, atteignant des résultats state-of-the-art en prédiction de sentiment visuel.",
  "numpygpt-desc": "Un GPT construit depuis zéro avec NumPy et la bibliothèque standard Python. Pas d'autograd, pas de frameworks : chaque couche est ré-implémentée avec son propre passage avant et arrière. Les gradients sont calculés manuellement, les mises à jour sont transparentes, et chaque opération est spécifiée.",
  "fake-news-desc": "Système IA multi-modal pour la détection de désinformation utilisant des architectures transformer. Comprend l'analyse de stance et le scoring de crédibilité des sources.",
  "unimusic-desc": "Plateforme de découverte musicale évolutive avec architecture hybride MongoDB/Neo4j. Gère des millions de pistes avec des algorithmes de recommandation en temps réel.",
  "voice-vibes-desc": "Système de reconnaissance d'émotion vocale avec six architectures IA novatrices. Atteint 94% de précision utilisant des méthodes d'ensemble et ingénierie de caractéristiques avancée.",
  "federated-dbscan-desc": "Clustering distribué préservant la confidentialité avec federated learning. Permet ML collaboratif sans partage de données, atteignant 99% de préservation de confidentialité.",
  "pagerank-desc": "Implémentation haute performance de l'algorithme PageRank avec opérations optimisées de matrices creuses. Gère des graphes avec des millions de nœuds efficacement.",
  
  "cta-title": "Construisons Ensemble l'Avenir de l'IA",
  "cta-description": "Que vous cherchiez à collaborer sur de la recherche de pointe, discuter des derniers développements en LLM multilingues, ou explorer comment l'IA peut transformer votre entreprise, je suis toujours excité de me connecter avec des innovateurs et résolveurs de problèmes.",
  "cta-button1": "Commencer une Conversation",
  "cta-button2": "Envoyer Email Direct",
  
  "contact-title": "Contact",
  "contact-description": "Connectons-nous ! Que vous vouliez discuter d'IA, machine learning, ou de collaborations potentielles, je suis toujours ouvert aux conversations intéressantes.",
  "location-label": "Emplacement",
  "location": "Rome, Italie",
  "form-name": "Votre Nom",
  "form-email": "Votre Email",
  "form-subject": "Sujet",
  "form-message": "Message",
  "form-loading": "Chargement",
  "form-success": "Votre message a été envoyé. Merci !",
  "form-send": "Envoyer Message"
} 