{
  "nav-home": "Accueil",
  "nav-about": "À propos",
  "nav-tech": "Pile technologique",
  "nav-resume": "Reprendre",
  "nav-portfolio": "Portfolio",
  "nav-contact": "Contact",
  "language-label": "Langue",
  "language-selector-header": "Sélectionner la langue ({count} disponibles)",
  "hero-subtitle": "Faire en sorte que l'IA parle votre langue, un modèle à la fois",
  "multilingual-typed": [
    "I train LLMs to speak your language.",
    "我训练大型语言模型来讲你的语言。",
    "Entreno LLMs para hablar tu idioma.",
    "Ich trainiere LLMs, damit sie deine Sprache sprechen.",
    "J'entraîne des LLM pour qu'ils parlent votre langue.",
    "あなたの言語を话せるように、LLMを訓練しています。",
    "Treino LLMs para falar o seu idioma.",
    "أقوم بتدريب LLM لتتحدث لغتك.",
    "Alleno LLM per parlare la tua lingua.",
    "Я обучаю LLM говорить на вашем языке."
  ],
  "about-title": "À propos de moi dans O(1)",
  "about-description": "Je suis chercheur et ingénieur en IA, spécialisé dans les grands modèles de langage multilingues.",
  "about-role": "Ingénieur et chercheur en IA",
  "about-intro": "Chez Translated, j'ai contribué à la création de Lara, un LLM de traduction automatique qui alimente le contenu d'Airbnb, d'Uber, de Shopify et d'autres, atteignant plus de 200 millions d'utilisateurs.",
  "birth-place-label": "Lieu de naissance :",
  "birth-place": "Naples, Italie",
  "email-label": "E-mail :",
  "city-label": "Ville :",
  "city": "Rome, Italie",
  "masters-label": "Diplôme de maîtrise :",
  "masters-degree": "IA et ingénierie des données",
  "bachelors-label": "Licence :",
  "bachelors-degree": "Ingénierie informatique",
  "university-label": "Université :",
  "university": "Université de Pise",
  "languages-label": "Langues :",
  "languages": "Italien, anglais",
  "focus-label": "Objectif :",
  "focus": "LLM multilingues",
  "about-conclusion": "J'ai étendu la formation à plus de 1 000 GPU et élargi la couverture de la traduction automatique à 201 langues. J'ai cofondé <a href=\"https://picarta.ai/\" target=\"_blank\" style=\"color: var(--accent-primary); text-decoration: none; font-weight: 600;\">Picarta.ai</a>, une start-up d'IA qui construit une plateforme de géolocalisation d'images. Je suis un apprenant vorace qui cherche constamment à améliorer sa façon de penser, de s'entraîner et de construire. Je ne peux pas imaginer une vie sans une forme de formation, que ce soit des GPU, des plaques de gym ou une préparation de marathon.",
  "tech-title": "Technologies et outils",
  "focus-title": "Objectif actuel",
  "focus-description": "Ce que je construis et recherche en ce moment",
  "focus-scaling-title": "Mise à l'échelle de la traduction automatique vers 201 langues",
  "focus-scaling-desc": "Élargir la couverture de la traduction automatique tout en maintenant la qualité. Travailler avec des ensembles de données multilingues massifs et optimiser pour les langues à faibles ressources à l'aide de techniques avancées d'apprentissage par transfert.",
  "focus-production-title": "IA multilingue en production",
  "focus-production-desc": "Construire des systèmes de traduction robustes qui gèrent la complexité du monde réel à grande échelle. Relever des défis tels que le code-switching, l'adaptation de domaine, le contenu bruyant généré par les utilisateurs et le maintien de la qualité pour plus de 200 millions d'utilisateurs quotidiens.",
  "tag-realtime": "Service en temps réel",
  "tag-quality": "Assurance qualité",
  "resume-title": "Reprendre",
  "resume-description": "Ingénieur et chercheur en IA avec une vaste expérience dans la création et la mise à l'échelle de systèmes de traduction automatique multilingues. Expérience avérée au service de plus de 200 millions d'utilisateurs grâce à des solutions LLM innovantes.",
  "experience-title": "Expérience professionnelle",
  "current-role": "Ingénieur et chercheur en IA",
  "current-company": "Translated, Rome, Italie",
  "lara-desc": "<strong>Lara :</strong> a travaillé sur l'ensemble du pipeline de R&D d'un LLM optimisé pour la traduction automatique : de la collecte de données et de l'entraînement des modèles à l'alignement et à l'optimisation de l'inférence. Construit à partir de zéro au sein d'une équipe de quatre personnes de type startup opérant au sein de l'entreprise. Désormais produit phare B2B, il traduit tous les contenus dans le monde entier pour Airbnb et la plupart des contenus d'Uber, Shopify, Nike, etc., atteignant plus de 200 millions d'utilisateurs dans le monde. Une version B2C a également été lancée récemment.",
  "try-here": "Essayez-le ici",
  "lara-grande-desc": "<strong>Lara Grande :</strong> rôle clé dans la mise à l'échelle du LLM pour atteindre la qualité du top 1 % des traducteurs professionnels. Utilisation de plus de 1 000 GPU sur le cluster HPC de CINECA pour une formation distribuée à grande échelle.",
  "language-expansion-desc": "<strong>Expansion linguistique :</strong> Identification et direction d'un projet de recherche réussi visant à étendre la couverture de la production de traduction automatique de 56 à 201 langues, soit une multiplication par 4, ce qui en fait le premier moteur de traduction automatique commercial à prendre en charge une telle gamme. J'ai proposé la direction, conçu le plan de mise en œuvre et mené le projet à son terme en huit mois.",
  "instruction-mt-desc": "<strong>Traduction automatique suivant les instructions :</strong> a dirigé la recherche alignant LLM pour suivre les guides de style détaillés à l'aide de SFT et DPO.",
  "trust-attention-desc": "<strong>Attention de confiance :</strong> Proposition et validation d'une nouvelle technique donnant la priorité aux données d'entraînement de grande valeur, permettant d'obtenir les améliorations les plus significatives de la qualité de la traduction automatique en cinq ans.",
  "polyglot-desc": "<strong>Polyglot :</strong> Développement d'un modèle d'identification linguistique prenant en charge 201 langues.",
  "startup-title": "Expérience en start-up",
  "startup-role": "Co-fondateur et ingénieur en IA",
  "italy": "Italie",
  "startup-desc1": "Co-fondation d'une startup d'IA dans le cadre d'une équipe fondatrice de trois personnes pour la création d'une plateforme de géolocalisation d'images",
  "startup-desc2": "Développement du modèle de base pour la géolocalisation d'images à l'aide de transformateurs de vision et de techniques basées sur la récupération",
  "startup-desc3": "Acquisition d'une expérience précieuse dans un environnement de startup en évolution rapide et dans le développement de produits",
  "startup-desc4": "A appris des leçons cruciales sur la dynamique d'équipe, la gestion de l'incertitude et l'itération rapide",
  "education-title": "Éducation",
  "masters-full": "Master en intelligence artificielle et ingénierie des données",
  "university-location": "Université de Pise, Pise, Italie",
  "masters-description": "110/110 summa cum laude (4,0 GPA). Spécialisé dans l'exploration de données, l'apprentissage automatique, la vision par ordinateur, le traitement du langage naturel, la théorie de l'optimisation et l'exploration de processus. Acquisition d'une expérience pratique avec les systèmes distribués, le cloud computing et des outils tels que MongoDB, Neo4j, Docker, Kubernetes, TensorFlow et PyTorch.",
  "bachelors-full": "B.S. en génie informatique",
  "bachelors-description": "110/110 (4.0 GPA). Solide base en génie informatique, y compris les mathématiques, la physique, les algorithmes, les bases de données, l'architecture informatique, les réseaux informatiques, les systèmes d'exploitation et la programmation en C, C++, Java, Python, Matlab, SQL, JavaScript et PHP.",
  "portfolio-title": "Portfolio",
  "portfolio-description": "Une collection de mes projets d'IA et d'apprentissage automatique, de la recherche académique aux systèmes de production desservant des millions d'utilisateurs dans le monde.",
  "t4sa-desc": "Système d'analyse de sentiment visuel intermodal utilisant la distillation des connaissances des modèles de texte à la vision. Publié à l'ECAI 2023, obtenant des résultats de pointe sur la prédiction du sentiment visuel.",
  "numpygpt-desc": "Un GPT construit à partir de zéro avec NumPy et la bibliothèque standard de Python. Pas d'autograd, pas de frameworks : chaque couche est réimplémentée avec son propre passage avant et arrière. Les gradients sont calculés manuellement, les mises à jour sont transparentes et chaque opération est expliquée.",
  "fake-news-desc": "Système d'IA multimodal pour la détection de la désinformation à l'aide d'architectures de transformateurs. Comprend une analyse de la position et une évaluation de la crédibilité de la source.",
  "unimusic-desc": "Plateforme de découverte musicale évolutive avec architecture hybride MongoDB/Neo4j. Gère des millions de pistes avec des algorithmes de recommandation en temps réel.",
  "voice-vibes-desc": "Système de reconnaissance des émotions vocales avec six nouvelles architectures d'IA. Atteint une précision de 94 % en utilisant des méthodes d'ensemble et une ingénierie de fonctionnalités avancée.",
  "federated-dbscan-desc": "Clustering distribué préservant la confidentialité avec apprentissage fédéré. Permet un apprentissage automatique collaboratif sans partage de données, en préservant la confidentialité à 99 %.",
  "pagerank-desc": "Mise en œuvre de l'algorithme PageRank haute performance avec des opérations de matrice creuse optimisées. Gère efficacement des graphiques avec des millions de nœuds.",
  "contact-title": "Contact",
  "contact-description": "Connectons-nous ! Que vous souhaitiez discuter de l'IA, de l'apprentissage automatique ou de collaborations potentielles, je suis toujours ouvert à des conversations intéressantes.",
  "location-label": "Emplacement",
  "location": "Rome, Italie",
  "form-name": "Votre nom",
  "form-email": "Votre adresse e-mail",
  "form-subject": "Objet",
  "form-message": "Message",
  "form-loading": "Chargement",
  "form-success": "Votre message a été envoyé. Merci !",
  "form-send": "Envoyer un message"
}