{
  "nav-home": "דף הבית",
  "nav-about": "אודות",
  "nav-tech": "טכנולוגיות",
  "nav-resume": "קורות חיים",
  "nav-portfolio": "תיק עבודות",
  "nav-contact": "צור קשר",
  "language-label": "שפה",
  "language-selector-header": "בחירת שפה ({count} זמינות)",
  "hero-subtitle": "לגרום לבינה מלאכותית לדבר את השפה שלכם, מודל אחד בכל פעם",
  "multilingual-typed": [
    "I train LLMs to speak your language.",
    "我训练大型语言模型来讲你的语言。",
    "Entreno LLMs para hablar tu idioma.",
    "Ich trainiere LLMs, damit sie deine Sprache sprechen.",
    "J'entraîne des LLM pour qu'ils parlent votre langue.",
    "あなたの言語を话せるように、LLMを訓練しています。",
    "Treino LLMs para falar o seu idioma.",
    "أقوم بتدريب LLM لتتحدث لغتك.",
    "Alleno LLM per parlare la tua lingua.",
    "Я обучаю LLM говорить на вашем языке."
  ],
  "about-title": "אודותיי ב-O(1)",
  "about-description": "אני חוקר ומהנדס בינה מלאכותית המתמקד במודלים רב-לשוניים של שפה גדולה.",
  "about-role": "מהנדס ובוחן בינה מלאכותית",
  "about-intro": "ב-Translated, עזרתי לבנות את Lara מהיום הראשון, LLM לתרגום מכונה שמפעיל תוכן בזמן אמת עבור Airbnb, Uber, Shopify ואחרים, ומגיע ליותר מ-200 מיליון משתמשים.",
  "birth-place-label": "מקום לידה:",
  "birth-place": "נאפולי, איטליה",
  "email-label": "דוא\"ל:",
  "city-label": "עיר:",
  "city": "רומא, איטליה",
  "masters-label": "תואר שני:",
  "masters-degree": "בינה מלאכותית והנדסת נתונים",
  "bachelors-label": "תואר ראשון במדעים:",
  "bachelors-degree": "הנדסת מחשבים",
  "university-label": "אוניברסיטה:",
  "university": "אוניברסיטת פיזה",
  "languages-label": "שפות:",
  "languages": "איטלקית, אנגלית",
  "focus-label": "מיקוד:",
  "focus": "LLMs רב-לשוניים",
  "about-conclusion": "הגדלתי את האימון ליותר מ-1,000 מעבדים גרפיים והרחבתי את כיסוי התרגום המכונה ל-201 שפות. הייתי בין המייסדים של <a href=\"https://picarta.ai/\" target=\"_blank\" style=\"color: var(--accent-primary); text-decoration: none; font-weight: 600;\">Picarta.ai</a>, סטארט-אפ של בינה מלאכותית שבנה פלטפורמה לגיאולוקליזציה של תמונות. אני אדם שלמד ללא הפסקה, ושאף כל הזמן לשפר את האופן שבו אני חושב, מתאמן ובונה. אני לא יכול לדמיין חיים בלי אימון כלשהו, בין אם זה GPU, משקולות בחדר הכושר או הכנה למרתון.",
  "tech-title": "טכנולוגיות וכלים",
  "tech-pytorch": "למידת עומק",
  "tech-python": "שפת תכנות עיקרית",
  "tech-slurm": "תזמון עבודות HPC",
  "tech-vllm": "שירות LLM בעל ביצועים גבוהים",
  "tech-transformers": "LLMs ו-NLP",
  "tech-mongodb": "אחסון נתונים",
  "tech-docker": "מיכלים",
  "tech-git": "בקרת גרסאות",
  "focus-title": "התמקדות נוכחית",
  "focus-description": "מה אני בונה ומחקר כרגע",
  "focus-scaling-title": "הרחבת תרגום מכונה ל-201 שפות",
  "focus-scaling-desc": "הרחבת כיסוי התרגום המכונה תוך שמירה על האיכות. עבודה עם מערכי נתונים רב-לשוניים מסיביים ואופטימיזציה לשפות עם משאבים נמוכים באמצעות טכניקות מתקדמות של למידת העברה.",
  "focus-production-title": "בינה מלאכותית רב-לשונית בייצור",
  "focus-production-desc": "בניית מערכות תרגום חזקות שמתמודדות עם מורכבות העולם האמיתי בקנה מידה גדול. התמודדות עם אתגרים כמו החלפת קוד, התאמה לדומיין, תוכן רועש שנוצר על ידי משתמשים ושמירה על איכות בקרב יותר מ-200 מיליון משתמשים מדי יום.",
  "tag-realtime": "הגשה בזמן אמת",
  "tag-quality": "אבטחת איכות",
  "tag-data": "נתונים",
  "resume-title": "קורות חיים",
  "resume-description": "מהנדס וחוקר בינה מלאכותית עם ניסיון רב בניית והרחבת מערכות תרגום מכונה רב-לשוניות. היסטוריית שירות מוכחת של יותר מ-200 מיליון משתמשים באמצעות פתרונות LLM חדשניים.",
  "experience-title": "ניסיון תעסוקתי",
  "current-role": "מהנדס ובוחן בינה מלאכותית",
  "current-company": "Translated, רומא, איטליה",
  "lara-desc": "<strong>לרה:</strong> עבדה על תהליך המו\"פ המלא של LLM המותאם לתרגום מכונה: מאיסוף נתונים והכשרת מודלים ועד ליישור ואופטימיזציה של הסקה. נבנה מאפס בתוך צוות בסגנון סטארט-אפ של ארבעה אנשים הפועלים בתוך החברה. כעת המוצר המוביל של B2B, הוא מתרגם את כל התוכן ברחבי העולם עבור Airbnb ורוב התוכן של Uber, Shopify, Nike ועוד, ומגיע ליותר מ-200 מיליון משתמשים ברחבי העולם. גרסת B2C הושקה לאחרונה.",
  "try-here": "אפשר לנסות את זה כאן",
  "lara-grande-desc": "<strong>לרה גרנדה:</strong> תפקיד מרכזי בהרחבת LLM כדי להתאים לאיכות של 1% מהמתרגמים המקצועיים המובילים. השתמשה ביותר מ-1,000 מעבדים גרפיים באשכול ה-HPC של CINECA לאימון מבוזר בקנה מידה גדול.",
  "language-expansion-desc": "<strong>הרחבת שפות:</strong> זיהיתי והובלתי פרויקט מחקר מוצלח להרחבת כיסוי ייצור תרגום מכונה מ-56 ל-201 שפות, עלייה של פי 4, מה שהופך אותו למנוע תרגום מכונה מסחרי הראשון התומך בטווח כזה. הצעתי את הכיוון, תכננתי את תוכנית היישום והובלתי אותה להשלמה תוך שמונה חודשים.",
  "instruction-mt-desc": "<strong>תרגום מכונה בעקבות הוראות:</strong> הובלת מחקר המיישר את LLM לפעול לפי מדריכי סגנון מפורטים באמצעות SFT ו-DPO.",
  "trust-attention-desc": "<strong>תשומת לב לאמון:</strong> הצעתי ואימתתי טכניקה חדשה שמתעדפת נתוני אימון בעלי ערך גבוה, והשגתי את השיפורים המשמעותיים ביותר באיכות תרגום מכונה בחמש שנים.",
  "polyglot-desc": "<strong>פוליגלוט:</strong> פיתח מודל זיהוי שפה התומך ב-201 שפות.",
  "startup-title": "חוויית סטארט-אפ",
  "startup-role": "מייסד שותף ומהנדס בינה מלאכותית",
  "italy": "איטליה",
  "startup-desc1": "מייסד שותף של סטארט-אפ בינה מלאכותית כחלק מצוות מייסד בן שלושה אנשים, שבנה פלטפורמה לגיאולוקליזציה של תמונות",
  "startup-desc2": "פיתחתי את המודל הליבה לגיאולוקליזציה של תמונות באמצעות משנהי ראייה וטכניקות מבוססות-אחזור",
  "startup-desc3": "צברתי ניסיון יקר ערך בסביבת סטארט-אפ מהירה ופיתוח מוצרים",
  "startup-desc4": "למדו שיעורים קריטיים על דינמיקה של צוות, ניהול אי ודאות ואיטור מהיר",
  "education-title": "השכלה",
  "masters-full": "תואר שני בבינה מלאכותית והנדסת נתונים",
  "university-location": "אוניברסיטת פיזה, פיזה, איטליה",
  "masters-description": "110/110 בהצטיינות יתרה (4.0 GPA). מתמחה בכרייה של נתונים, למידת מכונה, ראייה ממוחשבת, עיבוד שפה טבעית, תיאוריית אופטימיזציה וכרייה של תהליכים. צבר ניסיון מעשי עם מערכות מבוזרות, מחשוב ענן וכלים כמו MongoDB, Neo4j, Docker, Kubernetes, TensorFlow ו-PyTorch.",
  "bachelors-full": "תואר ראשון בהנדסת מחשבים",
  "bachelors-description": "110/110 (4.0 GPA). בסיס חזק בהנדסת מחשבים כולל מתמטיקה, פיזיקה, אלגוריתמים, מסדי נתונים, ארכיטקטורת מחשבים, רשתות מחשבים, מערכות הפעלה ותכנות ב-C, C++, Java, Python, Matlab, SQL, JavaScript ו-PHP.",
  "portfolio-title": "תיק עבודות",
  "portfolio-description": "אוסף של פרויקטים שלי בתחום הבינה המלאכותית ולמידת מכונה, החל ממחקר אקדמי ועד למערכות ייצור המשרתות מיליוני משתמשים ברחבי העולם.",
  "t4sa-desc": "מערכת אנליזה ויזואלית של רגשות בין-מודאלית באמצעות זיקוק ידע ממודלים של טקסט למודלים חזותיים. פורסם ב-ECAI 2023, והשיג תוצאות חדשניות בתחזית רגש חזותי.",
  "numpygpt-desc": "GPT מאפס שנבנה עם ספריית NumPy ו-Python הסטנדרטית. ללא autograd, ללא מסגרות: כל שכבה מיושמת מחדש עם מעבר קדימה ואחורה משלה. גרדיאנטים מחושבים ידנית, עדכונים שקופים וכל פעולה מפורטת.",
  "fake-news-desc": "מערכת בינה מלאכותית מולטימודאלית לזיהוי מידע כוזב באמצעות ארכיטקטורות טרנספורמר. כולל ניתוח עמדות ודירוג אמינות מקורות.",
  "unimusic-desc": "פלטפורמת גילוי מוזיקה מדרגית עם ארכיטקטורה היברידית של MongoDB/Neo4j. מטפל במיליוני רצועות עם אלגוריתמים להמלצות בזמן אמת.",
  "voice-vibes-desc": "מערכת זיהוי רגשות בדיבור עם ששת ארכיטקטורות בינה מלאכותית חדשניות. השגת דיוק של 94% באמצעות שיטות אנסמבל והנדסת תכונות מתקדמת.",
  "federated-dbscan-desc": "שמירה על פרטיות באיגוד מאובנן עם למידה מאוחדת. מאפשר למידה שיתופית מבוססת מכונה ללא שיתוף נתונים, תוך שמירה על פרטיות של 99%.",
  "pagerank-desc": "יישום אלגוריתם PageRank בעל ביצועים גבוהים עם פעולות מטריצה דלילות מותאמות. מטפל ביעילות בגרפים עם מיליוני צמתים.",
  "contact-title": "צור קשר",
  "contact-description": "בואו נתחבר! בין אם אתם רוצים לדון על בינה מלאכותית, למידת מכונה או שיתופי פעולה פוטנציאליים, אני תמיד פתוח לשיחות מעניינות.",
  "location-label": "מיקום:",
  "location": "רומא, איטליה",
  "form-name": "שמך",
  "form-email": "כתובת האימייל שלך",
  "form-subject": "נושא",
  "form-message": "הודעה",
  "form-loading": "טוען",
  "form-success": "ההודעה שלכם נשלחה. תודה!",
  "form-send": "שלח הודעה"
}