{
  "nav-home": "होम",
  "nav-about": "इसके बारे में",
  "nav-tech": "टेक स्टैक",
  "nav-resume": "फिर से शुरू करें",
  "nav-portfolio": "पोर्टफोलियो",
  "nav-contact": "संपर्क करें",
  "language-label": "भाषा",
  "language-selector-header": "भाषा चुनें ({count} उपलब्ध है)",
  "hero-subtitle": "AI को अपनी भाषा बोलना, एक समय में एक मॉडल बनाना",
  "multilingual-typed": [
    "I train LLMs to speak your language.",
    "我训练大型语言模型来讲你的语言。",
    "Entreno LLMs para hablar tu idioma.",
    "Ich trainiere LLMs, damit sie deine Sprache sprechen.",
    "J'entraîne des LLM pour qu'ils parlent votre langue.",
    "あなたの言語を话せるように、LLMを訓練しています。",
    "Treino LLMs para falar o seu idioma.",
    "أقوم بتدريب LLM لتتحدث لغتك.",
    "Alleno LLM per parlare la tua lingua.",
    "Я обучаю LLM говорить на вашем языке."
  ],
  "about-title": "मेरे बारे में (1)",
  "about-description": "मैं एक एआई शोधकर्ता और इंजीनियर हूं जो बहुभाषी बड़ी भाषा मॉडल पर केंद्रित है।",
  "about-role": "एआई इंजीनियर और शोधकर्ता",
  "about-intro": "Translated में, मैंने पहले दिन से ही लारा को बनाने में मदद की, जो एक मशीन अनुवाद LLM है जो Airbnb, Uber, Shopify और अन्य लोगों के लिए वास्तविक समय में सामग्री को सशक्त बनाता है, और 200 मिलियन से अधिक उपयोगकर्ताओं तक पहुंचता है।",
  "birth-place-label": "जन्म स्थान:",
  "birth-place": "नेपल्स, इटली",
  "email-label": "ईमेल:",
  "city-label": "शहर:",
  "city": "रोम, इटली",
  "masters-label": "एमएस डिग्री:",
  "masters-degree": "एआई और डेटा इंजीनियरिंग",
  "bachelors-label": "बीएस डिग्री:",
  "bachelors-degree": "कंप्यूटर अभियांत्रिकी",
  "university-label": "विश्वविद्यालय:",
  "university": "पीसा विश्वविद्यालय",
  "languages-label": "भाषाएँ:",
  "languages": "इतालवी, अंग्रेज़ी",
  "focus-label": "ध्यान दें:",
  "focus": "बहुभाषी एलएलएम",
  "about-conclusion": "मैंने 1,000+ GPU के लिए प्रशिक्षण बढ़ाया है और 201 भाषाओं में मशीन अनुवाद कवरेज का विस्तार किया है। मैंने Picarta.ai की सह-स्थापना की, जो एक AI स्टार्टअप है जो छवि भू-स्थानिककरण के लिए एक मंच का निर्माण करता है.. मैं एक उत्साही शिक्षार्थी हूं जो लगातार मेरे सोचने, प्रशिक्षण और निर्माण में सुधार करने के लिए जोर देता है। मैं किसी भी प्रकार के प्रशिक्षण के बिना जीवन की कल्पना नहीं कर सकता, चाहे वह जीपीयू, जिम प्लेट्स या मैराथन तैयारी हो।",
  "tech-title": "प्रौद्योगिकी और उपकरण",
  "focus-title": "मौज़ूदा फ़ोकस",
  "focus-description": "मैं अभी क्या बना रहा हूं और शोध कर रहा हूं",
  "focus-scaling-title": "201 भाषाओं में स्केलिंग मशीन अनुवाद",
  "focus-scaling-desc": "गुणवत्ता बनाए रखते हुए मशीन अनुवाद कवरेज का विस्तार करना। बड़े पैमाने पर बहुभाषी डेटासेट के साथ काम करना और उन्नत हस्तांतरण सीखने की तकनीकों का उपयोग करके कम संसाधन वाली भाषाओं के लिए अनुकूलन करना।",
  "focus-production-title": "उत्पादन में बहुभाषी एआई",
  "focus-production-desc": "बड़े पैमाने पर वास्तविक दुनिया की जटिलता को संभालने वाली मजबूत अनुवाद प्रणालियों का निर्माण। कोड-स्विचिंग, डोमेन अनुकूलन, शोर उपयोगकर्ता उत्पन्न सामग्री और 200+ मिलियन दैनिक उपयोगकर्ताओं में गुणवत्ता बनाए रखने जैसी चुनौतियों से निपटना।",
  "tag-realtime": "रीयल-टाइम सर्विसिंग",
  "tag-quality": "गुणवत्ता आश्वासन",
  "resume-title": "फिर से शुरू करें",
  "resume-description": "बहुभाषी मशीन अनुवाद प्रणालियों के निर्माण और स्केलिंग में व्यापक अनुभव के साथ एआई इंजीनियर और शोधकर्ता। अभिनव एलएलएम समाधानों के माध्यम से 200+ मिलियन उपयोगकर्ताओं की सेवा का सिद्ध ट्रैक रिकॉर्ड।",
  "experience-title": "व्यावसायिक अनुभव",
  "current-role": "एआई इंजीनियर और शोधकर्ता",
  "current-company": "अनुवाद किया गया, रोम, इटली",
  "lara-desc": "लारा: मशीन अनुवाद के लिए अनुकूलित एलएलएम की पूर्ण आर एंड डी पाइपलाइन पर काम किया: डेटा संग्रह और मॉडल प्रशिक्षण से संरेखण और अनुमान अनुकूलन तक। कंपनी के भीतर चार ऑपरेटिंग की एक स्टार्टअप शैली टीम के भीतर खरोंच से बनाया गया। अब प्रमुख B2B उत्पाद, यह Airbnb और अधिकांश Uber, Shopify, Nike और अन्य के लिए दुनिया भर में सभी सामग्री का अनुवाद करता है, जो विश्व स्तर पर 200 मिलियन से अधिक उपयोगकर्ताओं तक पहुंचता है। हाल ही में एक B2C संस्करण भी लॉन्च किया गया है।",
  "try-here": "इसे यहां आज़माएं",
  "lara-grande-desc": "लारा ग्रांडे: पेशेवर अनुवादकों के शीर्ष 1% की गुणवत्ता से मेल खाने के लिए एलएलएम को स्केल करने में महत्वपूर्ण भूमिका। बड़े पैमाने पर वितरित प्रशिक्षण के लिए CINECA के HPC क्लस्टर पर 1,000 GPU से अधिक का उपयोग किया गया।",
  "language-expansion-desc": "भाषा विस्तार: मशीन अनुवाद उत्पादन कवरेज को 56 से 201 भाषाओं तक विस्तारित करने के लिए एक सफल अनुसंधान परियोजना की पहचान और नेतृत्व किया, जो 4× वृद्धि थी, जिससे यह इस तरह की सीमा का समर्थन करने वाला पहला वाणिज्यिक मशीन अनुवाद इंजन बन गया। दिशा का प्रस्ताव रखा, कार्यान्वयन योजना तैयार की, और आठ महीने के भीतर इसे पूरा करने के लिए नेतृत्व किया।",
  "instruction-mt-desc": "अनुदेश का पालन मशीन अनुवाद: एलईडी अनुसंधान aligning एलएलएम विस्तृत शैली गाइड का पालन करने के लिए एसएफटी और डीपीओ का उपयोग कर.",
  "trust-attention-desc": "ट्रस्ट ध्यान दें: उच्च-मूल्य प्रशिक्षण डेटा को प्राथमिकता देने वाली एक उपन्यास तकनीक का प्रस्ताव और सत्यापन, पांच वर्षों में सबसे महत्वपूर्ण मशीन अनुवाद गुणवत्ता में सुधार प्राप्त करना।",
  "polyglot-desc": "बहुभाषीः 201 भाषाओं का समर्थन करने वाला भाषा पहचान मॉडल विकसित किया।",
  "startup-title": "स्टार्टअप अनुभव",
  "startup-role": "सह-संस्थापक और एआई इंजीनियर",
  "italy": "इटली",
  "startup-desc1": "तीन-व्यक्ति संस्थापक टीम बिल्डिंग इमेज जियोलोकेलाइजेशन प्लेटफॉर्म के हिस्से के रूप में सह-स्थापित एआई स्टार्टअप",
  "startup-desc2": "दृष्टि ट्रांसफार्मर और पुनर्प्राप्ति-आधारित तकनीकों का उपयोग करके छवि भू-स्थानिककरण के लिए कोर मॉडल विकसित किया",
  "startup-desc3": "तेज गति वाले स्टार्टअप वातावरण और उत्पाद विकास में मूल्यवान अनुभव प्राप्त किया",
  "startup-desc4": "टीम की गतिशीलता, अनिश्चितता प्रबंधन और तेजी से पुनरावृत्ति के बारे में महत्वपूर्ण सबक सीखे",
  "education-title": "शिक्षा",
  "masters-full": "एमएस आर्टिफिशियल इंटेलिजेंस एंड डेटा इंजीनियरिंग",
  "university-location": "पीसा विश्वविद्यालय, पीसा, इटली",
  "masters-description": "110/110 summa cum laude (4.0 GPA). डेटा माइनिंग, मशीन लर्निंग, कंप्यूटर विजन, नेचुरल लैंग्वेज प्रोसेसिंग, ऑप्टिमाइजेशन थ्योरी और प्रोसेस माइनिंग में विशेषज्ञता। वितरित सिस्टम, क्लाउड कंप्यूटिंग और MongoDB, Neo4j, Docker, Kubernetes, TensorFlow और PyTorch जैसे टूल के साथ व्यावहारिक अनुभव प्राप्त किया।",
  "bachelors-full": "बीएस कंप्यूटर इंजीनियरिंग",
  "bachelors-description": "110/110 (4.0 जीपीए)। सी, सी++, जावा, पायथन, मैटलैब, एसक्यूएल, जावास्क्रिप्ट और पीएचपी में गणित, भौतिकी, एल्गोरिदम, डेटाबेस, कंप्यूटर आर्किटेक्चर, कंप्यूटर नेटवर्क, ऑपरेटिंग सिस्टम और प्रोग्रामिंग सहित कंप्यूटर इंजीनियरिंग में मजबूत नींव।",
  "portfolio-title": "पोर्टफोलियो",
  "portfolio-description": "अकादमिक अनुसंधान से लेकर उत्पादन प्रणालियों तक, दुनिया भर में लाखों उपयोगकर्ताओं की सेवा करने वाली मेरी एआई और मशीन लर्निंग परियोजनाओं का एक संग्रह।",
  "t4sa-desc": "पाठ से दृष्टि मॉडल तक ज्ञान आसवन का उपयोग करके क्रॉस-मोडल दृश्य भावना विश्लेषण प्रणाली। ECAI 2023 में प्रकाशित, दृश्य भावना भविष्यवाणी पर अत्याधुनिक परिणाम प्राप्त करना।",
  "numpygpt-desc": "NumPy और पायथन की मानक लाइब्रेरी के साथ बनाया गया एक स्क्रैच GPT। कोई ऑटोग्रैड नहीं, कोई चौखटे नहींः प्रत्येक परत को अपने स्वयं के आगे और पीछे के पास के साथ फिर से लागू किया जाता है। ग्रेडिएंट्स की गणना मैन्युअल रूप से की जाती है, अपडेट पारदर्शी होते हैं, और प्रत्येक ऑपरेशन की वर्तनी होती है।",
  "fake-news-desc": "ट्रांसफार्मर आर्किटेक्चर का उपयोग करके गलत सूचना का पता लगाने के लिए मल्टी-मॉडल एआई सिस्टम। रुख विश्लेषण और स्रोत विश्वसनीयता स्कोरिंग सुविधाएँ।",
  "unimusic-desc": "हाइब्रिड MongoDB/Neo4j वास्तुकला के साथ स्केलेबल संगीत खोज मंच। वास्तविक समय सिफारिश एल्गोरिदम के साथ पटरियों के लाखों संभालती है।",
  "voice-vibes-desc": "छह उपन्यास AI आर्किटेक्चर के साथ स्पीच इमोशन रिकग्निशन सिस्टम। पहनावा विधियों और उन्नत फीचर इंजीनियरिंग का उपयोग करके 94% सटीकता प्राप्त की।",
  "federated-dbscan-desc": "फ़ेडरेटेड लर्निंग के साथ गोपनीयता-संरक्षण वितरित क्लस्टरिंग। डेटा साझा किए बिना सहयोगी एमएल सक्षम करता है, 99% गोपनीयता संरक्षण प्राप्त करता है।",
  "pagerank-desc": "अनुकूलित विरल मैट्रिक्स संचालन के साथ उच्च प्रदर्शन पेजरैंक एल्गोरिथ्म कार्यान्वयन। कुशलता से नोड्स के लाखों लोगों के साथ रेखांकन संभालती है।",
  "contact-title": "संपर्क करें",
  "contact-description": "आइए जुड़ें! चाहे आप एआई, मशीन लर्निंग या संभावित सहयोग पर चर्चा करना चाहते हों, मैं हमेशा दिलचस्प बातचीत के लिए खुला हूं।",
  "location-label": "लोकेशन",
  "location": "रोम, इटली",
  "form-name": "आपका नाम",
  "form-email": "आपका ईमेल",
  "form-subject": "विषय",
  "form-message": "मैसेज",
  "form-loading": "लोड हो रहा है",
  "form-success": "आपका संदेश भेज दिया गया है। धन्यवाद!",
  "form-send": "मैसेज भेजें"
}