{
  "nav-home": "Početna",
  "nav-about": "O meni",
  "nav-tech": "Tehnologije",
  "nav-resume": "Životopis",
  "nav-portfolio": "Portfelj",
  "nav-contact": "Kontakt",
  "language-label": "Jezik",
  "language-selector-header": "Odaberite jezik ({count} dostupno)",
  "hero-subtitle": "Kako učiniti da umjetna inteligencija govori vaš jezik, jedan po jedan model",
  "multilingual-typed": [
    "I train LLMs to speak your language.",
    "我训练大型语言模型来讲你的语言。",
    "Entreno LLMs para hablar tu idioma.",
    "Ich trainiere LLMs, damit sie deine Sprache sprechen.",
    "J'entraîne des LLM pour qu'ils parlent votre langue.",
    "あなたの言語を话せるように、LLMを訓練しています。",
    "Treino LLMs para falar o seu idioma.",
    "أقوم بتدريب LLM لتتحدث لغتك.",
    "Alleno LLM per parlare la tua lingua.",
    "Я обучаю LLM говорить на вашем языке."
  ],
  "about-title": "O meni u O(1)",
  "about-description": "Istraživačica sam i inženjerka u području umjetne inteligencije, a usredotočena sam na višejezične velike jezične modele.",
  "about-role": "Inženjer i istraživač umjetne inteligencije",
  "about-intro": "U Translatedu sam od prvog dana pomogao u razvoju Lare, modela za strojno prevođenje koji u stvarnom vremenu pruža sadržaj za Airbnb, Uber, Shopify i druge, dosežući više od 200 milijuna korisnika.",
  "birth-place-label": "Mjesto rođenja:",
  "birth-place": "Napulj, Italija",
  "email-label": "E-pošta:",
  "city-label": "Grad:",
  "city": "Rim, Italija",
  "masters-label": "Magisterij:",
  "masters-degree": "Umjetna inteligencija i podatkovni inženjering",
  "bachelors-label": "Prvostupnik:",
  "bachelors-degree": "Računalno inženjerstvo",
  "university-label": "Sveučilište:",
  "university": "Sveučilište u Pisi",
  "languages-label": "Jezici:",
  "languages": "Talijanski, engleski",
  "focus-label": "Fokus:",
  "focus": "Višejezični LLM-ovi",
  "about-conclusion": "Skalirao sam obuku na više od 1000 GPU-a i proširio pokrivenost strojnog prevođenja na 201 jezik. Suosnivač sam tvrtke <a href=\"https://picarta.ai/\" target=\"_blank\" style=\"color: var(--accent-primary); text-decoration: none; font-weight: 600;\">Picarta.ai</a>, startupa za umjetnu inteligenciju koji razvija platformu za geolokaciju slika. Neprestano učim i uvijek nastojim poboljšati način na koji razmišljam, treniram i stvaram. Ne mogu zamisliti život bez nekog oblika treninga, bilo da se radi o grafičkim procesorima, utezima u teretani ili pripremi za maraton.",
  "tech-title": "Tehnologije i alati",
  "tech-pytorch": "Duboko učenje",
  "tech-python": "Primarni jezik",
  "tech-slurm": "Zakazivanje HPC zadataka",
  "tech-vllm": "Izdavanje LLM-ova visokih performansi",
  "tech-transformers": "LLM-ovi i NLP",
  "tech-mongodb": "Pohrana podataka",
  "tech-docker": "Kontejnerizacija",
  "tech-git": "Kontrola verzija",
  "focus-title": "Trenutačni fokus",
  "focus-description": "Što trenutačno izrađujem i istražujem",
  "focus-scaling-title": "Skaliranje strojnog prevođenja na 201 jezik",
  "focus-scaling-desc": "Proširivanje pokrivenosti strojnim prevođenjem uz održavanje kvalitete. Rad s ogromnim višejezičnim skupovima podataka i optimizacija za jezike s niskim resursima pomoću naprednih tehnika transfernog učenja.",
  "focus-production-title": "Višejezična umjetna inteligencija u proizvodnji",
  "focus-production-desc": "Izgradnja robusnih sustava za prevođenje koji se mogu nositi sa složenošću stvarnog svijeta na velikoj razini. Rješavanje izazova kao što su prebacivanje kodova, prilagodba domene, korisnički sadržaj koji sadrži mnogo šuma i održavanje kvalitete za više od 200 milijuna korisnika dnevno.",
  "tag-realtime": "Obrada u stvarnom vremenu",
  "tag-quality": "Osiguranje kvalitete",
  "tag-data": "Podaci",
  "resume-title": "Životopis",
  "resume-description": "Inženjer i istraživač umjetne inteligencije s bogatim iskustvom u izgradnji i skaliranju višejezičnih sustava strojnog prevođenja. Dokazana uspješnost u pružanju usluga za više od 200 milijuna korisnika putem inovativnih LLM rješenja.",
  "experience-title": "Profesionalno iskustvo",
  "current-role": "Inženjer i istraživač umjetne inteligencije",
  "current-company": "Translated, Rim, Italija",
  "lara-desc": "<strong>Lara:</strong> radila je na cijelom procesu istraživanja i razvoja LLM-a optimiziranog za strojno prevođenje: od prikupljanja podataka i obuke modela do optimizacije usklađivanja i zaključivanja. Izrađen od nule unutar tima u stilu startupa od četiri osobe koji djeluje unutar tvrtke. Sada je vodeći B2B proizvod, koji prevodi sav sadržaj diljem svijeta za Airbnb i većinu sadržaja Ubera, Shopifya, Nikea i drugih, dosežući više od 200 milijuna korisnika diljem svijeta. Nedavno je pokrenuta i B2C verzija.",
  "try-here": "Isprobajte ovdje",
  "lara-grande-desc": "<strong>Lara Grande:</strong> ključna uloga u skaliranju LLM-a kako bi se postigla kvaliteta najboljih 1 % profesionalnih prevoditelja. Korišteno je više od 1000 grafičkih procesora na CINECA-inom HPC klasteru za opsežno distribuirano učenje.",
  "language-expansion-desc": "<strong>Proširenje jezika:</strong> Identificirao sam i vodio uspješan istraživački projekt za proširenje pokrivenosti proizvodnje strojnog prevođenja s 56 na 201 jezik, što je povećanje od 4×, čineći ga prvim komercijalnim strojnim prijevodnim sustavom koji podržava takav raspon. Predložio sam smjer, osmislio plan provedbe i doveo ga do kraja u roku od osam mjeseci.",
  "instruction-mt-desc": "<strong>Strojno prevođenje koje slijedi upute:</strong> vodila istraživanje usklađivanja LLM-a s detaljnim stilskim vodičima pomoću SFT-a i DPO-a.",
  "trust-attention-desc": "<strong>Povjerenje:</strong> Predložili smo i potvrdili novu tehniku koja daje prioritet podacima visoke vrijednosti, čime smo postigli najznačajnija poboljšanja kvalitete strojnog prevođenja u posljednjih pet godina.",
  "polyglot-desc": "<strong>Polyglot:</strong> Razvijen je model za identifikaciju jezika koji podržava 201 jezik.",
  "startup-title": "Iskustvo u startupu",
  "startup-role": "Suosnivač i inženjer umjetne inteligencije",
  "italy": "Italija",
  "startup-desc1": "Suosnivač startupa za umjetnu inteligenciju kao dio tročlanog osnivačkog tima koji gradi platformu za geolokaciju slika",
  "startup-desc2": "Razvijen je osnovni model za geolokaciju slika pomoću vizualnih transformatora i tehnika temeljenih na dohvaćanju.",
  "startup-desc3": "Stekao vrijedno iskustvo u dinamičnom okruženju startupa i razvoju proizvoda",
  "startup-desc4": "Stekli su ključna iskustva o dinamici tima, upravljanju neizvjesnošću i brzoj iteraciji.",
  "education-title": "Obrazovanje",
  "masters-full": "Magistar umjetne inteligencije i podatkovnog inženjerstva",
  "university-location": "Sveučilište u Pisi, Pisa, Italija",
  "masters-description": "110/110 summa cum laude (4,0 GPA). Specijaliziran za rudarenje podataka, strojno učenje, računalni vid, obradu prirodnog jezika, teoriju optimizacije i rudarenje procesa. Stekao praktično iskustvo s distribuiranim sustavima, računalstvom u oblaku i alatima kao što su MongoDB, Neo4j, Docker, Kubernetes, TensorFlow i PyTorch.",
  "bachelors-full": "Prvostupnik računalnog inženjerstva",
  "bachelors-description": "110/110 (4,0 GPA). Snažni temelji u računalnom inženjerstvu, uključujući matematiku, fiziku, algoritme, baze podataka, računalnu arhitekturu, računalne mreže, operativne sustave i programiranje u jezicima C, C++, Java, Python, Matlab, SQL, JavaScript i PHP.",
  "portfolio-title": "Portfelj",
  "portfolio-description": "Zbirka mojih projekata umjetne inteligencije i strojnog učenja, od akademskih istraživanja do proizvodnih sustava koji opslužuju milijune korisnika diljem svijeta.",
  "t4sa-desc": "Sustav za analizu vizualnih osjećaja koji koristi destilaciju znanja iz tekstualnih u vizualne modele. Objavljeno na ECAI 2023, postigao je najsuvremenije rezultate u predviđanju vizualnog osjećaja.",
  "numpygpt-desc": "GPT izgrađen od nule pomoću NumPyja i standardne biblioteke Pythona. Bez autograda, bez okvira: svaki sloj ponovno se implementira s vlastitim prolazom prema naprijed i unatrag. Gradijenti se izračunavaju ručno, ažuriranja su transparentna, a svaka operacija je detaljno opisana.",
  "fake-news-desc": "Multimodalni sustav umjetne inteligencije za otkrivanje dezinformacija pomoću arhitektura transformatora. Sadrži analizu stava i ocjenjivanje vjerodostojnosti izvora.",
  "unimusic-desc": "Skalabilna platforma za otkrivanje glazbe s hibridnom arhitekturom MongoDB/Neo4j. Upravlja milijunima zapisa uz algoritme preporuka u stvarnom vremenu.",
  "voice-vibes-desc": "Sustav za prepoznavanje govornih emocija sa šest novih arhitektura umjetne inteligencije. Postignuta je točnost od 94 % pomoću skupnih metoda i naprednog inženjeringa značajki.",
  "federated-dbscan-desc": "Distribuirano grupiranje koje čuva privatnost s federiranim učenjem. Omogućuje suradnički strojno učenje bez razmjene podataka, čime se postiže 99 % zaštite privatnosti.",
  "pagerank-desc": "Implementacija algoritma PageRank visokih performansi s optimiziranim operacijama rijetkih matrica. Učinkovito obrađuje grafikone s milijunima čvorova.",
  "contact-title": "Kontakt",
  "contact-description": "Povežimo se! Bilo da želite razgovarati o umjetnoj inteligenciji, strojnom učenju ili potencijalnoj suradnji, uvijek sam otvoren za zanimljive razgovore.",
  "location-label": "Lokacija:",
  "location": "Rim, Italija",
  "form-name": "Vaše ime",
  "form-email": "Vaša e-mail adresa",
  "form-subject": "Predmet",
  "form-message": "Poruka",
  "form-loading": "Učitavanje",
  "form-success": "Vaša je poruka poslana. Hvala!",
  "form-send": "Pošalji"
}