{
  "nav-home": "Kezdőlap",
  "nav-about": "Rólam",
  "nav-tech": "Technológiai háttér",
  "nav-resume": "Önéletrajz",
  "nav-portfolio": "Portfólió",
  "nav-contact": "Kapcsolat",
  "language-label": "Nyelv",
  "language-selector-header": "Nyelv kiválasztása ({count} elérhető)",
  "hero-subtitle": "Hogy az AI a te nyelvedet beszélje, modellenként",
  "multilingual-typed": [
    "I train LLMs to speak your language.",
    "我训练大型语言模型来讲你的语言。",
    "Entreno LLMs para hablar tu idioma.",
    "Ich trainiere LLMs, damit sie deine Sprache sprechen.",
    "J'entraîne des LLM pour qu'ils parlent votre langue.",
    "あなたの言語を话せるように、LLMを訓練しています。",
    "Treino LLMs para falar o seu idioma.",
    "أقوم بتدريب LLM لتتحدث لغتك.",
    "Alleno LLM per parlare la tua lingua.",
    "Я обучаю LLM говорить на вашем языке."
  ],
  "about-title": "Rólam",
  "about-description": "MI-kutató és mérnök vagyok, és többnyelvű, nagy nyelvi modellekkel foglalkozom.",
  "about-role": "AI mérnök és kutató",
  "about-intro": "A Translatednél az első naptól kezdve segítettem a Lara, egy gépi fordítási LLM kiépítésében, amely valós időben biztosít tartalmat az Airbnb, az Uber, a Shopify és mások számára, és több mint 200 millió felhasználót ér el.",
  "birth-place-label": "Születési hely:",
  "birth-place": "Nápoly, Olaszország",
  "email-label": "E-mail:",
  "city-label": "Város:",
  "city": "Róma, Olaszország",
  "masters-label": "Mesterképzés:",
  "masters-degree": "MI és adattechnika",
  "bachelors-label": "Alapdiploma:",
  "bachelors-degree": "Számítástechnika",
  "university-label": "Egyetem:",
  "university": "Pisai Egyetem",
  "languages-label": "Nyelvek:",
  "languages": "Olasz, angol",
  "focus-label": "Fókusz:",
  "focus": "Többnyelvű LLM-ek",
  "about-conclusion": "A képzést több mint 1000 GPU-ra bővítettem, és 201 nyelvre terjesztettem ki a gépi fordítás lefedettségét. Társalapítója vagyok a <a href=\"https://picarta.ai/\" target=\"_blank\" style=\"color: var(--accent-primary); text-decoration: none; font-weight: 600;\">Picarta.ai</a> nevű AI startupnak, amely egy platformot épít a képek földrajzi helymeghatározásához. Folyamatosan tanulok, és arra törekszem, hogy egyre jobban gondolkodjak, tanuljak és építkezzek. Nem tudok elképzelni egy életet képalkotó processzorok, súlyzós edzés vagy maratonra való felkészülés nélkül.",
  "tech-title": "Technológiák és eszközök",
  "tech-pytorch": "Mélytanulás",
  "tech-python": "Elsődleges nyelv",
  "tech-slurm": "HPC feladatütemezés",
  "tech-vllm": "Nagy teljesítményű LLM kiszolgálás",
  "tech-transformers": "LLM-ek és NLP",
  "tech-mongodb": "Adattárolás",
  "tech-docker": "Konténeres szállítás",
  "tech-git": "Verziókezelés",
  "focus-title": "Jelenlegi fókusz",
  "focus-description": "Amit jelenleg építek és kutatok",
  "focus-scaling-title": "A gépi fordítás 201 nyelvre való kiterjesztése",
  "focus-scaling-desc": "A gépi fordítási lefedettség bővítése a minőség fenntartása mellett. Hatalmas többnyelvű adatkészletekkel dolgozunk, és fejlett transzferképzési technikákkal optimalizáljuk az alacsony erőforrású nyelveket.",
  "focus-production-title": "Többnyelvű AI a termelésben",
  "focus-production-desc": "Robusztus fordítórendszerek építése, amelyek nagy mennyiségben képesek kezelni a valós élet összetettségét. Olyan kihívások kezelése, mint a kódváltás, a tartományadaptáció, a zajos, felhasználók által generált tartalom és a minőség fenntartása több mint 200 millió napi felhasználó számára.",
  "tag-realtime": "Valós idejű kiszolgálás",
  "tag-quality": "Minőségbiztosítás",
  "tag-data": "Adatok",
  "resume-title": "Önéletrajz",
  "resume-description": "MI-mérnök és kutató, kiterjedt tapasztalattal a többnyelvű gépi fordítórendszerek építésében és skálázásában. Bizonyított tapasztalat több mint 200 millió felhasználó kiszolgálásában innovatív LLM-megoldások révén.",
  "experience-title": "Szakmai tapasztalat",
  "current-role": "AI mérnök és kutató",
  "current-company": "Translated, Róma, Olaszország",
  "lara-desc": "<strong>Lara:</strong> Egy gépi fordításra optimalizált LLM teljes K+F-pipeline-ján dolgoztam: az adatgyűjtéstől és a modellképzéstől az igazításig és a következtetésoptimalizálásig. Egy startup stílusú, négyfős csapatban építettük fel a semmiből, akik a vállalaton belül működtek. A jelenlegi kiemelt B2B-termék világszerte lefordítja az Airbnb, valamint az Uber, a Shopify, a Nike és mások legtöbb tartalmát, és világszerte több mint 200 millió felhasználót ér el. Nemrégiben egy B2C verzió is elindult.",
  "try-here": "Próbáld ki itt",
  "lara-grande-desc": "<strong>Lara Grande:</strong> Kulcsszerep az LLM méretezésében, hogy megfeleljen a professzionális fordítók felső 1%-ának minőségének. Több mint 1000 GPU-t használtak a CINECA HPC-klaszterén a nagyszabású elosztott képzéshez.",
  "language-expansion-desc": "<strong>Nyelvi bővítés:</strong> Meghatározott és vezetett egy sikeres kutatási projektet, amelynek célja a gépi fordítási termelés lefedettségének 56-ról 201 nyelvre történő bővítése volt, ami 4-szeres növekedést jelent, és így ez az első olyan kereskedelmi gépi fordítóprogram, amely ilyen tartományt támogat. Javaslatot tettem az irányvonalra, megterveztem a megvalósítási tervet, és nyolc hónapon belül el is végeztem.",
  "instruction-mt-desc": "<strong>Utasításokat követő gépi fordítás:</strong> Kutatás vezetése, amely az SFT és a DPO segítségével igazítja az LLM-et a részletes stílusútmutatók követéséhez.",
  "trust-attention-desc": "<strong>Bizalmi figyelem:</strong> Javasolt és validált egy új technikát, amely a nagy értékű képzési adatokat helyezi előtérbe, és ezzel öt év alatt a gépi fordítás minőségének legjelentősebb javulását érte el.",
  "polyglot-desc": "<strong>Polyglot:</strong> 201 nyelvet támogató nyelvazonosítási modellt fejlesztett ki.",
  "startup-title": "Induló vállalkozások tapasztalatai",
  "startup-role": "Társalapító és AI mérnök",
  "italy": "Olaszország",
  "startup-desc1": "Társalapítója egy háromfős alapító csapatnak, amely képes geolokalizációs platformot épített",
  "startup-desc2": "Kifejlesztette a kép geolokalizálásának alapmodelljét látásátalakítók és visszakeresésen alapuló technikák segítségével",
  "startup-desc3": "Értékes tapasztalatokat szereztem a gyors tempójú startup környezetben és a termékfejlesztésben",
  "startup-desc4": "Kulcsfontosságú tanulságok a csapatdinamikáról, a bizonytalanságkezelésről és a gyors iterációról",
  "education-title": "Oktatás",
  "masters-full": "M.S. mesterséges intelligencia és adattechnika",
  "university-location": "Pisai Egyetem, Pisa, Olaszország",
  "masters-description": "110/110 summa cum laude (4,0 GPA). Szakterületek: adatbányászat, gépi tanulás, számítógépes látás, természetesnyelv-feldolgozás, optimalizálási elmélet és folyamatbányászat. Gyakorlati tapasztalatot szereztem az elosztott rendszerek, a felhőalapú számítástechnika és olyan eszközök terén, mint a MongoDB, a Neo4j, a Docker, a Kubernetes, a TensorFlow és a PyTorch.",
  "bachelors-full": "Számítástechnikai alapképzés",
  "bachelors-description": "110/110 (4,0 GPA). Szilárd alapok a számítástechnikában, beleértve a matematikát, fizikát, algoritmusokat, adatbázisokat, számítógépes architektúrát, számítógépes hálózatokat, operációs rendszereket és a C, C++, Java, Python, Matlab, SQL, JavaScript és PHP programozást.",
  "portfolio-title": "Portfólió",
  "portfolio-description": "MI- és gépi tanulási projektjeim gyűjteménye, az akadémiai kutatástól a világszerte több millió felhasználót kiszolgáló termelési rendszerekig.",
  "t4sa-desc": "Keresztmodális vizuális érzelem elemző rendszer, amely a szövegből a látásmodellekbe történő tudáslepárlást használja. Az ECAI 2023-on publikálták, és a legmodernebb eredményeket érte el a vizuális érzelmek előrejelzésében.",
  "numpygpt-desc": "Egy teljesen új GPT, amely NumPy és Python szabványkönyvtárával készült. Nincs autograd, nincsenek keretrendszerek: minden réteg saját előre- és visszafelé irányuló átvitellel kerül újraimplementálásra. A gradiensszámítások kézzel történnek, a frissítések átláthatóak, és minden műveletet részletesen kifejtünk.",
  "fake-news-desc": "Multimodális AI-rendszer a félretájékoztatás észlelésére transzformátor architektúrák segítségével. Tartalmazza a vélemény elemzését és a forrás hitelességének pontozását.",
  "unimusic-desc": "Skálázható zene-felfedezési platform hibrid MongoDB/Neo4j architektúrával. Valós idejű ajánlási algoritmusokkal kezeli a számok millióit.",
  "voice-vibes-desc": "Beszédhangfelismerő rendszer hat új AI-architektúrával. 94%-os pontosságot ért el együttes módszerek és fejlett jellemzőtervezés alkalmazásával.",
  "federated-dbscan-desc": "Adatvédelmi szempontokat figyelembe vevő elosztott klaszterelés egyesített tanulással. Lehetővé teszi az együttműködő gépi tanulást adatmegosztás nélkül, 99%-os adatvédelem mellett.",
  "pagerank-desc": "Nagy teljesítményű PageRank algoritmus implementálása optimalizált ritka mátrix műveletekkel. Hatékonyan kezeli a több millió csomóponttal rendelkező grafikonokat.",
  "contact-title": "Kapcsolat",
  "contact-description": "Lépjünk kapcsolatba! Akár az AI-ról, a gépi tanulásról vagy a lehetséges együttműködésekről szeretnél beszélni, mindig nyitott vagyok az érdekes beszélgetésekre.",
  "location-label": "Helyszín:",
  "location": "Róma, Olaszország",
  "form-name": "Név",
  "form-email": "E-mail cím",
  "form-subject": "Tárgy",
  "form-message": "Üzenet",
  "form-loading": "Betöltés",
  "form-success": "Üzenetét elküldtük. Köszönjük!",
  "form-send": "Üzenet küldése"
}