{
  "nav-home": "Beranda",
  "nav-about": "Tentang",
  "nav-tech": "Tumpukan Teknologi",
  "nav-resume": "Riwayat Hidup",
  "nav-portfolio": "Portofolio",
  "nav-contact": "Kontak",
  "language-label": "Bahasa",
  "language-selector-header": "Pilih bahasa ({count} tersedia)",
  "hero-subtitle": "Membuat AI berbicara dalam bahasa Anda, satu model pada satu waktu",
  "multilingual-typed": [
    "I train LLMs to speak your language.",
    "我训练大型语言模型来讲你的语言。",
    "Entreno LLMs para hablar tu idioma.",
    "Ich trainiere LLMs, damit sie deine Sprache sprechen.",
    "J'entraîne des LLM pour qu'ils parlent votre langue.",
    "あなたの言語を话せるように、LLMを訓練しています。",
    "Treino LLMs para falar o seu idioma.",
    "أقوم بتدريب LLM لتتحدث لغتك.",
    "Alleno LLM per parlare la tua lingua.",
    "Я обучаю LLM говорить на вашем языке."
  ],
  "about-title": "Tentang Saya di O(1)",
  "about-description": "Saya seorang peneliti dan insinyur AI yang berfokus pada model bahasa multibahasa yang besar.",
  "about-role": "Insinyur & Peneliti AI",
  "about-intro": "Di Translated, saya membantu membangun Lara sejak hari pertama, LLM terjemahan mesin yang mendukung konten secara real-time untuk Airbnb, Uber, Shopify, dan lainnya, menjangkau lebih dari 200 juta pengguna.",
  "birth-place-label": "Tempat Lahir:",
  "birth-place": "Napoli, Italia",
  "email-label": "Email:",
  "city-label": "Kota:",
  "city": "Roma, Italia",
  "masters-label": "Gelar Magister:",
  "masters-degree": "AI & Teknik Data",
  "bachelors-label": "Gelar Sarjana:",
  "bachelors-degree": "Teknik Komputer",
  "university-label": "Universitas:",
  "university": "Universitas Pisa",
  "languages-label": "Bahasa:",
  "languages": "Italia, Inggris",
  "focus-label": "Fokus:",
  "focus": "LLM multibahasa",
  "about-conclusion": "Saya telah meningkatkan pelatihan menjadi 1.000+ GPU dan memperluas cakupan terjemahan mesin menjadi 201 bahasa. Saya ikut mendirikan <a href=\"https://picarta.ai/\" target=\"_blank\" style=\"color: var(--accent-primary); text-decoration: none; font-weight: 600;\">Picarta.ai</a>, sebuah startup AI yang membangun platform untuk geolokasi gambar.. Saya adalah pembelajar yang rakus yang terus berusaha meningkatkan cara saya berpikir, berlatih, dan membangun. Saya tidak bisa membayangkan hidup tanpa pelatihan dalam bentuk apa pun, baik itu GPU, piring gym, atau persiapan maraton.",
  "tech-title": "Teknologi & Alat",
  "tech-pytorch": "Pembelajaran Mendalam",
  "tech-python": "Bahasa Utama",
  "tech-slurm": "Penjadwalan Pekerjaan HPC",
  "tech-vllm": "Penyajian LLM Berkinerja Tinggi",
  "tech-transformers": "LLM & NLP",
  "tech-mongodb": "Penyimpanan Data",
  "tech-docker": "Kontainerisasi",
  "tech-git": "Kontrol Versi",
  "focus-title": "Fokus Saat Ini",
  "focus-description": "Yang sedang saya bangun dan teliti sekarang",
  "focus-scaling-title": "Menskalakan terjemahan mesin ke 201 Bahasa",
  "focus-scaling-desc": "Memperluas cakupan terjemahan mesin sekaligus mempertahankan kualitas. Bekerja dengan kumpulan data multibahasa yang sangat besar dan mengoptimalkan bahasa dengan sumber daya rendah menggunakan teknik pembelajaran transfer canggih.",
  "focus-production-title": "AI Multibahasa dalam Produksi",
  "focus-production-desc": "Membangun sistem terjemahan yang kuat yang menangani kompleksitas dunia nyata dalam skala besar. Mengatasi tantangan seperti pengalihan kode, adaptasi domain, konten yang dihasilkan pengguna yang berisik, dan menjaga kualitas untuk lebih dari 200 juta pengguna harian.",
  "tag-realtime": "Penyajian Real-time",
  "tag-quality": "Jaminan Mutu",
  "tag-data": "Data",
  "resume-title": "Riwayat Hidup",
  "resume-description": "Insinyur dan Peneliti AI dengan pengalaman yang luas dalam membangun dan meningkatkan sistem terjemahan mesin multibahasa. Rekam jejak yang terbukti dalam melayani lebih dari 200 juta pengguna melalui solusi LLM yang inovatif.",
  "experience-title": "Pengalaman Profesional",
  "current-role": "Insinyur & Peneliti AI",
  "current-company": "Translated, Roma, Italia",
  "lara-desc": "<strong>Lara:</strong> Bekerja pada seluruh proses riset dan pengembangan LLM yang dioptimalkan untuk terjemahan mesin: mulai dari pengumpulan data dan pelatihan model hingga optimasi keselarasan dan inferensi. Dibangun dari awal dalam tim gaya startup yang terdiri dari empat orang yang beroperasi di dalam perusahaan. Sekarang produk unggulan B2B ini menerjemahkan semua konten di seluruh dunia untuk Airbnb dan sebagian besar dari Uber, Shopify, Nike, dan lainnya, menjangkau lebih dari 200 JUTA pengguna di seluruh dunia. Versi B2C juga baru-baru ini diluncurkan.",
  "try-here": "Coba di sini",
  "lara-grande-desc": "<strong>Lara Grande:</strong> Peran penting dalam meningkatkan LLM agar sesuai dengan kualitas 1% penerjemah profesional terbaik. Menggunakan lebih dari 1.000 GPU pada klaster HPC CINECA untuk pelatihan terdistribusi skala besar.",
  "language-expansion-desc": "<strong>Ekspansi Bahasa:</strong> Mengidentifikasi dan memimpin proyek penelitian yang sukses untuk memperluas cakupan produksi terjemahan mesin dari 56 menjadi 201 bahasa, meningkat 4×, menjadikannya mesin terjemahan mesin komersial pertama yang mendukung rentang tersebut. Mengusulkan arah, merancang rencana implementasi, dan membawanya hingga selesai dalam waktu delapan bulan.",
  "instruction-mt-desc": "<strong>Terjemahan mesin yang mengikuti instruksi:</strong> Memimpin penelitian yang menyelaraskan LLM untuk mengikuti panduan gaya terperinci menggunakan SFT dan DPO.",
  "trust-attention-desc": "<strong>Perhatian Kepercayaan:</strong> Mengusulkan dan memvalidasi teknik baru yang memprioritaskan data pelatihan bernilai tinggi, mencapai peningkatan kualitas terjemahan mesin paling signifikan dalam lima tahun.",
  "polyglot-desc": "<strong>Polyglot:</strong> Mengembangkan model Identifikasi Bahasa yang mendukung 201 bahasa.",
  "startup-title": "Pengalaman Startup",
  "startup-role": "Salah Satu Pendiri & Insinyur AI",
  "italy": "Italia",
  "startup-desc1": "Mendiri startup AI sebagai bagian dari tim pendiri tiga orang yang membangun platform geolokasi gambar",
  "startup-desc2": "Mengembangkan model inti untuk geolokasi gambar menggunakan transformasi penglihatan dan teknik berbasis pengambilan",
  "startup-desc3": "Memperoleh pengalaman berharga dalam lingkungan startup yang serba cepat dan pengembangan produk",
  "startup-desc4": "Mempelajari pelajaran penting tentang dinamika tim, manajemen ketidakpastian, dan iterasi cepat",
  "education-title": "Pendidikan",
  "masters-full": "M.S. Kecerdasan Buatan & Rekayasa Data",
  "university-location": "Universitas Pisa, Pisa, Italia",
  "masters-description": "110/110 summa cum laude (4,0 GPA). Spesialisasi dalam Penambangan Data, Pembelajaran Mesin, Visi Komputer, Pemrosesan Bahasa Alami, Teori Optimalisasi, dan Penambangan Proses. Memperoleh pengalaman langsung dengan Sistem Terdistribusi, Komputasi Awan, dan alat seperti MongoDB, Neo4j, Docker, Kubernetes, TensorFlow, dan PyTorch.",
  "bachelors-full": "Sarjana Teknik Komputer",
  "bachelors-description": "110/110 (4,0 GPA). Landasan yang kuat dalam teknik komputer termasuk matematika, fisika, algoritma, basis data, arsitektur komputer, jaringan komputer, sistem operasi, dan pemrograman dalam C, C++, Java, Python, Matlab, SQL, JavaScript, dan PHP.",
  "portfolio-title": "Portofolio",
  "portfolio-description": "Kumpulan proyek AI dan pembelajaran mesin saya, mulai dari penelitian akademis hingga sistem produksi yang melayani jutaan pengguna di seluruh dunia.",
  "t4sa-desc": "Sistem analisis sentimen visual lintas modal menggunakan penyulingan pengetahuan dari teks ke model penglihatan. Diterbitkan di ECAI 2023, mencapai hasil yang canggih pada prediksi sentimen visual.",
  "numpygpt-desc": "GPT dari awal yang dibuat dengan NumPy dan pustaka standar Python. Tidak ada autograd, tidak ada kerangka kerja: setiap lapisan diimplementasikan ulang dengan forward dan backward pass-nya sendiri. Gradien dihitung secara manual, pembaruan transparan, dan setiap operasi dieja.",
  "fake-news-desc": "Sistem AI multi-modal untuk deteksi informasi yang keliru menggunakan arsitektur transformer. Menampilkan analisis sikap dan penilaian kredibilitas sumber.",
  "unimusic-desc": "Platform penemuan musik yang terukur dengan arsitektur MongoDB/Neo4j hibrida. Menangani jutaan trek dengan algoritme rekomendasi real-time.",
  "voice-vibes-desc": "Sistem pengenalan emosi ucapan dengan enam arsitektur AI baru. Mencapai akurasi 94% menggunakan metode ansambel dan rekayasa fitur canggih.",
  "federated-dbscan-desc": "Pengelompokan terdistribusi yang menjaga privasi dengan pembelajaran gabungan. Memungkinkan ML kolaboratif tanpa berbagi data, mencapai 99% pelestarian privasi.",
  "pagerank-desc": "Implementasi algoritma PageRank berkinerja tinggi dengan operasi matriks jarang yang dioptimalkan. Menangani grafik dengan jutaan node secara efisien.",
  "contact-title": "Kontak",
  "contact-description": "Mari kita terhubung! Baik Anda ingin membahas AI, pembelajaran mesin, atau potensi kolaborasi, saya selalu terbuka untuk percakapan yang menarik.",
  "location-label": "Lokasi:",
  "location": "Roma, Italia",
  "form-name": "Nama Anda",
  "form-email": "Email Anda",
  "form-subject": "Subjek",
  "form-message": "Pesan",
  "form-loading": "Memuat",
  "form-success": "Pesan Anda telah terkirim. Terima kasih!",
  "form-send": "Kirim Pesan"
}