{
  "nav-home": "Home",
  "nav-about": "Chi sono",
  "nav-tech": "Stack tecnologico",
  "nav-resume": "Curriculum",
  "nav-portfolio": "Portfolio",
  "nav-contact": "Contatti",
  "language-label": "Lingua",
  "language-selector-header": "Seleziona la lingua ({count} disponibili)",
  "hero-subtitle": "Fare in modo che l'IA parli la tua lingua, un modello alla volta",
  "multilingual-typed": [
    "I train LLMs to speak your language.",
    "我训练大型语言模型来讲你的语言。",
    "Entreno LLMs para hablar tu idioma.",
    "Ich trainiere LLMs, damit sie deine Sprache sprechen.",
    "J'entraîne des LLM pour qu'ils parlent votre langue.",
    "あなたの言語を话せるように、LLMを訓練しています。",
    "Treino LLMs para falar o seu idioma.",
    "أقوم بتدريب LLM لتتحدث لغتك.",
    "Alleno LLM per parlare la tua lingua.",
    "Я обучаю LLM говорить на вашем языке."
  ],
  "about-title": "Chi sono in O(1)",
  "about-description": "Sono un ricercatore e ingegnere di intelligenza artificiale specializzato in modelli linguistici multilingue di grandi dimensioni.",
  "about-role": "Ingegnere e ricercatore in intelligenza artificiale",
  "about-intro": "In Translated, ho contribuito a costruire da zero Lara, un LLM di traduzione automatica che alimenta i contenuti per Airbnb, Uber, Shopify e altri, raggiungendo oltre 200 milioni di utenti.",
  "birth-place-label": "Luogo di nascita:",
  "birth-place": "Napoli, Italia",
  "email-label": "Email:",
  "city-label": "Città:",
  "city": "Roma, Italia",
  "masters-label": "Laurea magistrale:",
  "masters-degree": "Ingegneria dei dati e dell'IA",
  "bachelors-label": "Laurea triennale:",
  "bachelors-degree": "Ingegneria informatica",
  "university-label": "Università:",
  "university": "Università di Pisa",
  "languages-label": "Lingue:",
  "languages": "Italiano, inglese",
  "focus-label": "Focus:",
  "focus": "LLM multilingue",
  "about-conclusion": "Ho scalato l'addestramento a oltre 1.000 GPU e ampliato la copertura della traduzione automatica a 201 lingue. Ho co-fondato <a href=\"https://picarta.ai/\" target=\"_blank\" style=\"color: var(--accent-primary); text-decoration: none; font-weight: 600;\">Picarta.ai</a>, una startup di intelligenza artificiale che costruisce una piattaforma di geolocalizzazione delle immagini. Sono un apprendista vorace che cerca costantemente di migliorare il modo in cui penso, mi alleno e costruisco. Non riesco a immaginare una vita senza una qualche forma di allenamento, che si tratti di GPU, pesi in palestra o preparazione per una maratona.",
  "tech-title": "Tecnologie e strumenti",
  "focus-title": "Focus attuale",
  "focus-description": "Cosa sto costruendo e ricercando in questo momento",
  "focus-scaling-title": "Scalare la traduzione automatica a 201 lingue",
  "focus-scaling-desc": "Ampliare la copertura della traduzione automatica mantenendo la qualità. Lavorare con enormi set di dati multilingue e ottimizzare per le lingue a bassa disponibilità di risorse utilizzando tecniche avanzate di apprendimento per trasferimento.",
  "focus-production-title": "IA multilingue in produzione",
  "focus-production-desc": "Costruire sistemi di traduzione robusti in grado di gestire la complessità del mondo reale su larga scala. Affrontare sfide come il code-switching, l'adattamento del dominio, i contenuti rumorosi generati dagli utenti e il mantenimento della qualità per oltre 200 milioni di utenti giornalieri.",
  "tag-realtime": "Servizio in tempo reale",
  "tag-quality": "Garanzia di qualità",
  "resume-title": "Curriculum",
  "resume-description": "Ingegnere e ricercatore di intelligenza artificiale con vasta esperienza nella costruzione e scalabilità di sistemi di traduzione automatica multilingue. Comprovata esperienza nel servire oltre 200 milioni di utenti attraverso soluzioni LLM innovative.",
  "experience-title": "Esperienza professionale",
  "current-role": "Ingegnere e ricercatore in intelligenza artificiale",
  "current-company": "Translated, Roma, Italia",
  "lara-desc": "<strong>Lara:</strong> ha lavorato sull'intera pipeline di ricerca e sviluppo di un LLM ottimizzato per la traduzione automatica: dalla raccolta dei dati e dall'addestramento dei modelli all'ottimizzazione dell'allineamento e dell'inferenza. Costruito da zero all'interno di un team di quattro persone in stile startup che opera all'interno dell'azienda. Ora il prodotto di punta B2B traduce tutti i contenuti in tutto il mondo per Airbnb e la maggior parte di Uber, Shopify, Nike e altri, raggiungendo oltre 200 milioni di utenti a livello globale. Recentemente è stata lanciata anche una versione B2C.",
  "try-here": "Provalo qui",
  "lara-grande-desc": "<strong>Lara Grande:</strong> ruolo chiave nella scalabilità di LLM per eguagliare la qualità dell'1% dei migliori traduttori professionisti. Ha utilizzato oltre 1.000 GPU sul cluster HPC di CINECA per la formazione distribuita su larga scala.",
  "language-expansion-desc": "<strong>Espansione linguistica:</strong> ho identificato e guidato un progetto di ricerca di successo per espandere la copertura della produzione di traduzione automatica da 56 a 201 lingue, un aumento di 4 volte, rendendolo il primo motore di traduzione automatica commerciale a supportare una tale gamma. Ho proposto la direzione, progettato il piano di implementazione e portato a termine il progetto in otto mesi.",
  "instruction-mt-desc": "<strong>Traduzione automatica che segue le istruzioni:</strong> ha condotto una ricerca per allineare LLM a seguire guide di stile dettagliate utilizzando SFT e DPO.",
  "trust-attention-desc": "<strong>Attenzione alla fiducia:</strong> ho proposto e convalidato una nuova tecnica che dà priorità ai dati di addestramento di alto valore, ottenendo i miglioramenti più significativi della qualità della traduzione automatica in cinque anni.",
  "polyglot-desc": "<strong>Polyglot:</strong> ha sviluppato un modello di identificazione della lingua che supporta 201 lingue.",
  "startup-title": "Esperienza in startup",
  "startup-role": "Co-fondatore e ingegnere in intelligenza artificiale",
  "italy": "Italia",
  "startup-desc1": "Ho co-fondato una startup di intelligenza artificiale come parte di un team di fondazione di tre persone per la creazione di una piattaforma di geolocalizzazione delle immagini",
  "startup-desc2": "Sviluppato il modello di base per la geolocalizzazione delle immagini utilizzando trasformatori di visione e tecniche basate sul recupero",
  "startup-desc3": "Ho acquisito una preziosa esperienza in un ambiente di startup dinamico e nello sviluppo di prodotti",
  "startup-desc4": "Ha appreso lezioni cruciali sulla dinamica del team, sulla gestione dell'incertezza e sull'iterazione rapida",
  "education-title": "Istruzione",
  "masters-full": "Master in Intelligenza Artificiale e Ingegneria dei Dati",
  "university-location": "Università di Pisa, Pisa, Italia",
  "masters-description": "110/110 e lode (4.0 GPA). Specializzato in data mining, machine learning, computer vision, elaborazione del linguaggio naturale, teoria dell'ottimizzazione e process mining. Ho acquisito esperienza pratica con sistemi distribuiti, cloud computing e strumenti come MongoDB, Neo4j, Docker, Kubernetes, TensorFlow e PyTorch.",
  "bachelors-full": "Laurea in Ingegneria Informatica",
  "bachelors-description": "110/110 (4.0 GPA). Solide basi in ingegneria informatica, tra cui matematica, fisica, algoritmi, database, architettura informatica, reti informatiche, sistemi operativi e programmazione in C, C++, Java, Python, Matlab, SQL, JavaScript e PHP.",
  "portfolio-title": "Portfolio",
  "portfolio-description": "Una raccolta dei miei progetti di intelligenza artificiale e machine learning, dalla ricerca accademica ai sistemi di produzione che servono milioni di utenti in tutto il mondo.",
  "t4sa-desc": "Sistema di analisi del sentiment visivo cross-modale che utilizza la distillazione della conoscenza da modelli di testo a visione. Pubblicato all'ECAI 2023, ottenendo risultati all'avanguardia sulla previsione del sentiment visivo.",
  "numpygpt-desc": "Un GPT da zero costruito con NumPy e la libreria standard di Python. Nessun autograd, nessun framework: ogni livello viene reimplementato con il proprio passaggio in avanti e indietro. I gradienti vengono calcolati manualmente, gli aggiornamenti sono trasparenti e ogni operazione è spiegata.",
  "fake-news-desc": "Sistema di intelligenza artificiale multimodale per il rilevamento della disinformazione utilizzando architetture di trasformatori. Include l'analisi della posizione e il punteggio di credibilità della fonte.",
  "unimusic-desc": "Piattaforma scalabile per la scoperta musicale con architettura ibrida MongoDB/Neo4j. Gestisce milioni di brani con algoritmi di raccomandazione in tempo reale.",
  "voice-vibes-desc": "Sistema di riconoscimento delle emozioni vocali con sei nuove architetture di intelligenza artificiale. Ha raggiunto il 94% di precisione utilizzando metodi di ensemble e ingegneria avanzata delle caratteristiche.",
  "federated-dbscan-desc": "Clustering distribuito che preserva la privacy con apprendimento federato. Consente il ML collaborativo senza condivisione dei dati, ottenendo il 99% di tutela della privacy.",
  "pagerank-desc": "Implementazione dell'algoritmo PageRank ad alte prestazioni con operazioni di matrice sparse ottimizzate. Gestisce in modo efficiente grafici con milioni di nodi.",
  "contact-title": "Contatti",
  "contact-description": "Entriamo in contatto! Che tu voglia discutere di intelligenza artificiale, apprendimento automatico o potenziali collaborazioni, sono sempre aperto a conversazioni interessanti.",
  "location-label": "Luogo:",
  "location": "Roma, Italia",
  "form-name": "Il tuo nome",
  "form-email": "La tua email",
  "form-subject": "Oggetto",
  "form-message": "Messaggio",
  "form-loading": "Caricamento in corso",
  "form-success": "Il tuo messaggio è stato inviato. Grazie!",
  "form-send": "Invia messaggio",
  "tech-pytorch": "Deep Learning",
  "tech-python": "Linguaggio principale",
  "tech-slurm": "Pianificazione dei lavori HPC",
  "tech-vllm": "Servizio LLM ad alte prestazioni",
  "tech-transformers": "LLM e NLP",
  "tech-mongodb": "Archiviazione dei dati",
  "tech-docker": "Containerizzazione",
  "tech-git": "Controllo versione",
  "tag-data": "Dati"
}