{
  "nav-home": "Home",
  "nav-about": "Chi Sono",
  "nav-tech": "Tecnologie",
  "nav-resume": "CV",
  "nav-portfolio": "Portfolio",
  "nav-contact": "Contatti",
  "language-label": "Lingua",
  
  "hero-subtitle": "Rendendo l'AI capace di parlare la tua lingua, un modello alla volta",
  "hero-typed": ["un Ricercatore AI", "un Ingegnere", "un Creatore"],
  
  "about-title": "Chi sono in O(1)",
  "about-description": "Sono un ricercatore e ingegnere AI specializzato in modelli linguistici multilingue, rendendo gli LLM capaci di parlare la tua lingua.",
  "about-role": "Ingegnere AI e Ricercatore",
  "about-intro": "In Translated, ho contribuito a far nascere Lara, un LLM per la traduzione automatica che localizza i contenuti per Airbnb, Uber, Shopify e altri, raggiungendo oltre 200 milioni di utenti.",
  "birth-place-label": "Luogo di Nascita:",
  "birth-place": "Napoli, Italia",
  "email-label": "Email:",
  "city-label": "Città:",
  "city": "Roma, Italia",
  "masters-label": "Laurea Magistrale:",
  "masters-degree": "AI & Data Engineering",
  "bachelors-label": "Laurea Triennale:",
  "bachelors-degree": "Ingegneria Informatica",
  "university-label": "Università:",
  "university": "Università di Pisa",
  "languages-label": "Lingue:",
  "languages": "Italiano, Inglese",
  "focus-label": "Focus:",
  "focus": "LLM Multilingue",
  "about-conclusion": "Mi sono formato in training distribuiti su larga scala, utilizzando fino a 1.000+ GPU ed ho espanso la copertura linguistica del motore di traduzione a 201 lingue. Lavorando di sera e nei weekend, ho co-fondato una startup AI che costruisce una piattaforma di geolocalizzazione di immagini. Sono uno studente vorace che spinge costantemente per migliorare come penso, addestro e costruisco. Non riesco a immaginare una vita senza qualche forma di allenamento, che si tratti di GPU, pesi in palestra o preparazione per maratone.",
  
  "tech-title": "Tecnologie e Strumenti 🛠️",
  
  "focus-title": "Focus Attuale 🎯",
  "focus-description": "Su cosa sto lavorando e ricercando in questo momento",
  "focus-scaling-title": "Scalare MT a 201 Lingue",
  "focus-scaling-desc": "Espandere la copertura della traduzione automatica mantenendo la qualità. Lavorando con enormi dataset multilingue e ottimizzando per lingue a basse risorse usando tecniche avanzate di transfer learning.",
  "focus-production-title": "AI Multilingue in Produzione",
  "focus-production-desc": "Costruire sistemi di traduzione robusti che gestiscono la complessità del mondo reale su larga scala. Affrontare sfide come code-switching, adattamento del dominio e mantenimento della qualità per oltre 200 milioni di utenti giornalieri.",
  "tag-realtime": "Serving Real-time",
  "tag-quality": "Controllo Qualità",
  
  "resume-title": "Curriculum",
  "resume-description": "Ingegnere AI e Ricercatore con vasta esperienza nella costruzione e scalabilità di sistemi di traduzione automatica multilingue. Comprovato track record nel servire 200+ milioni di utenti attraverso soluzioni LLM innovative.",
  "education-title": "Formazione",
  "masters-full": "Laurea Magistrale in Intelligenza Artificiale e Data Engineering",
  "university-location": "Università di Pisa, Pisa, Italia",
  "masters-description": "110/110 e lode (4.0 GPA). Specializzato in Data Mining, Machine Learning, Computer Vision, Natural Language Processing, Teoria dell'Ottimizzazione e Process Mining. Esperienza pratica con Sistemi Distribuiti, Cloud Computing e strumenti come MongoDB, Neo4j, Docker, Kubernetes, TensorFlow e PyTorch.",
  "bachelors-full": "Laurea Triennale in Ingegneria Informatica",
  "bachelors-description": "110/110 (4.0 GPA). Solida base in ingegneria informatica inclusi matematica, fisica, algoritmi, database, architettura dei computer, reti informatiche, sistemi operativi e programmazione in C, C++, Java, Python, Matlab, SQL, JavaScript e PHP.",
  "experience-title": "Esperienza Professionale",
  "current-role": "Ingegnere AI e Ricercatore",
  "current-company": "Translated, Roma, Italia",
  "lara-desc": "<strong>Lara:</strong> Ho lavorato sull'intera pipeline R&D di un LLM ottimizzato per MT: dalla raccolta dati e addestramento del modello all'allineamento e ottimizzazione dell'inferenza. Costruito da zero all'interno di un team stile startup di quattro persone operante nell'azienda. Ora è il prodotto B2B di punta, traduce tutti i contenuti a livello mondiale per Airbnb e la maggior parte di Uber, Shopify, Nike e altri, raggiungendo oltre 200M di utenti globalmente. È stata lanciata di recente anche una versione B2C.",
  "lara-grande-desc": "<strong>Lara Grande:</strong> Ruolo chiave nel scalare LLM per eguagliare la qualità dell'1% migliore dei traduttori professionali. Utilizzato oltre 1.000 GPU sul cluster HPC di CINECA per addestramento distribuito su larga scala.",
  "language-expansion-desc": "<strong>Espansione Linguaggi:</strong> Identificato e guidato un progetto di ricerca di successo per espandere la copertura della traduzione automatica in produzione da 56 a 201 lingue, un aumento di 4×, rendendolo il primo motore MT commerciale a supportare tale gamma. Proposto la direzione, progettato il piano di implementazione e guidato al completamento entro otto mesi.",
  "instruction-mt-desc": "<strong>MT seguendo Istruzioni:</strong> Guidato ricerca nell'allineare LLM per seguire guide di stile dettagliate usando SFT e DPO.",
  "trust-attention-desc": "<strong>Trust Attention:</strong> Proposto e validato una tecnica innovativa che priorizza dati di addestramento ad alto valore, ottenendo i miglioramenti di qualità MT più significativi in cinque anni.",
  "polyglot-desc": "<strong>Polyglot:</strong> Sviluppato un modello di Identificazione Linguistica che supporta 201 lingue.",
  "startup-role": "Co-Fondatore e Ingegnere AI",
  "italy": "Italia",
  "startup-desc1": "Co-fondato startup AI come parte del team fondatore di tre persone costruendo piattaforma di geolocalizzazione di immagini",
  "startup-desc2": "Sviluppato il modello core per la geolocalizzazione di immagini usando vision transformer e tecniche basate su retrieval",
  "startup-desc3": "Acquisito esperienza preziosa in ambiente startup veloce e sviluppo prodotti",
  "startup-desc4": "Appreso lezioni cruciali su dinamiche di team, gestione dell'incertezza e iterazione rapida",
  "try-here": "Provalo qui",
  
  "portfolio-title": "Portfolio 🚀",
  "portfolio-description": "Una raccolta dei miei progetti AI e machine learning, dalla ricerca accademica ai sistemi di produzione che servono milioni di utenti in tutto il mondo.",
  "t4sa-desc": "Sistema di analisi del sentiment visuale cross-modale che utilizza distillazione di conoscenza da modelli di testo a visione. Pubblicato a ECAI 2023, raggiungendo risultati state-of-the-art nella predizione del sentiment visuale.",
  "numpygpt-desc": "Un GPT costruito da zero con NumPy e la libreria standard di Python. Nessun autograd, nessun framework: ogni layer è re-implementato con il proprio forward e backward pass. I gradienti sono calcolati manualmente, gli aggiornamenti sono trasparenti, e ogni operazione è specificata.",
  "fake-news-desc": "Sistema AI multi-modale per la rilevazione di disinformazione utilizzando architetture transformer. Include analisi di stance e scoring di credibilità delle fonti.",
  "unimusic-desc": "Piattaforma scalabile per la scoperta musicale con architettura ibrida MongoDB/Neo4j. Gestisce milioni di tracce con algoritmi di raccomandazione in tempo reale.",
  "voice-vibes-desc": "Sistema di riconoscimento delle emozioni vocali con sei architetture AI innovative. Ha raggiunto il 94% di accuratezza utilizzando metodi ensemble e feature engineering avanzata.",
  "federated-dbscan-desc": "Clustering distribuito privacy-preserving con federated learning. Abilita ML collaborativo senza condivisione di dati, raggiungendo il 99% di preservazione della privacy.",
  "pagerank-desc": "Implementazione ad alte prestazioni dell'algoritmo PageRank con operazioni ottimizzate su matrici sparse. Gestisce grafi con milioni di nodi in modo efficiente.",
  
  "cta-title": "Costruiamo Insieme il Futuro dell'AI",
  "cta-description": "Che tu stia cercando di collaborare su ricerca all'avanguardia, discutere degli ultimi sviluppi negli LLM multilingue, o esplorare come l'AI può trasformare il tuo business, sono sempre entusiasta di connettermi con innovatori e problem solver.",
  "cta-button1": "Inizia una Conversazione",
  "cta-button2": "Invia Email Diretta",
  
  "contact-title": "Contatti",
  "contact-description": "Mettiamoci in contatto! Che tu voglia discutere di AI, machine learning, o potenziali collaborazioni, sono sempre aperto a conversazioni interessanti.",
  "location-label": "Posizione",
  "location": "Roma, Italia",
  "form-name": "Il Tuo Nome",
  "form-email": "La Tua Email",
  "form-subject": "Oggetto",
  "form-message": "Messaggio",
  "form-loading": "Caricamento",
  "form-success": "Il tuo messaggio è stato inviato. Grazie!",
  "form-send": "Invia Messaggio"
} 