{
  "nav-home": "Laman Utama",
  "nav-about": "Tentang",
  "nav-tech": "Teknologi",
  "nav-resume": "Resume",
  "nav-portfolio": "Portfolio",
  "nav-contact": "Hubungi",
  "language-label": "Bahasa",
  "language-selector-header": "Pilih bahasa ({count} tersedia)",
  "hero-subtitle": "Membuat AI bercakap dalam bahasa anda, satu model pada satu masa",
  "multilingual-typed": [
    "I train LLMs to speak your language.",
    "我训练大型语言模型来讲你的语言。",
    "Entreno LLMs para hablar tu idioma.",
    "Ich trainiere LLMs, damit sie deine Sprache sprechen.",
    "J'entraîne des LLM pour qu'ils parlent votre langue.",
    "あなたの言語を话せるように、LLMを訓練しています。",
    "Treino LLMs para falar o seu idioma.",
    "أقوم بتدريب LLM لتتحدث لغتك.",
    "Alleno LLM per parlare la tua lingua.",
    "Я обучаю LLM говорить на вашем языке."
  ],
  "about-title": "Tentang Saya dalam O(1)",
  "about-description": "Saya seorang penyelidik dan jurutera AI yang memberi tumpuan kepada model bahasa besar berbilang bahasa.",
  "about-role": "Jurutera & Penyelidik AI",
  "about-intro": "Di Translated, saya membantu membina Lara dari hari pertama, LLM terjemahan mesin yang menggerakkan kandungan dalam masa nyata untuk Airbnb, Uber, Shopify dan lain-lain, mencapai lebih 200 juta pengguna.",
  "birth-place-label": "Tempat Lahir:",
  "birth-place": "Naples, Itali",
  "email-label": "E-mel:",
  "city-label": "Bandar:",
  "city": "Rom, Itali",
  "masters-label": "Ijazah Sarjana:",
  "masters-degree": "Kejuruteraan AI & Data",
  "bachelors-label": "Ijazah Sarjana Muda:",
  "bachelors-degree": "Kejuruteraan Komputer",
  "university-label": "Universiti:",
  "university": "Universiti Pisa",
  "languages-label": "Bahasa:",
  "languages": "Bahasa Itali, Bahasa Inggeris",
  "focus-label": "Tumpuan:",
  "focus": "LLM pelbagai bahasa",
  "about-conclusion": "Saya telah meningkatkan latihan kepada 1,000+ GPU dan memperluaskan liputan terjemahan mesin kepada 201 bahasa. Saya pengasas bersama <a href=\"https://picarta.ai/\" target=\"_blank\" style=\"color: var(--accent-primary); text-decoration: none; font-weight: 600;\">Picarta.ai</a>, sebuah syarikat pemula AI yang membina platform untuk geolokasi imej.. Saya seorang pelajar yang rakus yang sentiasa berusaha untuk meningkatkan cara saya berfikir, berlatih dan membina. Saya tidak dapat membayangkan kehidupan tanpa sebarang bentuk latihan, sama ada ia GPU, plat gimnasium, atau persediaan maraton.",
  "tech-title": "Teknologi & Alat",
  "tech-pytorch": "Pembelajaran Mendalam",
  "tech-python": "Bahasa Utama",
  "tech-slurm": "Penjadualan Kerja HPC",
  "tech-vllm": "Perkhidmatan LLM Berprestasi Tinggi",
  "tech-transformers": "LLM & NLP",
  "tech-mongodb": "Storan Data",
  "tech-docker": "Pengkontenaan",
  "tech-git": "Kawalan Versi",
  "focus-title": "Tumpuan Semasa",
  "focus-description": "Apa yang saya sedang bina dan selidik sekarang",
  "focus-scaling-title": "Menskalakan terjemahan mesin kepada 201 Bahasa",
  "focus-scaling-desc": "Memperluaskan liputan terjemahan mesin sambil mengekalkan kualiti. Bekerja dengan set data berbilang bahasa yang besar dan mengoptimumkan untuk bahasa sumber rendah menggunakan teknik pembelajaran pemindahan lanjutan.",
  "focus-production-title": "AI Berbilang Bahasa dalam Pengeluaran",
  "focus-production-desc": "Membina sistem terjemahan yang mantap yang mengendalikan kerumitan dunia sebenar pada skala besar. Menangani cabaran seperti pertukaran kod, penyesuaian domain, kandungan yang dihasilkan oleh pengguna yang bising dan mengekalkan kualiti merentasi lebih 200 juta pengguna harian.",
  "tag-realtime": "Penyediaan Masa Nyata",
  "tag-quality": "Jaminan Kualiti",
  "tag-data": "Data",
  "resume-title": "Resume",
  "resume-description": "Jurutera dan Penyelidik AI dengan pengalaman yang luas dalam membina dan meningkatkan sistem terjemahan mesin berbilang bahasa. Rekod prestasi yang terbukti dalam melayani lebih 200 juta pengguna melalui penyelesaian LLM yang inovatif.",
  "experience-title": "Pengalaman Profesional",
  "current-role": "Jurutera & Penyelidik AI",
  "current-company": "Translated, Rom, Itali",
  "lara-desc": "<strong>Lara:</strong> Bekerja pada saluran penyelidikan dan pembangunan penuh LLM yang dioptimumkan untuk terjemahan mesin: daripada pengumpulan data dan latihan model hingga penjajaran dan pengoptimuman inferens. Dibina dari awal dalam pasukan gaya permulaan yang terdiri daripada empat orang yang beroperasi dalam syarikat. Kini produk B2B utama ini menterjemahkan semua kandungan di seluruh dunia untuk Airbnb dan sebahagian besar kandungan Uber, Shopify, Nike dan banyak lagi, menjangkau lebih 200 JUTA pengguna di seluruh dunia. Versi B2C juga telah dilancarkan baru-baru ini.",
  "try-here": "Cubalah di sini",
  "lara-grande-desc": "<strong>Lara Grande:</strong> Peranan utama dalam meningkatkan LLM untuk menepati kualiti 1% penterjemah profesional terbaik. Menggunakan lebih 1,000 GPU pada kluster HPC CINECA untuk latihan teragih berskala besar.",
  "language-expansion-desc": "<strong>Pengembangan Bahasa:</strong> Mengenal pasti dan mengetuai projek penyelidikan yang berjaya untuk memperluaskan liputan pengeluaran terjemahan mesin daripada 56 kepada 201 bahasa, peningkatan 4×, menjadikannya enjin terjemahan mesin komersial pertama yang menyokong julat sedemikian. Mencadangkan hala tuju, merancang pelan pelaksanaan, dan membawanya ke tahap siap dalam masa lapan bulan.",
  "instruction-mt-desc": "<strong>Terjemahan mesin mengikut arahan:</strong> Mengetuai penyelidikan yang menyelaraskan LLM untuk mengikuti panduan gaya terperinci menggunakan SFT dan DPO.",
  "trust-attention-desc": "<strong>Perhatian Kepercayaan:</strong> Mencadangkan dan mengesahkan teknik baharu yang mengutamakan data latihan bernilai tinggi, mencapai penambahbaikan kualiti terjemahan mesin yang paling signifikan dalam lima tahun.",
  "polyglot-desc": "<strong>Polyglot:</strong> Membangunkan model Pengenalan Bahasa yang menyokong 201 bahasa.",
  "startup-title": "Pengalaman Permulaan",
  "startup-role": "Pengasas Bersama & Jurutera AI",
  "italy": "Itali",
  "startup-desc1": "Pengasas bersama syarikat pemula AI sebagai sebahagian daripada tiga orang ahli pengasas membina platform geolokalisasi imej",
  "startup-desc2": "Membangunkan model teras untuk geolokalisasi imej menggunakan transformasi penglihatan dan teknik berasaskan pengambilan",
  "startup-desc3": "Memperoleh pengalaman berharga dalam persekitaran permulaan dan pembangunan produk yang pantas",
  "startup-desc4": "Mempelajari pelajaran penting mengenai dinamik pasukan, pengurusan ketidakpastian, dan pengulangan pantas",
  "education-title": "Pendidikan",
  "masters-full": "M.S. Kecerdasan Buatan & Kejuruteraan Data",
  "university-location": "Universiti Pisa, Pisa, Itali",
  "masters-description": "110/110 summa cum laude (4.0 GPA). Khusus dalam Perlombongan Data, Pembelajaran Mesin, Penglihatan Komputer, Pemprosesan Bahasa Asli, Teori Pengoptimuman, dan Perlombongan Proses. Memperoleh pengalaman praktikal dengan Sistem Teragih, Pengkomputeran Awan, dan alat seperti MongoDB, Neo4j, Docker, Kubernetes, TensorFlow, dan PyTorch.",
  "bachelors-full": "B.S. Kejuruteraan Komputer",
  "bachelors-description": "110/110 (4.0 GPA). Asas yang kukuh dalam kejuruteraan komputer termasuk matematik, fizik, algoritma, pangkalan data, seni bina komputer, rangkaian komputer, sistem operasi, dan pengaturcaraan dalam C, C++, Java, Python, Matlab, SQL, JavaScript, dan PHP.",
  "portfolio-title": "Portfolio",
  "portfolio-description": "Koleksi projek AI dan pembelajaran mesin saya, daripada penyelidikan akademik hingga sistem pengeluaran yang melayani berjuta-juta pengguna di seluruh dunia.",
  "t4sa-desc": "Sistem analisis sentimen visual rentas modal menggunakan penyulingan pengetahuan daripada teks kepada model penglihatan. Diterbitkan di ECAI 2023, mencapai hasil terkini mengenai ramalan sentimen visual.",
  "numpygpt-desc": "GPT dari awal dibina dengan NumPy dan pustaka standard Python. Tiada autograd, tiada rangka kerja: setiap lapisan dilaksanakan semula dengan laluan ke hadapan dan ke belakangnya sendiri. Gradien dikira secara manual, kemas kini telus, dan setiap operasi dieja.",
  "fake-news-desc": "Sistem AI pelbagai mod untuk pengesanan maklumat salah menggunakan seni bina transformator. Menampilkan analisis pendirian dan pemarkahan kredibiliti sumber.",
  "unimusic-desc": "Platform penemuan muzik yang boleh diskalakan dengan seni bina hibrid MongoDB/Neo4j. Mengendalikan berjuta-juta trek dengan algoritma cadangan masa nyata.",
  "voice-vibes-desc": "Sistem pengecaman emosi pertuturan dengan enam seni bina AI baharu. Mencapai ketepatan 94% menggunakan kaedah ensembel dan kejuruteraan ciri lanjutan.",
  "federated-dbscan-desc": "Pengelompokan teragih yang mengekalkan privasi dengan pembelajaran bersekutu. Membolehkan ML kolaboratif tanpa perkongsian data, mencapai 99% pemeliharaan privasi.",
  "pagerank-desc": "Pelaksanaan algoritma PageRank berprestasi tinggi dengan operasi matriks jarang yang dioptimumkan. Mengendalikan graf dengan berjuta-juta nod dengan cekap.",
  "contact-title": "Hubungi",
  "contact-description": "Mari kita berhubung! Sama ada anda ingin membincangkan AI, pembelajaran mesin, atau kerjasama yang berpotensi, saya sentiasa terbuka untuk perbualan yang menarik.",
  "location-label": "Lokasi:",
  "location": "Rom, Itali",
  "form-name": "Nama Anda",
  "form-email": "E-mel Anda",
  "form-subject": "Subjek",
  "form-message": "Mesej",
  "form-loading": "Sedang memuat",
  "form-success": "Mesej anda telah dihantar. Terima kasih!",
  "form-send": "Hantar Mesej"
}