{
  "nav-home": "Hjem",
  "nav-about": "Om",
  "nav-tech": "Teknologisk stabel",
  "nav-resume": "CV",
  "nav-portfolio": "Portefølje",
  "nav-contact": "Kontakt",
  "language-label": "Språk",
  "language-selector-header": "Velg språk ({count} tilgjengelig)",
  "hero-subtitle": "Få KI til å snakke språket ditt, én modell om gangen",
  "multilingual-typed": [
    "I train LLMs to speak your language.",
    "我训练大型语言模型来讲你的语言。",
    "Entreno LLMs para hablar tu idioma.",
    "Ich trainiere LLMs, damit sie deine Sprache sprechen.",
    "J'entraîne des LLM pour qu'ils parlent votre langue.",
    "あなたの言語を话せるように、LLMを訓練しています。",
    "Treino LLMs para falar o seu idioma.",
    "أقوم بتدريب LLM لتتحدث لغتك.",
    "Alleno LLM per parlare la tua lingua.",
    "Я обучаю LLM говорить на вашем языке."
  ],
  "about-title": "Om meg i O(1)",
  "about-description": "Jeg er en AI-forsker og ingeniør med fokus på flerspråklige store språkmodeller.",
  "about-role": "AI-ingeniør og forsker",
  "about-intro": "Hos Translated har jeg bidratt til å utvikle Lara fra dag én, en maskinoversettelses-LLM som driver innhold i sanntid for Airbnb, Uber, Shopify og andre, og nådd over 200 millioner brukere.",
  "birth-place-label": "Fødselssted:",
  "birth-place": "Napoli, Italia",
  "email-label": "E-post:",
  "city-label": "By:",
  "city": "Roma, Italia",
  "masters-label": "Mastergrad:",
  "masters-degree": "KI og dataingeniør",
  "bachelors-label": "Bachelorgrad:",
  "bachelors-degree": "Datateknikk",
  "university-label": "Universitet:",
  "university": "Universitetet i Pisa",
  "languages-label": "Språk:",
  "languages": "Italiensk, engelsk",
  "focus-label": "Fokus:",
  "focus": "Flerspråklige LLM-er",
  "about-conclusion": "Jeg har skalert opplæring til over 1000 GPU-er og utvidet maskinoversettelsesdekningen til 201 språk. Jeg var med på å grunnlegge <a href=\"https://picarta.ai/\" target=\"_blank\" style=\"color: var(--accent-primary); text-decoration: none; font-weight: 600;\">Picarta.ai</a>, en AI-startup som bygger en plattform for geolokalisering av bilder. Jeg er en ivrig elev som hele tiden jobber for å forbedre måten jeg tenker, trener og bygger på. Jeg kan ikke forestille meg et liv uten en eller annen form for trening, enten det er GPU-er, vekter på treningssenteret eller maratonforberedelser.",
  "tech-title": "Teknologier og verktøy",
  "tech-pytorch": "Dyp læring",
  "tech-python": "Hovedspråk",
  "tech-slurm": "HPC-jobbplanlegging",
  "tech-vllm": "Høyytelses LLM-servering",
  "tech-transformers": "LLMs og NLP",
  "tech-mongodb": "Datalagring",
  "tech-docker": "Containerisering",
  "tech-git": "Versjonskontroll",
  "focus-title": "Nåværende fokus",
  "focus-description": "Det jeg bygger og forsker på akkurat nå",
  "focus-scaling-title": "Skalering av maskinoversettelse til 201 språk",
  "focus-scaling-desc": "Utvide maskinoversettelsens dekning samtidig som kvaliteten opprettholdes. Arbeide med massive flerspråklige datasett og optimalisere for språk med få ressurser ved hjelp av avanserte teknikker for overføring av læring.",
  "focus-production-title": "Flerspråklig AI i produksjon",
  "focus-production-desc": "Bygge robuste oversettelsessystemer som håndterer kompleksiteten i den virkelige verden i stor skala. Håndterer utfordringer som kodebytte, domeneadaptasjon, støyende brukergenerert innhold og opprettholdelse av kvalitet på tvers av over 200 millioner daglige brukere.",
  "tag-realtime": "Sanntidsbehandling",
  "tag-quality": "Kvalitetssikring",
  "tag-data": "Data",
  "resume-title": "CV",
  "resume-description": "AI-ingeniør og forsker med lang erfaring i å bygge og skalere flerspråklige maskinoversettelsessystemer. Dokumentert erfaring med å betjene over 200 millioner brukere gjennom innovative LLM-løsninger.",
  "experience-title": "Profesjonell erfaring",
  "current-role": "AI-ingeniør og forsker",
  "current-company": "Translated, Roma, Italia",
  "lara-desc": "<strong>Lara:</strong> Jobbet med hele FoU-pipelinen til en LLM optimalisert for maskinoversettelse: fra datainnsamling og modelltrening til justering og inferensoptimalisering. Bygget fra bunnen av i et oppstartsaktig team på fire personer som opererer i selskapet. Nå er det flaggskipet B2B-produktet, det oversetter alt innhold over hele verden for Airbnb og det meste av Uber, Shopify, Nike og mer, og når over 200 MILLIONER brukere globalt. En B2C-versjon har også nylig blitt lansert.",
  "try-here": "Prøv det her",
  "lara-grande-desc": "<strong>Lara Grande:</strong> Nøkkelrolle i å skalere LLM for å matche kvaliteten til de øverste 1 % av profesjonelle oversettere. Brukte over 1000 GPU-er på CINECA's HPC-klynge for distribusjonstrening i stor skala.",
  "language-expansion-desc": "<strong>Språkutvidelse:</strong> Identifiserte og ledet et vellykket forskningsprosjekt for å utvide maskinoversettelsesproduksjonens dekning fra 56 til 201 språk, en firedobling, noe som gjør det til den første kommersielle maskinoversettelsesmotoren som støtter et slikt spekter. Foreslo retningen, utformet implementeringsplanen og ledet den til ferdigstillelse innen åtte måneder.",
  "instruction-mt-desc": "<strong>Instruksjonsfølgende maskinoversettelse:</strong> Ledet forskning som justerte LLM til å følge detaljerte stilguider ved hjelp av SFT og DPO.",
  "trust-attention-desc": "<strong>Tillitsoppmerksomhet:</strong> Foreslo og validerte en ny teknikk som prioriterer opplæringsdata av høy verdi, og oppnådde de mest betydelige kvalitetsforbedringene innen maskinoversettelse på fem år.",
  "polyglot-desc": "<strong>Polyglot:</strong> Utviklet en språkidentifikasjonsmodell som støtter 201 språk.",
  "startup-title": "Erfaring fra oppstartsbedrift",
  "startup-role": "Medgrunnlegger og AI-ingeniør",
  "italy": "Italia",
  "startup-desc1": "Medgrunnlagt AI-oppstart som en del av et tre-personers grunnleggende team som bygger bildegeolokaliseringsplattform",
  "startup-desc2": "Utviklet kjernemodellen for bildegeolokalisering ved hjelp av visjonstransformatorer og gjenfinningsteknikker",
  "startup-desc3": "Fikk verdifull erfaring i et fartsfylt oppstartsmiljø og produktutvikling",
  "startup-desc4": "Lærte viktige ting om teamdynamikk, usikkerhetsstyring og rask iterasjon",
  "education-title": "Utdanning",
  "masters-full": "M.S. kunstig intelligens og datateknikk",
  "university-location": "Universitetet i Pisa, Pisa, Italia",
  "masters-description": "110/110 summa cum laude (4,0 GPA). Spesialisert på datamining, maskinlæring, datavisjon, naturlig språkbehandling, optimeringsteori og prosessmining. Fikk praktisk erfaring med distribuerte systemer, nettskyen og verktøy som MongoDB, Neo4j, Docker, Kubernetes, TensorFlow og PyTorch.",
  "bachelors-full": "B.S. Datateknikk",
  "bachelors-description": "110/110 (4,0 GPA). Sterkt grunnlag i datateknikk, inkludert matematikk, fysikk, algoritmer, databaser, datamaskinarkitektur, datanettverk, operativsystemer og programmering i C, C++, Java, Python, Matlab, SQL, JavaScript og PHP.",
  "portfolio-title": "Portefølje",
  "portfolio-description": "En samling av mine AI- og maskinlæringsprosjekter, fra akademisk forskning til produksjonssystemer som betjener millioner av brukere over hele verden.",
  "t4sa-desc": "Tverrmodal visuell stemningsanalysesystem ved hjelp av kunnskapsdestillasjon fra tekst til visjonsmodeller. Publisert på ECAI 2023, og oppnådde toppmoderne resultater på visuell stemningsprediksjon.",
  "numpygpt-desc": "En fra bunnen av GPT bygget med NumPy og Pythons standardbibliotek. Ingen autograd, ingen rammeverk: hvert lag er reimplementert med sin egen frem- og bakoverpassering. Gradienter beregnes manuelt, oppdateringer er transparente, og hver operasjon er stavet ut.",
  "fake-news-desc": "Multimodalt AI-system for oppdagelse av feilinformasjon ved bruk av transformatorarkitekturer. Inneholder holdningsanalyse og vurdering av kildens troverdighet.",
  "unimusic-desc": "Skalerbar musikkoppdagelsesplattform med hybrid MongoDB/Neo4j-arkitektur. Håndterer millioner av spor med algoritmer for anbefalinger i sanntid.",
  "voice-vibes-desc": "System for gjenkjenning av talefølelse med seks nye AI-arkitekturer. Oppnådde 94 % nøyaktighet ved hjelp av ensemblemetoder og avansert funksjonsteknikk.",
  "federated-dbscan-desc": "Personvernbeskyttende distribuert klynging med føderert læring. Muliggjør samarbeidende ML uten datadeling, og oppnår 99 % personvern.",
  "pagerank-desc": "Høyytelses PageRank-algoritmeimplementering med optimaliserte sparse matrix-operasjoner. Håndterer grafer med millioner av noder effektivt.",
  "contact-title": "Kontakt",
  "contact-description": "La oss få kontakt! Enten du vil diskutere AI, maskinlæring eller potensielle samarbeid, er jeg alltid åpen for interessante samtaler.",
  "location-label": "Sted:",
  "location": "Roma, Italia",
  "form-name": "Navnet ditt",
  "form-email": "Din e-post",
  "form-subject": "Emne",
  "form-message": "Melding",
  "form-loading": "Laster",
  "form-success": "Meldingen din er sendt. Takk!",
  "form-send": "Send melding"
}