{
  "nav-home": "Startpagina",
  "nav-about": "Over mij",
  "nav-tech": "Technologieën",
  "nav-resume": "CV",
  "nav-portfolio": "Portfolio",
  "nav-contact": "Contact",
  "language-label": "Taal",
  "language-selector-header": "Taal selecteren ({count} beschikbaar)",
  "hero-subtitle": "AI uw taal laten spreken, één model tegelijk",
  "multilingual-typed": [
    "I train LLMs to speak your language.",
    "我训练大型语言模型来讲你的语言。",
    "Entreno LLMs para hablar tu idioma.",
    "Ich trainiere LLMs, damit sie deine Sprache sprechen.",
    "J'entraîne des LLM pour qu'ils parlent votre langue.",
    "あなたの言語を话せるように、LLMを訓練しています。",
    "Treino LLMs para falar o seu idioma.",
    "أقوم بتدريب LLM لتتحدث لغتك.",
    "Alleno LLM per parlare la tua lingua.",
    "Я обучаю LLM говорить на вашем языке."
  ],
  "about-title": "Over mij in O(1)",
  "about-description": "Ik ben een AI-onderzoeker en -ingenieur die zich richt op meertalige grote taalmodellen.",
  "about-role": "AI-ingenieur en onderzoeker",
  "about-intro": "Bij Translated heb ik vanaf de eerste dag geholpen bij het opbouwen van Lara, een LLM voor machinevertaling die content in realtime mogelijk maakt voor Airbnb, Uber, Shopify en anderen, en meer dan 200 miljoen gebruikers bereikt.",
  "birth-place-label": "Geboorteplaats:",
  "birth-place": "Napels, Italië",
  "email-label": "E-mail:",
  "city-label": "Stad:",
  "city": "Rome, Italië",
  "masters-label": "M.S.-diploma:",
  "masters-degree": "AI en data-engineering",
  "bachelors-label": "Bachelor of Science:",
  "bachelors-degree": "Computertechniek",
  "university-label": "Universiteit:",
  "university": "Universiteit van Pisa",
  "languages-label": "Talen:",
  "languages": "Italiaans, Engels",
  "focus-label": "Focus:",
  "focus": "Meertalige LLM's",
  "about-conclusion": "Ik heb de training opgeschaald naar meer dan 1.000 GPU's en de dekking van machinevertaling uitgebreid naar 201 talen. Ik ben mede-oprichter van <a href=\"https://picarta.ai/\" target=\"_blank\" style=\"color: var(--accent-primary); text-decoration: none; font-weight: 600;\">Picarta.ai</a>, een AI-startup die een platform bouwt voor geolokalisatie van afbeeldingen. Ik ben een vraatzuchtige leerling die voortdurend probeert te verbeteren hoe ik denk, train en bouw. Ik kan me geen leven voorstellen zonder enige vorm van training, of het nu gaat om GPU's, gewichten in de sportschool of marathonvoorbereiding.",
  "tech-title": "Technologieën en tools",
  "tech-pytorch": "Deep Learning",
  "tech-python": "Primaire programmeertaal",
  "tech-slurm": "HPC-taakplanning",
  "tech-vllm": "Hoogwaardige LLM-servering",
  "tech-transformers": "LLM's en NLP",
  "tech-mongodb": "Gegevensopslag",
  "tech-docker": "Containerisatie",
  "tech-git": "Versiebeheer",
  "focus-title": "Huidige focus",
  "focus-description": "Wat ik nu aan het bouwen en onderzoeken ben",
  "focus-scaling-title": "Machinevertaling opschalen naar 201 talen",
  "focus-scaling-desc": "Uitbreiding van de dekking van machinevertaling met behoud van kwaliteit. Werken met enorme meertalige datasets en optimaliseren voor talen met weinig bronnen met behulp van geavanceerde technieken voor transfer learning.",
  "focus-production-title": "Meertalige AI in productie",
  "focus-production-desc": "Het bouwen van robuuste vertaalsystemen die de complexiteit van de echte wereld op grote schaal aankunnen. Uitdagingen aanpakken zoals code-switching, domeinaanpassing, ruisvolle door gebruikers gegenereerde inhoud en het handhaven van kwaliteit voor meer dan 200 miljoen dagelijkse gebruikers.",
  "tag-realtime": "Realtime serveren",
  "tag-quality": "Kwaliteitsborging",
  "tag-data": "Gegevens",
  "resume-title": "CV",
  "resume-description": "AI-ingenieur en -onderzoeker met uitgebreide ervaring in het bouwen en schalen van meertalige machinevertalingssystemen. Bewezen staat van dienst van meer dan 200 miljoen gebruikers via innovatieve LLM-oplossingen.",
  "experience-title": "Professionele ervaring",
  "current-role": "AI-ingenieur en onderzoeker",
  "current-company": "Translated, Rome, Italië",
  "lara-desc": "<strong>Lara:</strong> Werkte aan de volledige R&D-pijplijn van een LLM geoptimaliseerd voor machinevertaling: van gegevensverzameling en modeltraining tot uitlijning en optimalisatie van de conclusies. Van nul opgebouwd binnen een start-upteam van vier personen binnen het bedrijf. Het is nu het belangrijkste B2B-product en vertaalt alle content wereldwijd voor Airbnb en het grootste deel van Uber, Shopify, Nike en meer, en bereikt wereldwijd meer dan 200 MILJOEN gebruikers. Onlangs is ook een B2C-versie gelanceerd.",
  "try-here": "Probeer het hier",
  "lara-grande-desc": "<strong>Lara Grande:</strong> Sleutelrol bij het schalen van LLM om de kwaliteit van de top 1% van professionele vertalers te evenaren. Gebruikte meer dan 1.000 GPU's op het HPC-cluster van CINECA voor grootschalige gedistribueerde training.",
  "language-expansion-desc": "<strong>Taalexpansie:</strong> Identificeerde en leidde een succesvol onderzoeksproject om de dekking van de productie van machinevertalingen uit te breiden van 56 naar 201 talen, een verviervoudiging, waardoor het de eerste commerciële machinevertaling-engine is die een dergelijk bereik ondersteunt. Stelde de richting voor, ontwierp het implementatieplan en leidde het binnen acht maanden tot voltooiing.",
  "instruction-mt-desc": "<strong>Instructie-volgende machinevertaling:</strong> Leidde onderzoek dat LLM afstemde om gedetailleerde stijlgidsen te volgen met behulp van SFT en DPO.",
  "trust-attention-desc": "<strong>Vertrouwensattentie:</strong> Een nieuwe techniek voorgesteld en gevalideerd die prioriteit geeft aan hoogwaardige trainingsgegevens, waardoor de meest significante verbeteringen in de kwaliteit van machinevertaling in vijf jaar worden bereikt.",
  "polyglot-desc": "<strong>Polyglot:</strong> Ontwikkelde een taalidentificatiemodel dat 201 talen ondersteunt.",
  "startup-title": "Ervaring met startups",
  "startup-role": "Mede-oprichter en AI-ingenieur",
  "italy": "Italië",
  "startup-desc1": "Mede-oprichter van AI-startup als onderdeel van een team van drie personen dat een platform voor geolocatie van afbeeldingen bouwt",
  "startup-desc2": "Ontwikkelde het kernmodel voor beeldgeolokalisatie met behulp van visietransformatoren en op ophalen gebaseerde technieken",
  "startup-desc3": "Waardevolle ervaring opgedaan in een snelle startup-omgeving en productontwikkeling",
  "startup-desc4": "Belangrijke lessen geleerd over teamdynamiek, onzekerheidsmanagement en snelle iteratie",
  "education-title": "Opleiding",
  "masters-full": "M.S. Kunstmatige Intelligentie en Data Engineering",
  "university-location": "Universiteit van Pisa, Pisa, Italië",
  "masters-description": "110/110 summa cum laude (4,0 GPA). Gespecialiseerd in datamining, machine learning, computervisie, natuurlijke taalverwerking, optimalisatietheorie en procesmining. Praktijkervaring opgedaan met gedistribueerde systemen, cloud computing en tools zoals MongoDB, Neo4j, Docker, Kubernetes, TensorFlow en PyTorch.",
  "bachelors-full": "Bachelor of Science in Computer Engineering",
  "bachelors-description": "110/110 (4.0 GPA). Sterke basis in computertechniek, waaronder wiskunde, natuurkunde, algoritmen, databases, computerarchitectuur, computernetwerken, besturingssystemen en programmeren in C, C++, Java, Python, Matlab, SQL, JavaScript en PHP.",
  "portfolio-title": "Portfolio",
  "portfolio-description": "Een verzameling van mijn AI- en machine learning-projecten, van academisch onderzoek tot productiesystemen die miljoenen gebruikers wereldwijd bedienen.",
  "t4sa-desc": "Crossmodaal visueel sentimentanalysesysteem met behulp van kennisdistillatie van tekst naar visuele modellen. Gepubliceerd op ECAI 2023, met de modernste resultaten op het gebied van visuele sentimentvoorspelling.",
  "numpygpt-desc": "Een GPT gebouwd met NumPy en de standaardbibliotheek van Python. Geen autograd, geen frameworks: elke laag wordt opnieuw geïmplementeerd met een eigen voorwaartse en achterwaartse pas. Gradiënten worden handmatig berekend, updates zijn transparant en elke bewerking wordt gespeld.",
  "fake-news-desc": "Multimodaal AI-systeem voor het detecteren van misinformatie met behulp van transformatorarchitecturen. Biedt houdinganalyse en broncredibiliteitsscores.",
  "unimusic-desc": "Schaalbaar muziekontdekkingsplatform met hybride MongoDB/Neo4j-architectuur. Verwerkt miljoenen nummers met realtime aanbevelingsalgoritmen.",
  "voice-vibes-desc": "Spraakemotieherkenningssysteem met zes nieuwe AI-architecturen. Bereikte 94% nauwkeurigheid met behulp van ensemblemethoden en geavanceerde functietechniek.",
  "federated-dbscan-desc": "Privacybehoudende gedistribueerde clustering met federated learning. Maakt collaboratieve ML mogelijk zonder gegevensuitwisseling, waardoor 99% privacy wordt behouden.",
  "pagerank-desc": "Hoogwaardige implementatie van het PageRank-algoritme met geoptimaliseerde sparse matrix-bewerkingen. Verwerkt efficiënt grafieken met miljoenen nodes.",
  "contact-title": "Contact",
  "contact-description": "Laten we contact maken! Of je nu AI, machine learning of mogelijke samenwerkingen wilt bespreken, ik sta altijd open voor interessante gesprekken.",
  "location-label": "Locatie:",
  "location": "Rome, Italië",
  "form-name": "Je naam",
  "form-email": "Je e-mailadres",
  "form-subject": "Onderwerp",
  "form-message": "Bericht",
  "form-loading": "Laden",
  "form-success": "Je bericht is verzonden. Bedankt!",
  "form-send": "Verzend bericht"
}