{
  "nav-home": "Hjem",
  "nav-about": "Om",
  "nav-tech": "Teknologisk stabel",
  "nav-resume": "CV",
  "nav-portfolio": "Portefølje",
  "nav-contact": "Kontakt",
  "language-label": "Språk",
  "language-selector-header": "Vel språk ({count} tilgjengeleg)",
  "hero-subtitle": "Å få AI til å snakke språket ditt, ei modell om gongen",
  "multilingual-typed": [
    "I train LLMs to speak your language.",
    "我训练大型语言模型来讲你的语言。",
    "Entreno LLMs para hablar tu idioma.",
    "Ich trainiere LLMs, damit sie deine Sprache sprechen.",
    "J'entraîne des LLM pour qu'ils parlent votre langue.",
    "あなたの言語を话せるように、LLMを訓練しています。",
    "Treino LLMs para falar o seu idioma.",
    "أقوم بتدريب LLM لتتحدث لغتك.",
    "Alleno LLM per parlare la tua lingua.",
    "Я обучаю LLM говорить на вашем языке."
  ],
  "about-title": "Om meg i O(1)",
  "about-description": "Eg er AI-forskar og ingeniør med fokus på flerspråklige store språkmodeller.",
  "about-role": "AI-ingeniør og forsker",
  "about-intro": "Hos Translated bidro jeg til å bygga Lara frå dag eins, ei maskinoversettings-LLM som gjev innhald i sanntid til Airbnb, Uber, Shopify og andre, og når over 200 millionar brukare.",
  "birth-place-label": "Fødselssted:",
  "birth-place": "Napoli, Italia",
  "email-label": "E-post:",
  "city-label": "By:",
  "city": "Roma, Italia",
  "masters-label": "M.S. grad:",
  "masters-degree": "AI og dataingeniørskap",
  "bachelors-label": "B.S. grad:",
  "bachelors-degree": "Datateknikk",
  "university-label": "Universitet:",
  "university": "Universitetet i Pisa",
  "languages-label": "Språk:",
  "languages": "Italiensk, engelsk",
  "focus-label": "Fokus:",
  "focus": "Flerspråklige LLM-er",
  "about-conclusion": "Jeg har skalert opplæring til 1000+ GPU-er og utvidet maskinoversettelsesdekning til 201 språk. Jeg var med på å grunnlegge <a href=\"https://picarta.ai/\" target=\"_blank\" style=\"color: var(--accent-primary); text-decoration: none; font-weight: 600;\">Picarta.ai</a>, ei AI-oppstartsbedrift som bygger ei plattform for geolokalisering av bilder. Jeg er ein glupsk lærar som stadig presser på for å forbetre måten eg tenker, trenar og bygger på. Jeg kan ikkje tenke meg eit liv utan ein eller annan form for trening, enten det er GPU-er, vekter på treningsstudioet eller maratonforberedelser.",
  "tech-title": "Teknologi og verktøy",
  "tech-pytorch": "Dyp læring",
  "tech-python": "Hovedspråk",
  "tech-slurm": "HPC jobbplanlegging",
  "tech-vllm": "Høyytelses LLM-servering",
  "tech-transformers": "LLMs og NLP",
  "tech-mongodb": "Datalagring",
  "tech-docker": "Containerisering",
  "tech-git": "Versjonskontroll",
  "focus-title": "Noverande fokus",
  "focus-description": "Det jeg bygger og forskar på akkurat nå",
  "focus-scaling-title": "Skalering av maskinoversettelse til 201 språk",
  "focus-scaling-desc": "Utvide maskinoversettingsdekninga medan kvaliteten oppretthaldes. Arbeid med massive flerspråklige datasett og optimalisering for språk med få ressursar ved hjelp av avanserte overføringslæringsteknikker.",
  "focus-production-title": "Flerspråklig AI i produksjon",
  "focus-production-desc": "Bygge robuste oversettelsessystemer som håndterer virkelig kompleksitet i stor skala. Takle utfordringer som kodebytting, domene-tilpasning, støyende brukergenerert innhold og opprettholde kvalitet på tvers av over 200 millioner daglige brukere.",
  "tag-realtime": "Sanntidsbehandling",
  "tag-quality": "Kvalitetssikring",
  "tag-data": "Data",
  "resume-title": "CV",
  "resume-description": "AI-ingeniør og forskar med lang erfaring i å byggja og skala flerspråklige maskinoversettingssystem. Dokumentert erfaring med å betjene over 200 millionar brukare gjennom innovative LLM-løysingar.",
  "experience-title": "Profesjonell erfaring",
  "current-role": "AI-ingeniør og forsker",
  "current-company": "Translated, Roma, Italia",
  "lara-desc": "<strong>Lara:</strong> Jobba med heile FoU-røret til ei LLM optimalisert for maskinoversetting: frå datainnsamling og modelltrening til justering og inferensoptimalisering. Bygget frå scratch i eit oppstartsteam på fire som opererer innanfor selskapet. Nå er det flaggskipet B2B-produktet, det oversetter alt innhold over hele verden for Airbnb og det meste av Uber, Shopify, Nike og mer, og når over 200 millioner brukere globalt. Det er også nylig lansert ei B2C-versjon.",
  "try-here": "Prøv det her",
  "lara-grande-desc": "<strong>Lara Grande:</strong> Nøkkelrolle i å skalere LLM for å matche kvaliteten på topp 1 % av profesjonelle oversettere. Brukte over 1000 GPU-er på CINECA 's HPC-klynge for stor distribusjonsopplæring.",
  "language-expansion-desc": "<strong>Språkutviding:</strong> Identifiserte og leia eit vellykka forskingsprosjekt for å utvide maskinoversettingsproduksjonsdekninga frå 56 til 201 språk, ei 4× økning, og gjorde det til den første kommersielle maskinoversettingsmotoren som støttar eit slikt spekter. Foreslo retninga, utforma gjennomføringsplanen og leia den til ferdigstillinga innan åtte månader.",
  "instruction-mt-desc": "<strong>Instruksjonsfølgande maskinoversetting:</strong> Leda forsking som justerte LLM for å følgje detaljerte stilguider ved hjelp av SFT og DPO.",
  "trust-attention-desc": "<strong>Tillit oppmerksomhet:</strong> Foreslo og validerte en ny teknikk som prioriterer høyvurderte treningsdata, og oppnådde de mest betydningsfulle kvalitetsforbedringene innen maskinoversettelse på fem år.",
  "polyglot-desc": "<strong>Polyglot:</strong> Utvikla ein språkidentifikasjonsmodell som støttar 201 språk.",
  "startup-title": "Erfaring fra oppstartsbedrift",
  "startup-role": "Medgrunnlegger og AI-ingeniør",
  "italy": "Italia",
  "startup-desc1": "Medgrunnlagde AI-oppstart som del av tre-person grunnlagsteam som bygger bildegeolokaliseringsplattform",
  "startup-desc2": "Utvikla kjernemodellen for geolokalisering av bilder ved hjelp av synstransformatorer og gjenfinningsteknikker",
  "startup-desc3": "Fikk verdifull erfaring i fartsfylt oppstartsmiljø og produktutvikling",
  "startup-desc4": "Lærte avgjørande leksjonar om teamdynamikk, usikkerhetsstyring og rask iterasjon",
  "education-title": "Utdanning",
  "masters-full": "M.S. Kunstig intelligens og dataingeniør",
  "university-location": "Universitetet i Pisa, Pisa, Italia",
  "masters-description": "110/110 summa cum laude (4,0 GPA). Spesialisert på datautvinning, maskinlæring, datasyn, naturlig språkprosessering, optimaliseringsteori og prosessutvinning. Fikk praktisk erfaring med distribuerte systemer, skytjenester og verktøy som MongoDB, Neo4j, Docker, Kubernetes, TensorFlow og PyTorch.",
  "bachelors-full": "B.S. Datateknikk",
  "bachelors-description": "110/110 (4.0 GPA). Sterkt grunnlag i datateknikk, inkludert matematikk, fysikk, algoritmer, databaser, datamaskinarkitektur, datanettverk, operativsystemer og programmering i C, C ++, Java, Python, Matlab, SQL, JavaScript og PHP.",
  "portfolio-title": "Portefølje",
  "portfolio-description": "En samling av mine AI og maskinlæring prosjekt, frå akademisk forsking til produksjonssystem som tenjer millionar av brukare over heile verda.",
  "t4sa-desc": "Korsmodal visuell stemningsanalysesystem ved hjelp av kunnskapsdestillasjon frå tekst til visjonsmodeller. Publisert på ECAI 2023, og oppnådde toppmoderne resultat på visuell stemningsprediksjon.",
  "numpygpt-desc": "Ei GPT byggd frå bunnen av med NumPy og Python sitt standardbibliotek. Ingen autograd, ingen rammeverk: hvert lag blir re-implementert med sin egen framover- og bakoverpassering. Gradienter blir reknad manuelt, oppdateringar er gjennomsynlege, og kvar operasjon blir uttala.",
  "fake-news-desc": "Multimodalt AI-system for feilinformasjon oppdaging ved hjelp av transformatorarkitekturer. Innehelder stillingsanalyse og kredibilitetspoengsetting av kjelde.",
  "unimusic-desc": "Skalerbar musikkoppdagelsesplattform med hybrid MongoDB/Neo4j arkitektur. Håndterer millioner av spor med sanntids anbefalingsalgoritmer.",
  "voice-vibes-desc": "Talefølelsesgjenkjenningssystem med seks nye AI-arkitekturer. Oppnådde 94 % nøyaktighet ved hjelp av ensemblemetoder og avansert funksjonsteknikk.",
  "federated-dbscan-desc": "Privatlivsvernande distribuerte gruppering med føderalt læring. Møgleggjer samarbeidsbasert ML utan datautveksling, og oppnår 99 % personvernsvern.",
  "pagerank-desc": "Høyytelses PageRank algoritme implementering med optimaliserte sparse matrix operasjoner. Håndterer grafikk med millioner av noder effektivt.",
  "contact-title": "Kontakt",
  "contact-description": "La oss koble oss til! Enten du vil diskutere AI, maskinlæring eller potensielle samarbeid, er jeg alltid åpen for interessante samtaler.",
  "location-label": "Sted:",
  "location": "Roma, Italia",
  "form-name": "Ditt navn",
  "form-email": "Din e-post",
  "form-subject": "Emne",
  "form-message": "Melding",
  "form-loading": "Lasting",
  "form-success": "Meldinga di er sendt. Takk!",
  "form-send": "Send melding"
}