{
  "nav-home": "Strona główna",
  "nav-about": "O mnie",
  "nav-tech": "Technologie",
  "nav-resume": "CV",
  "nav-portfolio": "Portfolio",
  "nav-contact": "Kontakt",
  "language-label": "Język",
  "language-selector-header": "Wybierz język (dostępne: {count})",
  "hero-subtitle": "Spraw, aby sztuczna inteligencja mówiła Twoim językiem, jeden model po drugim",
  "multilingual-typed": [
    "I train LLMs to speak your language.",
    "我训练大型语言模型来讲你的语言。",
    "Entreno LLMs para hablar tu idioma.",
    "Ich trainiere LLMs, damit sie deine Sprache sprechen.",
    "J'entraîne des LLM pour qu'ils parlent votre langue.",
    "あなたの言語を话せるように、LLMを訓練しています。",
    "Treino LLMs para falar o seu idioma.",
    "أقوم بتدريب LLM لتتحدث لغتك.",
    "Alleno LLM per parlare la tua lingua.",
    "Я обучаю LLM говорить на вашем языке."
  ],
  "about-title": "O mnie w O(1)",
  "about-description": "Jestem badaczem i inżynierem AI, który zajmuje się wielojęzycznymi dużymi modelami językowymi.",
  "about-role": "Inżynier i badacz AI",
  "about-intro": "W Translated od samego początku pomagałem budować Larę, LLM do tłumaczenia maszynowego, który w czasie rzeczywistym przetwarza treści dla Airbnb, Ubera, Shopify i innych firm, docierając do ponad 200 milionów użytkowników.",
  "birth-place-label": "Miejsce urodzenia:",
  "birth-place": "Neapol, Włochy",
  "email-label": "E-mail:",
  "city-label": "Miejscowość:",
  "city": "Rzym, Włochy",
  "masters-label": "Stopień magistra:",
  "masters-degree": "Sztuczna inteligencja i inżynieria danych",
  "bachelors-label": "Stopień licencjata:",
  "bachelors-degree": "Inżynieria komputerowa",
  "university-label": "Uniwersytet:",
  "university": "Uniwersytet w Pizie",
  "languages-label": "Języki:",
  "languages": "Włoski, angielski",
  "focus-label": "Koncentracja:",
  "focus": "Wielojęzyczne modele LLM",
  "about-conclusion": "Skalowałem szkolenie do ponad 1000 procesorów graficznych i rozszerzyłem zakres tłumaczenia maszynowego do 201 języków. Jestem współzałożycielem <a href=\"https://picarta.ai/\" target=\"_blank\" style=\"color: var(--accent-primary); text-decoration: none; font-weight: 600;\">Picarta.ai</a>, startupu zajmującego się sztuczną inteligencją, który tworzy platformę do geolokalizacji obrazów. Jestem żarłocznym uczniem, który nieustannie dąży do poprawy sposobu myślenia, szkolenia i tworzenia. Nie wyobrażam sobie życia bez jakiejś formy treningu, czy to GPU, talerzy na siłowni, czy przygotowań do maratonu.",
  "tech-title": "Technologie i narzędzia",
  "tech-pytorch": "Uczenie głębokie",
  "tech-python": "Język Python",
  "tech-slurm": "Planowanie zadań HPC",
  "tech-vllm": "Wysokowydajne serwowanie LLM",
  "tech-transformers": "LLM i NLP",
  "tech-mongodb": "Przechowywanie danych",
  "tech-docker": "Konteneryzacja",
  "tech-git": "Kontrola wersji",
  "focus-title": "Obecny cel",
  "focus-description": "Nad czym teraz pracuję i co badam",
  "focus-scaling-title": "Skalowanie tłumaczenia maszynowego na 201 języków",
  "focus-scaling-desc": "Zwiększanie zasięgu tłumaczenia maszynowego przy zachowaniu jakości. Praca z ogromnymi wielojęzycznymi zbiorami danych i optymalizacja dla języków o niskich zasobach przy użyciu zaawansowanych technik uczenia transferowego.",
  "focus-production-title": "Wielojęzyczna sztuczna inteligencja w produkcji",
  "focus-production-desc": "Tworzenie solidnych systemów tłumaczeniowych, które radzą sobie ze złożonością świata rzeczywistego na dużą skalę. Rozwiązujemy problemy związane z przełączaniem kodów, adaptacją domen, hałaśliwymi treściami generowanymi przez użytkowników i utrzymaniem jakości dla ponad 200 milionów użytkowników dziennie.",
  "tag-realtime": "Obsługa w czasie rzeczywistym",
  "tag-quality": "Zapewnienie jakości",
  "tag-data": "Dane",
  "resume-title": "CV",
  "resume-description": "Inżynier i badacz AI z dużym doświadczeniem w budowaniu i skalowaniu wielojęzycznych systemów tłumaczenia maszynowego. Udokumentowane doświadczenie w obsłudze ponad 200 milionów użytkowników dzięki innowacyjnym rozwiązaniom LLM.",
  "experience-title": "Doświadczenie zawodowe",
  "current-role": "Inżynier i badacz AI",
  "current-company": "Translated, Rzym, Włochy",
  "lara-desc": "<strong>Lara:</strong> Pracowała nad pełnym procesem badawczo-rozwojowym LLM zoptymalizowanego pod kątem tłumaczenia maszynowego: od gromadzenia danych i uczenia modelu po optymalizację dopasowania i wnioskowania. Zbudowany od podstaw w ramach czteroosobowego zespołu w stylu startupu działającego w firmie. Obecnie jest to flagowy produkt B2B, który tłumaczy wszystkie treści na całym świecie dla Airbnb i większości firm, takich jak Uber, Shopify, Nike i innych, docierając do ponad 200 milionów użytkowników na całym świecie. Niedawno wprowadzono również wersję B2C.",
  "try-here": "Wypróbuj tutaj",
  "lara-grande-desc": "<strong>Lara Grande:</strong> Kluczowa rola w skalowaniu LLM, aby dorównać jakości najlepszego 1% profesjonalnych tłumaczy. Wykorzystano ponad 1000 procesorów graficznych w klastrze HPC CINECA do rozproszonego szkolenia na dużą skalę.",
  "language-expansion-desc": "<strong>Ekspansja językowa:</strong> Zidentyfikowałem i poprowadziłem udany projekt badawczy mający na celu rozszerzenie zasięgu produkcji tłumaczeń maszynowych z 56 do 201 języków, co stanowi 4-krotny wzrost, dzięki czemu jest to pierwszy komercyjny silnik tłumaczeń maszynowych obsługujący taki zakres. Zaproponował kierunek, zaprojektował plan wdrożenia i doprowadził go do realizacji w ciągu ośmiu miesięcy.",
  "instruction-mt-desc": "<strong>Tłumaczenie maszynowe zgodne z instrukcjami:</strong> prowadzenie badań dostosowujących LLM do przestrzegania szczegółowych wytycznych dotyczących stylu za pomocą SFT i DPO.",
  "trust-attention-desc": "<strong>Uwaga dotycząca zaufania:</strong> Zaproponowałem i zatwierdziłem nowatorską technikę priorytetyzacji danych szkoleniowych o wysokiej wartości, osiągając najbardziej znaczące poprawy jakości tłumaczenia maszynowego w ciągu pięciu lat.",
  "polyglot-desc": "<strong>Polyglot:</strong> opracowanie modelu identyfikacji języka obsługującego 201 języków.",
  "startup-title": "Doświadczenie w startupach",
  "startup-role": "Współzałożyciel i inżynier AI",
  "italy": "Włochy",
  "startup-desc1": "Współzałożyciel startupu AI w ramach trzyosobowego zespołu założycielskiego budującego platformę geolokalizacji obrazu",
  "startup-desc2": "Opracowanie podstawowego modelu geolokalizacji obrazu przy użyciu transformatorów wizyjnych i technik opartych na wyszukiwaniu",
  "startup-desc3": "Zdobycie cennego doświadczenia w dynamicznym środowisku startupowym i rozwoju produktów",
  "startup-desc4": "Wyciągnięto kluczowe wnioski na temat dynamiki zespołu, zarządzania niepewnością i szybkiej iteracji",
  "education-title": "Edukacja",
  "masters-full": "Magister sztucznej inteligencji i inżynierii danych",
  "university-location": "Uniwersytet w Pizie, Piza, Włochy",
  "masters-description": "110/110 summa cum laude (4,0 GPA). Specjalizacja w zakresie eksploracji danych, uczenia maszynowego, wizji komputerowej, przetwarzania języka naturalnego, teorii optymalizacji i eksploracji procesów. Zdobyłem praktyczne doświadczenie w pracy z systemami rozproszonymi, przetwarzaniem w chmurze i narzędziami takimi jak MongoDB, Neo4j, Docker, Kubernetes, TensorFlow i PyTorch.",
  "bachelors-full": "Licencjat z inżynierii komputerowej",
  "bachelors-description": "110/110 (4,0 GPA). Solidne podstawy w inżynierii komputerowej, w tym matematyka, fizyka, algorytmy, bazy danych, architektura komputerowa, sieci komputerowe, systemy operacyjne i programowanie w językach C, C++, Java, Python, Matlab, SQL, JavaScript i PHP.",
  "portfolio-title": "Portfolio",
  "portfolio-description": "Zbiór moich projektów związanych ze sztuczną inteligencją i uczeniem maszynowym, od badań naukowych po systemy produkcyjne obsługujące miliony użytkowników na całym świecie.",
  "t4sa-desc": "System analizy sentymentu wizualnego z wykorzystaniem destylacji wiedzy z modeli tekstowych do wizualnych. Opublikowano na ECAI 2023, osiągając najnowocześniejsze wyniki w przewidywaniu nastrojów wizualnych.",
  "numpygpt-desc": "GPT zbudowany od podstaw przy użyciu NumPy i standardowej biblioteki Pythona. Bez autogradu, bez frameworków: każda warstwa jest ponownie implementowana z własnym przepływem do przodu i do tyłu. Gradienty są obliczane ręcznie, aktualizacje są przejrzyste, a każda operacja jest opisana.",
  "fake-news-desc": "Multimodalny system AI do wykrywania dezinformacji z wykorzystaniem architektur transformatorowych. Obejmuje analizę stanowiska i ocenę wiarygodności źródła.",
  "unimusic-desc": "Skalowalna platforma do odkrywania muzyki z hybrydową architekturą MongoDB/Neo4j. Obsługuje miliony utworów z algorytmami rekomendacji w czasie rzeczywistym.",
  "voice-vibes-desc": "System rozpoznawania emocji w mowie z sześcioma nowatorskimi architekturami AI. Osiągnięto 94% dokładności przy użyciu metod zespołowych i zaawansowanej inżynierii cech.",
  "federated-dbscan-desc": "Rozproszone grupowanie z zachowaniem prywatności dzięki federacyjnemu uczeniu się. Umożliwia wspólne uczenie maszynowe bez udostępniania danych, zapewniając 99% prywatności.",
  "pagerank-desc": "Implementacja algorytmu PageRank o wysokiej wydajności ze zoptymalizowanymi operacjami rzadkiej macierzy. Efektywnie obsługuje wykresy z milionami węzłów.",
  "contact-title": "Kontakt",
  "contact-description": "Skontaktujmy się! Niezależnie od tego, czy chcesz porozmawiać o sztucznej inteligencji, uczeniu maszynowym, czy potencjalnej współpracy, zawsze jestem otwarty na ciekawe rozmowy.",
  "location-label": "Lokalizacja:",
  "location": "Rzym, Włochy",
  "form-name": "Imię i nazwisko",
  "form-email": "Adres e-mail",
  "form-subject": "Temat",
  "form-message": "Wiadomość",
  "form-loading": "Ładowanie",
  "form-success": "Twoja wiadomość została wysłana. Dziękujemy!",
  "form-send": "Wyślij"
}