{
  "nav-home": "Início",
  "nav-about": "Sobre",
  "nav-tech": "Tecnologias",
  "nav-resume": "Currículo",
  "nav-portfolio": "Portfólio",
  "nav-contact": "Contato",
  "language-label": "Idioma",
  
  "hero-subtitle": "Fazendo a IA falar sua língua, um modelo de cada vez",
  "hero-typed": ["um Pesquisador de IA", "um Engenheiro", "um Construtor"],
  
  "about-title": "Sobre mim em O(1)",
  "about-description": "Sou um pesquisador e engenheiro de IA focado em modelos de linguagem multilingues, fazendo os LLMs falarem sua língua.",
  "about-role": "Engenheiro e Pesquisador de IA",
  "about-intro": "Na Translated, ajudei a construir Lara do zero, um LLM de tradução automática que alimenta conteúdo para Airbnb, Uber, Shopify e outros, alcançando mais de 200 milhões de usuários.",
  "birth-place-label": "Local de Nascimento:",
  "birth-place": "Nápoles, Itália",
  "email-label": "Email:",
  "city-label": "Cidade:",
  "city": "Roma, Itália",
  "masters-label": "Mestrado:",
  "masters-degree": "IA e Engenharia de Dados",
  "bachelors-label": "Bacharelado:",
  "bachelors-degree": "Engenharia da Computação",
  "university-label": "Universidade:",
  "university": "Universidade de Pisa",
  "languages-label": "Idiomas:",
  "languages": "Italiano, Inglês",
  "focus-label": "Foco:",
  "focus": "LLMs Multilingues",
  "about-conclusion": "Escalei treinamento para mais de 1.000 GPUs e expandi a cobertura MT para 201 idiomas. Trabalhando noites e fins de semana, co-fundei uma startup de IA construindo uma plataforma de geolocalização de imagens. Sou um aprendiz voraz que constantemente se esforça para melhorar como penso, treino e construo. Não consigo imaginar uma vida sem alguma forma de treinamento, sejam GPUs, pesos na academia ou preparação para maratona.",
  
  "tech-title": "Tecnologias e Ferramentas 🛠️",
  
  "focus-title": "Foco Atual 🎯",
  "focus-description": "No que estou trabalhando e pesquisando agora",
  "focus-scaling-title": "Escalando MT para 201 Idiomas",
  "focus-scaling-desc": "Expandindo cobertura de tradução automática mantendo qualidade. Trabalhando com datasets multilingues massivos e otimizando para idiomas de poucos recursos usando técnicas avançadas de transfer learning.",
  "focus-production-title": "IA Multilingue em Produção",
  "focus-production-desc": "Construindo sistemas de tradução robustos que lidam com complexidade do mundo real em escala. Enfrentando desafios como code-switching, adaptação de domínio e manutenção de qualidade para mais de 200 milhões de usuários diários.",
  "tag-realtime": "Servir em Tempo Real",
  "tag-quality": "Garantia de Qualidade",
  
  "resume-title": "Currículo",
  "resume-description": "Engenheiro e Pesquisador de IA com vasta experiência na construção e escalonamento de sistemas de tradução automática multilingues. Histórico comprovado servindo 200+ milhões de usuários através de soluções LLM inovadoras.",
  "education-title": "Educação",
  "masters-full": "Mestrado em Inteligência Artificial e Engenharia de Dados",
  "university-location": "Universidade de Pisa, Pisa, Itália",
  "masters-description": "110/110 summa cum laude (4.0 GPA). Especializado em Mineração de Dados, Machine Learning, Visão Computacional, Processamento de Linguagem Natural, Teoria de Otimização e Process Mining. Experiência prática com Sistemas Distribuídos, Cloud Computing e ferramentas como MongoDB, Neo4j, Docker, Kubernetes, TensorFlow e PyTorch.",
  "bachelors-full": "Bacharelado em Engenharia da Computação",
  "bachelors-description": "110/110 (4.0 GPA). Base sólida em engenharia da computação incluindo matemática, física, algoritmos, bancos de dados, arquitetura de computadores, redes de computadores, sistemas operacionais e programação em C, C++, Java, Python, Matlab, SQL, JavaScript e PHP.",
  "experience-title": "Experiência Profissional",
  "current-role": "Engenheiro e Pesquisador de IA",
  "current-company": "Translated, Roma, Itália",
  "lara-desc": "<strong>Lara:</strong> Trabalhei no pipeline completo de P&D de um LLM otimizado para MT: desde coleta de dados e treinamento do modelo até alinhamento e otimização de inferência. Construído do zero dentro de uma equipe estilo startup de quatro pessoas operando dentro da empresa. Agora o produto B2B principal, traduz todo conteúdo mundial para Airbnb e a maioria do Uber, Shopify, Nike e mais, alcançando mais de 200M usuários globalmente. Uma versão B2C também foi lançada recentemente.",
  "lara-grande-desc": "<strong>Lara Grande:</strong> Papel chave no escalonamento do LLM para igualar a qualidade do top 1% de tradutores profissionais. Usei mais de 1.000 GPUs no cluster HPC da CINECA para treinamento distribuído em larga escala.",
  "language-expansion-desc": "<strong>Expansão de Idiomas:</strong> Identifiquei e liderei um projeto de pesquisa bem-sucedido para expandir cobertura de tradução automática em produção de 56 para 201 idiomas, um aumento de 4×, tornando-o o primeiro motor MT comercial a suportar tal alcance. Propus a direção, projetei o plano de implementação e levei à conclusão em oito meses.",
  "instruction-mt-desc": "<strong>MT seguindo instruções:</strong> Liderei pesquisa alinhando LLM para seguir guias de estilo detalhados usando SFT e DPO.",
  "trust-attention-desc": "<strong>Trust Attention:</strong> Propus e validei uma técnica novel priorizando dados de treinamento de alto valor, alcançando as melhorias de qualidade MT mais significativas em cinco anos.",
  "polyglot-desc": "<strong>Polyglot:</strong> Desenvolvi um modelo de Identificação de Idioma suportando 201 idiomas.",
  "startup-role": "Co-Fundador e Engenheiro de IA",
  "italy": "Itália",
  "startup-desc1": "Co-fundei startup de IA como parte da equipe fundadora de três pessoas construindo plataforma de geolocalização de imagens",
  "startup-desc2": "Desenvolvi o modelo central para geolocalização de imagens usando vision transformers e técnicas baseadas em retrieval",
  "startup-desc3": "Ganhei experiência valiosa em ambiente startup de ritmo acelerado e desenvolvimento de produtos",
  "startup-desc4": "Aprendi lições cruciais sobre dinâmicas de equipe, gestão de incerteza e iteração rápida",
  "try-here": "Experimente aqui",
  
  "portfolio-title": "Portfólio 🚀",
  "portfolio-description": "Uma coleção dos meus projetos de IA e machine learning, desde pesquisa acadêmica até sistemas de produção servindo milhões de usuários mundialmente.",
  "t4sa-desc": "Sistema de análise de sentimento visual cross-modal usando destilação de conhecimento de modelos de texto para visão. Publicado no ECAI 2023, alcançando resultados estado da arte em predição de sentimento visual.",
  "numpygpt-desc": "Um GPT construído do zero com NumPy e biblioteca padrão do Python. Sem autograd, sem frameworks: cada camada é re-implementada com seu próprio passe para frente e para trás. Gradientes são calculados manualmente, atualizações são transparentes, e cada operação é especificada.",
  "fake-news-desc": "Sistema de IA multi-modal para detecção de desinformação usando arquiteturas transformer. Inclui análise de stance e pontuação de credibilidade de fontes.",
  "unimusic-desc": "Plataforma escalável de descoberta musical com arquitetura híbrida MongoDB/Neo4j. Lida com milhões de faixas com algoritmos de recomendação em tempo real.",
  "voice-vibes-desc": "Sistema de reconhecimento de emoção vocal com seis arquiteturas de IA inovadoras. Alcançou 94% de precisão usando métodos ensemble e engenharia de características avançada.",
  "federated-dbscan-desc": "Clustering distribuído preservando privacidade com federated learning. Habilita ML colaborativo sem compartilhamento de dados, alcançando 99% de preservação de privacidade.",
  "pagerank-desc": "Implementação de alto desempenho do algoritmo PageRank com operações otimizadas de matriz esparsa. Lida com grafos com milhões de nós eficientemente.",
  
  "cta-title": "Vamos Construir Juntos o Futuro da IA",
  "cta-description": "Seja procurando colaborar em pesquisa de ponta, discutir o mais recente em LLMs multilingues, ou explorar como IA pode transformar seu negócio, sempre estou empolgado para conectar com inovadores e solucionadores de problemas.",
  "cta-button1": "Iniciar uma Conversa",
  "cta-button2": "Enviar Email Direto",
  
  "contact-title": "Contato",
  "contact-description": "Vamos nos conectar! Seja para discutir IA, machine learning, ou colaborações potenciais, sempre estou aberto a conversas interessantes.",
  "location-label": "Local",
  "location": "Roma, Itália",
  "form-name": "Seu Nome",
  "form-email": "Seu Email",
  "form-subject": "Assunto",
  "form-message": "Mensagem",
  "form-loading": "Carregando",
  "form-success": "Sua mensagem foi enviada. Obrigado!",
  "form-send": "Enviar Mensagem"
} 