{
  "nav-home": "Início",
  "nav-about": "Sobre",
  "nav-tech": "Tecnologia",
  "nav-resume": "Currículo",
  "nav-portfolio": "Portfólio",
  "nav-contact": "Contato",
  "language-label": "Idioma",
  "language-selector-header": "Selecione o idioma ({count} disponível)",
  "hero-subtitle": "Fazer com que a IA fale a sua língua, um modelo de cada vez",
  "multilingual-typed": [
    "I train LLMs to speak your language.",
    "我训练大型语言模型来讲你的语言。",
    "Entreno LLMs para hablar tu idioma.",
    "Ich trainiere LLMs, damit sie deine Sprache sprechen.",
    "J'entraîne des LLM pour qu'ils parlent votre langue.",
    "あなたの言語を话せるように、LLMを訓練しています。",
    "Treino LLMs para falar o seu idioma.",
    "أقوم بتدريب LLM لتتحدث لغتك.",
    "Alleno LLM per parlare la tua lingua.",
    "Я обучаю LLM говорить на вашем языке."
  ],
  "about-title": "Sobre mim em O(1)",
  "about-description": "Sou investigador e engenheiro de IA focado em modelos de linguagem grandes e multilingues.",
  "about-role": "Engenheiro/a e Pesquisador/a de IA",
  "about-intro": "Na Translated, ajudei a construir a Lara desde o primeiro dia, um LLM de tradução automática que alimenta conteúdo em tempo real para a Airbnb, Uber, Shopify e outros, atingindo mais de 200 milhões de utilizadores.",
  "birth-place-label": "Local de Nascimento:",
  "birth-place": "Nápoles, Itália",
  "email-label": "E-mail:",
  "city-label": "Cidade:",
  "city": "Roma, Itália",
  "masters-label": "Mestrado:",
  "masters-degree": "IA e engenharia de dados",
  "bachelors-label": "Licenciatura:",
  "bachelors-degree": "Engenharia Informática",
  "university-label": "Universidade:",
  "university": "Universidade de Pisa",
  "languages-label": "Idiomas:",
  "languages": "Italiano, Inglês",
  "focus-label": "Foco:",
  "focus": "LLMs Multilingues",
  "about-conclusion": "Aumentei o treino para mais de 1000 GPU e expandi a cobertura de tradução automática para 201 idiomas. Cofundei a <a href=\"https://picarta.ai/\" target=\"_blank\" style=\"color: var(--accent-primary); text-decoration: none; font-weight: 600;\">Picarta.ai</a>, uma startup de IA que está a construir uma plataforma para geolocalização de imagens. Sou um aprendiz voraz que se esforça constantemente para melhorar a forma como penso, treino e construo. Não consigo imaginar uma vida sem alguma forma de treino, seja com GPUs, pesos no ginásio ou preparação para uma maratona.",
  "tech-title": "Tecnologias e Ferramentas",
  "focus-title": "Foco atual",
  "focus-description": "O que estou a construir e a pesquisar neste momento",
  "focus-scaling-title": "Dimensionamento da tradução automática para 201 idiomas",
  "focus-scaling-desc": "Expandir a cobertura da tradução automática, mantendo a qualidade. Trabalhar com grandes conjuntos de dados multilíngues e otimizar para idiomas com poucos recursos usando técnicas avançadas de aprendizagem de transferência.",
  "focus-production-title": "IA multilingue em produção",
  "focus-production-desc": "Construir sistemas de tradução robustos que lidem com a complexidade do mundo real em escala. Enfrentar desafios como a mudança de código, a adaptação de domínio, o conteúdo ruidoso gerado pelo utilizador e a manutenção da qualidade em mais de 200 milhões de utilizadores diários.",
  "tag-realtime": "Serviço em tempo real",
  "tag-quality": "Garantia de qualidade",
  "resume-title": "Currículo",
  "resume-description": "Engenheiro e Investigador de IA com vasta experiência na construção e dimensionamento de sistemas de tradução automática multilingue. Histórico comprovado de serviço a mais de 200 milhões de utilizadores através de soluções LLM inovadoras.",
  "experience-title": "Experiência Profissional",
  "current-role": "Engenheiro/a e Pesquisador/a de IA",
  "current-company": "Translated, Roma, Itália",
  "lara-desc": "<strong>Lara:</strong> trabalhou no pipeline completo de I+D de um LLM otimizado para tradução automática: desde a recolha de dados e formação de modelos até à otimização de alinhamento e inferência. Construído a partir do zero dentro de uma equipa de quatro pessoas ao estilo de uma startup que opera dentro da empresa. Agora, o principal produto B2B, traduz todo o conteúdo em todo o mundo para a Airbnb e a maior parte da Uber, Shopify, Nike e muito mais, atingindo mais de 200 milhões de utilizadores em todo o mundo. Também foi lançada recentemente uma versão B2C.",
  "try-here": "Experimente aqui",
  "lara-grande-desc": "<strong>Lara Grande:</strong> papel fundamental na escalação do LLM para corresponder à qualidade do 1% superior dos tradutores profissionais. Utilizou mais de 1000 GPU no cluster HPC da CINECA para formação distribuída em grande escala.",
  "language-expansion-desc": "<strong>Expansão de idiomas:</strong> Identificou e liderou um projeto de investigação bem-sucedido para expandir a cobertura de produção de tradução automática de 56 para 201 idiomas, um aumento de 4 vezes, tornando-o o primeiro motor de tradução automática comercial a suportar tal variedade. Propôs a direção, concebeu o plano de implementação e levou-o à conclusão em oito meses.",
  "instruction-mt-desc": "<strong>Tradução automática que segue instruções:</strong> liderou a pesquisa alinhando o LLM para seguir guias de estilo detalhados usando SFT e DPO.",
  "trust-attention-desc": "<strong>Foco na confiança:</strong> propus e validei uma nova técnica que prioriza dados de treino de alto valor, alcançando as melhorias mais significativas na qualidade da tradução automática em cinco anos.",
  "polyglot-desc": "<strong>Polyglot:</strong> desenvolveu um modelo de identificação de idiomas que suporta 201 idiomas.",
  "startup-title": "Experiência em Startups",
  "startup-role": "Cofundador e Engenheiro de IA",
  "italy": "Itália",
  "startup-desc1": "Cofundou uma startup de IA como parte de uma equipa fundadora de três pessoas que desenvolveu uma plataforma de geolocalização de imagens",
  "startup-desc2": "Desenvolveu o modelo principal para geolocalização de imagens usando transformadores de visão e técnicas baseadas em recuperação",
  "startup-desc3": "Adquiriu experiência valiosa em ambiente de startup de ritmo acelerado e desenvolvimento de produtos",
  "startup-desc4": "Aprendeu lições cruciais sobre a dinâmica da equipa, gestão da incerteza e iteração rápida",
  "education-title": "Educação",
  "masters-full": "Mestrado em Inteligência Artificial e Engenharia de Dados",
  "university-location": "Universidade de Pisa, Pisa, Itália",
  "masters-description": "110/110 summa cum laude (4,0 GPA). Especializado em Mineração de Dados, Aprendizagem Automática, Visão de Máquina, Processamento de Linguagem Natural, Teoria de Otimização e Mineração de Processos. Adquiriu experiência prática com Sistemas Distribuídos, Computação em Nuvem e ferramentas como MongoDB, Neo4j, Docker, Kubernetes, TensorFlow e PyTorch.",
  "bachelors-full": "Bacharelato em Engenharia Informática",
  "bachelors-description": "110/110 (4,0 GPA). Forte base em engenharia informática, incluindo matemática, física, algoritmos, bases de dados, arquitetura de computadores, redes de computadores, sistemas operativos e programação em C, C++, Java, Python, Matlab, SQL, JavaScript e PHP.",
  "portfolio-title": "Portfólio",
  "portfolio-description": "Uma coleção dos meus projetos de IA e aprendizagem automática, desde investigação académica a sistemas de produção que servem milhões de utilizadores em todo o mundo.",
  "t4sa-desc": "Sistema de análise de sentimento visual intermodal usando destilação de conhecimento de texto para modelos de visão. Publicado na ECAI 2023, alcançando resultados de última geração na previsão de sentimentos visuais.",
  "numpygpt-desc": "Um GPT criado a partir do zero com a biblioteca padrão NumPy e Python. Sem autograd, sem estruturas: cada camada é reimplementada com o seu próprio passo para a frente e para trás. Os gradientes são calculados manualmente, as atualizações são transparentes e todas as operações são explicitadas.",
  "fake-news-desc": "Sistema de IA multimodal para deteção de desinformação utilizando arquiteturas de transformadores. Inclui análise de posicionamento e classificação de credibilidade da fonte.",
  "unimusic-desc": "Plataforma de descoberta de música escalável com arquitetura híbrida MongoDB/Neo4j. Lida com milhões de faixas com algoritmos de recomendação em tempo real.",
  "voice-vibes-desc": "Sistema de reconhecimento de emoções de fala com seis novas arquiteturas de IA. Alcançou 94% de precisão usando métodos de conjunto e engenharia de recursos avançada.",
  "federated-dbscan-desc": "Agrupamento distribuído que preserva a privacidade com aprendizagem federada. Permite ML colaborativo sem partilha de dados, alcançando 99% de preservação da privacidade.",
  "pagerank-desc": "Implementação de algoritmo PageRank de alto desempenho com operações de matriz dispersa otimizadas. Lida com gráficos com milhões de nós de forma eficiente.",
  "contact-title": "Contato",
  "contact-description": "Vamos conversar! Quer pretenda discutir IA, aprendizagem automática ou potenciais colaborações, estou sempre disponível para conversas interessantes.",
  "location-label": "Localização:",
  "location": "Roma, Itália",
  "form-name": "Seu Nome",
  "form-email": "Seu E-mail",
  "form-subject": "Assunto",
  "form-message": "Mensagem",
  "form-loading": "A carregar",
  "form-success": "A sua mensagem foi enviada. Obrigado!",
  "form-send": "Enviar Mensagem",
  "tech-pytorch": "Aprendizagem profunda",
  "tech-python": "Idioma principal",
  "tech-slurm": "Agendamento de tarefas HPC",
  "tech-vllm": "Serviço de LLM de alto desempenho",
  "tech-transformers": "LLMs e NLP",
  "tech-mongodb": "Armazenamento de dados",
  "tech-docker": "Contentorização",
  "tech-git": "Controlo de versão",
  "tag-data": "Dados"
}