{
  "nav-home": "Главная",
  "nav-about": "Обо мне",
  "nav-tech": "Технологический стек",
  "nav-resume": "Резюме",
  "nav-portfolio": "Портфолио",
  "nav-contact": "Контакты",
  "language-label": "Язык",
  "language-selector-header": "Выберите язык (доступно {count})",
  "hero-subtitle": "Заставляем ИИ говорить на вашем языке, по одной модели за раз",
  "multilingual-typed": [
    "I train LLMs to speak your language.",
    "我训练大型语言模型来讲你的语言。",
    "Entreno LLMs para hablar tu idioma.",
    "Ich trainiere LLMs, damit sie deine Sprache sprechen.",
    "J'entraîne des LLM pour qu'ils parlent votre langue.",
    "あなたの言語を话せるように、LLMを訓練しています。",
    "Treino LLMs para falar o seu idioma.",
    "أقوم بتدريب LLM لتتحدث لغتك.",
    "Alleno LLM per parlare la tua lingua.",
    "Я обучаю LLM говорить на вашем языке."
  ],
  "about-title": "Обо мне в O(1)",
  "about-description": "Я исследователь и инженер в области ИИ, специализирующийся на многоязычных больших языковых моделях.",
  "about-role": "Инженер и исследователь в области ИИ",
  "about-intro": "В Translated я с первого дня помогал создавать Lara, LLM машинного перевода, который обеспечивает контент в режиме реального времени для Airbnb, Uber, Shopify и других, охватывая более 200 миллионов пользователей.",
  "birth-place-label": "Место рождения:",
  "birth-place": "Неаполь, Италия",
  "email-label": "Электронная почта:",
  "city-label": "Город:",
  "city": "Рим, Италия",
  "masters-label": "Степень магистра:",
  "masters-degree": "ИИ и инженерия данных",
  "bachelors-label": "Степень бакалавра:",
  "bachelors-degree": "Компьютерная инженерия",
  "university-label": "Университет:",
  "university": "Пизанский университет",
  "languages-label": "Языки:",
  "languages": "Итальянский, английский",
  "focus-label": "Фокус:",
  "focus": "Многоязычные LLM",
  "about-conclusion": "Я увеличил масштаб обучения до 1000+ графических процессоров и расширил охват машинного перевода до 201 языка. Я стал соучредителем <a href=\"https://picarta.ai/\" target=\"_blank\" style=\"color: var(--accent-primary); text-decoration: none; font-weight: 600;\">Picarta.ai</a>, стартапа в области ИИ, который создает платформу для геолокации изображений. Я любознательный человек, который постоянно стремится улучшить свое мышление, обучение и навыки. Я не могу представить себе жизнь без какой-либо формы обучения, будь то графические процессоры, тренажерные залы или подготовка к марафону.",
  "tech-title": "Технологии и инструменты",
  "focus-title": "Текущий фокус",
  "focus-description": "Что я сейчас создаю и исследую",
  "focus-scaling-title": "Масштабирование машинного перевода на 201 язык",
  "focus-scaling-desc": "Расширение охвата машинного перевода при сохранении качества. Работа с массивными многоязычными наборами данных и оптимизация для языков с малым количеством ресурсов с использованием передовых методов обучения с переносом.",
  "focus-production-title": "Многоязычный ИИ в производстве",
  "focus-production-desc": "Создание надежных систем перевода, которые справляются с реальными сложностями в больших масштабах. Решение таких проблем, как переключение кода, адаптация домена, шумный пользовательский контент и поддержание качества для более 200 миллионов пользователей ежедневно.",
  "tag-realtime": "Обслуживание в реальном времени",
  "tag-quality": "Обеспечение качества",
  "resume-title": "Резюме",
  "resume-description": "Инженер и исследователь в области ИИ с большим опытом создания и масштабирования многоязычных систем машинного перевода. Обслуживание более 200 миллионов пользователей с помощью инновационных решений LLM.",
  "experience-title": "Профессиональный опыт",
  "current-role": "Инженер и исследователь в области ИИ",
  "current-company": "Translated, Рим, Италия",
  "lara-desc": "<strong>Лара:</strong> работала над полным циклом исследований и разработок LLM, оптимизированной для машинного перевода: от сбора данных и обучения моделей до оптимизации выравнивания и вывода. Создан с нуля командой из четырех человек в стиле стартапа, работающей внутри компании. Теперь это флагманский продукт B2B, который переводит весь контент по всему миру для Airbnb и большей части Uber, Shopify, Nike и других компаний, охватывая более 200 миллионов пользователей по всему миру. Недавно также была запущена версия B2C.",
  "try-here": "Попробуйте здесь",
  "lara-grande-desc": "<strong>Lara Grande:</strong> ключевая роль в масштабировании LLM для соответствия качеству 1% лучших профессиональных переводчиков. Использовано более 1000 графических процессоров в кластере высокопроизводительных вычислений CINECA для крупномасштабного распределенного обучения.",
  "language-expansion-desc": "<strong>Расширение языкового охвата:</strong> определил и возглавил успешный исследовательский проект по расширению охвата машинного перевода с 56 до 201 языка, что в 4 раза больше, в результате чего он стал первым коммерческим механизмом машинного перевода, поддерживающим такой диапазон. Предложил направление, разработал план реализации и привел его к завершению в течение восьми месяцев.",
  "instruction-mt-desc": "<strong>Машинный перевод с соблюдением инструкций:</strong> проведено исследование, направленное на согласование LLM с подробными руководствами по стилю с использованием SFT и DPO.",
  "trust-attention-desc": "<strong>Внимание к доверию:</strong> предложил и утвердил новую технику, приоритизирующую высокоценные данные обучения, и добился наиболее значительного улучшения качества машинного перевода за пять лет.",
  "polyglot-desc": "<strong>Polyglot:</strong> Разработала модель идентификации языка, поддерживающую 201 язык.",
  "startup-title": "Опыт работы в стартапе",
  "startup-role": "Соучредитель и инженер по искусственному интеллекту",
  "italy": "Италия",
  "startup-desc1": "Соучредитель стартапа в области ИИ в составе команды из трех человек, занимающейся созданием платформы геолокализации изображений",
  "startup-desc2": "Разработала основную модель для геолокализации изображений с использованием визуальных трансформеров и методов, основанных на поиске",
  "startup-desc3": "Получил ценный опыт в быстро развивающейся стартап-среде и разработке продуктов",
  "startup-desc4": "Получены важные уроки о динамике команды, управлении неопределенностью и быстрой итерации",
  "education-title": "Образование",
  "masters-full": "Магистр наук в области искусственного интеллекта и инженерии данных",
  "university-location": "Пизанский университет, Пиза, Италия",
  "masters-description": "110/110 с отличием (4.0 GPA). Специализируется на интеллектуальном анализе данных, машинном обучении, компьютерном зрении, обработке естественного языка, теории оптимизации и анализе процессов. Получил практический опыт работы с распределенными системами, облачными вычислениями и такими инструментами, как MongoDB, Neo4j, Docker, Kubernetes, TensorFlow и PyTorch.",
  "bachelors-full": "Бакалавр наук в области компьютерной инженерии",
  "bachelors-description": "110/110 (4.0 GPA). Прочная основа в области компьютерной инженерии, включая математику, физику, алгоритмы, базы данных, компьютерную архитектуру, компьютерные сети, операционные системы и программирование на C, C++, Java, Python, Matlab, SQL, JavaScript и PHP.",
  "portfolio-title": "Портфолио",
  "portfolio-description": "Коллекция моих проектов в области ИИ и машинного обучения, от академических исследований до производственных систем, обслуживающих миллионы пользователей по всему миру.",
  "t4sa-desc": "Система кросс-модального визуального анализа тональности с использованием дистилляции знаний из текстовых моделей в визуальные. Опубликовано на ECAI 2023, достигнуты современные результаты в области прогнозирования визуальных настроений.",
  "numpygpt-desc": "GPT, созданный с нуля с помощью NumPy и стандартной библиотеки Python. Никаких автоградов, никаких фреймворков: каждый слой повторно реализуется с собственным прямым и обратным проходом. Градиенты вычисляются вручную, обновления прозрачны, и каждая операция прописана.",
  "fake-news-desc": "Мультимодальная система ИИ для обнаружения дезинформации с использованием архитектур трансформеров. Включает анализ позиции и оценку достоверности источника.",
  "unimusic-desc": "Масштабируемая платформа для поиска музыки с гибридной архитектурой MongoDB/Neo4j. Обрабатывает миллионы треков с помощью алгоритмов рекомендаций в режиме реального времени.",
  "voice-vibes-desc": "Система распознавания эмоций речи с шестью новыми архитектурами ИИ. Достигнута точность 94% с использованием ансамблевых методов и передовой разработки функций.",
  "federated-dbscan-desc": "Сохраняющая конфиденциальность распределенная кластеризация с федеративным обучением. Обеспечивает совместное машинное обучение без обмена данными, сохраняя конфиденциальность на 99%.",
  "pagerank-desc": "Высокопроизводительная реализация алгоритма PageRank с оптимизированными операциями разреженных матриц. Эффективно обрабатывает графы с миллионами узлов.",
  "contact-title": "Контакты",
  "contact-description": "Давайте пообщаемся! Хотите обсудить ИИ, машинное обучение или потенциальное сотрудничество? Я всегда открыт для интересных разговоров.",
  "location-label": "Местоположение:",
  "location": "Рим, Италия",
  "form-name": "Ваше имя",
  "form-email": "Ваш адрес электронной почты",
  "form-subject": "Тема",
  "form-message": "Сообщение",
  "form-loading": "Загрузка",
  "form-success": "Ваше сообщение отправлено. Спасибо!",
  "form-send": "Отправить сообщение",
  "tech-pytorch": "Глубокое обучение",
  "tech-python": "Основной язык",
  "tech-slurm": "Планирование заданий HPC",
  "tech-vllm": "Высокопроизводительное обслуживание LLM",
  "tech-transformers": "LLMs и NLP",
  "tech-mongodb": "Хранение данных",
  "tech-docker": "Контейнеризация",
  "tech-git": "Управление версиями",
  "tag-data": "Данные"
}