{
  "nav-home": "Domov",
  "nav-about": "O mne",
  "nav-tech": "Technológie",
  "nav-resume": "Životopis",
  "nav-portfolio": "Portfólio",
  "nav-contact": "Kontakt",
  "language-label": "Jazyk",
  "language-selector-header": "Vyberte jazyk ({count} k dispozícii)",
  "hero-subtitle": "Ako naučiť umelú inteligenciu hovoriť vaším jazykom, jeden model po druhom",
  "multilingual-typed": [
    "I train LLMs to speak your language.",
    "我训练大型语言模型来讲你的语言。",
    "Entreno LLMs para hablar tu idioma.",
    "Ich trainiere LLMs, damit sie deine Sprache sprechen.",
    "J'entraîne des LLM pour qu'ils parlent votre langue.",
    "あなたの言語を话せるように、LLMを訓練しています。",
    "Treino LLMs para falar o seu idioma.",
    "أقوم بتدريب LLM لتتحدث لغتك.",
    "Alleno LLM per parlare la tua lingua.",
    "Я обучаю LLM говорить на вашем языке."
  ],
  "about-title": "O mne",
  "about-description": "Som výskumník a inžinier v oblasti umelej inteligencie zameraný na viacjazyčné veľké jazykové modely.",
  "about-role": "Inžinier a výskumník v oblasti umelej inteligencie",
  "about-intro": "V spoločnosti Translated som od prvého dňa pomáhal budovať LLM strojového prekladu Lara, ktorý v reálnom čase poháňa obsah pre Airbnb, Uber, Shopify a ďalšie spoločnosti a oslovuje viac ako 200 miliónov používateľov.",
  "birth-place-label": "Miesto narodenia:",
  "birth-place": "Neapol, Taliansko",
  "email-label": "E-mail:",
  "city-label": "Mesto:",
  "city": "Rím, Taliansko",
  "masters-label": "Magisterský titul:",
  "masters-degree": "AI a dátové inžinierstvo",
  "bachelors-label": "Bakalársky titul:",
  "bachelors-degree": "Počítačové inžinierstvo",
  "university-label": "Univerzita:",
  "university": "Univerzita v Pise",
  "languages-label": "Jazyky:",
  "languages": "Taliančina, angličtina",
  "focus-label": "Zameranie:",
  "focus": "Viacjazyčné LLM",
  "about-conclusion": "Školenie som rozšíril na viac ako 1 000 GPU a pokrytie strojového prekladu som rozšíril na 201 jazykov. Som spoluzakladateľom <a href=\"https://picarta.ai/\" target=\"_blank\" style=\"color: var(--accent-primary); text-decoration: none; font-weight: 600;\">Picarta.ai</a>, startupu v oblasti umelej inteligencie, ktorý vytvára platformu na geolokalizáciu obrázkov. Som nenásytný študent, ktorý sa neustále snaží zlepšovať spôsob, akým premýšľa, trénuje a vytvára. Neviem si predstaviť život bez nejakej formy tréningu, či už ide o GPU, činky v posilňovni alebo prípravu na maratón.",
  "tech-title": "Technológie a nástroje",
  "tech-pytorch": "Hĺbkové učenie",
  "tech-python": "Primárny jazyk",
  "tech-slurm": "Plánovanie úloh HPC",
  "tech-vllm": "Vysokovýkonné LLM",
  "tech-transformers": "LLM a NLP",
  "tech-mongodb": "Ukladanie údajov",
  "tech-docker": "Kontajnerizácia",
  "tech-git": "Správa verzií",
  "focus-title": "Súčasné zameranie",
  "focus-description": "Čo práve budujem a skúmam",
  "focus-scaling-title": "Škálovanie strojového prekladu na 201 jazykov",
  "focus-scaling-desc": "Rozširovanie pokrytia strojového prekladu pri zachovaní kvality. Práca s rozsiahlymi viacjazyčnými súbormi údajov a optimalizácia pre jazyky s nízkymi zdrojmi pomocou pokročilých techník transferového učenia.",
  "focus-production-title": "Viacjazyčná umelá inteligencia vo výrobe",
  "focus-production-desc": "Vytvárame robustné prekladateľské systémy, ktoré dokážu zvládnuť zložitosti reálneho sveta vo veľkom meradle. Riešime výzvy, ako sú prepínanie kódov, prispôsobenie domény, rušivý obsah vytvorený používateľmi a udržiavanie kvality pre viac ako 200 miliónov používateľov denne.",
  "tag-realtime": "Poskytovanie v reálnom čase",
  "tag-quality": "Zabezpečenie kvality",
  "tag-data": "Údaje",
  "resume-title": "Životopis",
  "resume-description": "Inžinier a výskumník v oblasti umelej inteligencie s rozsiahlymi skúsenosťami v oblasti budovania a škálovania viacjazyčných systémov strojového prekladu. Preukázateľné skúsenosti s poskytovaním služieb viac ako 200 miliónom používateľov prostredníctvom inovatívnych riešení LLM.",
  "experience-title": "Pracovné skúsenosti",
  "current-role": "Inžinier a výskumník v oblasti umelej inteligencie",
  "current-company": "Translated, Rím, Taliansko",
  "lara-desc": "<strong>Lara:</strong> Pracovala na celom výskumnom a vývojovom procese veľkého jazykového modelu optimalizovaného na strojový preklad: od zhromažďovania údajov a tréningu modelov až po optimalizáciu zarovnania a inferencie. Vybudované od nuly v rámci štvorčlenného tímu v štýle startupu pôsobiaceho v rámci spoločnosti. Teraz je to vlajkový produkt B2B, ktorý prekladá všetok obsah na celom svete pre Airbnb a väčšinu spoločností Uber, Shopify, Nike a ďalšie, pričom oslovuje viac ako 200 miliónov používateľov na celom svete. Nedávno bola spustená aj verzia B2C.",
  "try-here": "Vyskúšajte to tu",
  "lara-grande-desc": "<strong>Lara Grande:</strong> Kľúčová úloha pri škálovaní LLM tak, aby zodpovedala kvalite 1 % najlepších profesionálnych prekladateľov. Na rozsiahle distribuované školenie sa použilo viac ako 1 000 GPU v klastri HPC spoločnosti CINECA.",
  "language-expansion-desc": "<strong>Jazykové rozšírenie:</strong> Identifikoval a viedol úspešný výskumný projekt na rozšírenie pokrytia strojového prekladu z 56 na 201 jazykov, čo predstavuje 4-násobné zvýšenie, čím sa stal prvým komerčným nástrojom strojového prekladu, ktorý podporuje takýto rozsah. Navrhol som smer, navrhol som plán implementácie a viedol som ho k dokončeniu do ôsmich mesiacov.",
  "instruction-mt-desc": "<strong>Strojový preklad podľa pokynov:</strong> Viedol výskum zameraný na zosúladenie LLM s podrobnými štýlovými príručkami pomocou SFT a DPO.",
  "trust-attention-desc": "<strong>Dôvera a pozornosť:</strong> Navrhnutá a overená nová technika uprednostňujúca vysoko hodnotné tréningové údaje, ktorá dosiahla najvýznamnejšie zlepšenia kvality strojového prekladu za päť rokov.",
  "polyglot-desc": "<strong>Polyglot:</strong> Vytvoril model identifikácie jazyka podporujúci 201 jazykov.",
  "startup-title": "Skúsenosti so startupmi",
  "startup-role": "Spoluzakladateľ a inžinier AI",
  "italy": "Taliansko",
  "startup-desc1": "Spoluzaložil startup v oblasti umelej inteligencie ako súčasť trojčlenného zakladajúceho tímu, ktorý vytvára platformu na geolokalizáciu obrázkov",
  "startup-desc2": "Vyvinutie základného modelu pre geolokalizáciu obrazu pomocou vizuálnych transformátorov a techník založených na vyhľadávaní",
  "startup-desc3": "Získal som cenné skúsenosti v rýchlo sa rozvíjajúcom prostredí startupov a vývoji produktov",
  "startup-desc4": "Získali sme dôležité poznatky o tímovej dynamike, riadení neistoty a rýchlej iterácii",
  "education-title": "Vzdelanie",
  "masters-full": "M.S. Umelá inteligencia a dátové inžinierstvo",
  "university-location": "Univerzita v Pise, Pisa, Taliansko",
  "masters-description": "110/110 summa cum laude (4,0 GPA). Špecializácia na ťažbu údajov, strojové učenie, počítačové videnie, spracovanie prirodzeného jazyka, teóriu optimalizácie a ťažbu procesov. Získal som praktické skúsenosti s distribuovanými systémami, cloud computingom a nástrojmi ako MongoDB, Neo4j, Docker, Kubernetes, TensorFlow a PyTorch.",
  "bachelors-full": "Bakalársky titul v odbore počítačové inžinierstvo",
  "bachelors-description": "110/110 (4,0 GPA). Silné základy v počítačovom inžinierstve vrátane matematiky, fyziky, algoritmov, databáz, počítačovej architektúry, počítačových sietí, operačných systémov a programovania v jazykoch C, C++, Java, Python, Matlab, SQL, JavaScript a PHP.",
  "portfolio-title": "Portfólio",
  "portfolio-description": "Zbierka mojich projektov v oblasti umelej inteligencie a strojového učenia, od akademického výskumu až po výrobné systémy, ktoré slúžia miliónom používateľov na celom svete.",
  "t4sa-desc": "Systém analýzy vizuálnych sentimentov pomocou destilácie poznatkov z textových do vizuálnych modelov. Publikované na ECAI 2023, dosahujúce najmodernejšie výsledky v oblasti predpovede vizuálnych sentimentov.",
  "numpygpt-desc": "GPT od nuly vytvorený pomocou NumPy a štandardnej knižnice Pythonu. Žiadny autograd, žiadne rámce: každá vrstva je znovu implementovaná s vlastným dopredu a dozadu. Gradienty sa počítajú manuálne, aktualizácie sú transparentné a každá operácia je vysvetlená.",
  "fake-news-desc": "Multimodálny systém umelej inteligencie na detekciu dezinformácií pomocou transformátorových architektúr. Obsahuje analýzu postojov a hodnotenie dôveryhodnosti zdrojov.",
  "unimusic-desc": "Škálovateľná platforma na objavovanie hudby s hybridnou architektúrou MongoDB/Neo4j. Spracováva milióny skladieb pomocou algoritmov odporúčaní v reálnom čase.",
  "voice-vibes-desc": "Systém rozpoznávania emócií v reči so šiestimi novými architektúrami umelej inteligencie. Dosiahnutá presnosť 94 % pomocou metód súboru a pokročilého inžinierstva funkcií.",
  "federated-dbscan-desc": "Distribuované zoskupovanie chrániace súkromie s federovaným učením. Umožňuje kolaboratívne strojové učenie bez zdieľania údajov, čím sa dosiahne 99 % ochrana súkromia.",
  "pagerank-desc": "Implementácia algoritmu PageRank s vysokým výkonom a optimalizovanými operáciami s riedkymi maticami. Efektívne spracováva grafy s miliónmi uzlov.",
  "contact-title": "Kontakt",
  "contact-description": "Spojme sa! Či už chcete diskutovať o umelej inteligencii, strojovom učení alebo potenciálnej spolupráci, som vždy otvorený zaujímavým rozhovorom.",
  "location-label": "Poloha:",
  "location": "Rím, Taliansko",
  "form-name": "Vaše meno",
  "form-email": "Váš e-mail",
  "form-subject": "Predmet",
  "form-message": "Správa",
  "form-loading": "Načítava sa",
  "form-success": "Vaša správa bola odoslaná. Ďakujeme!",
  "form-send": "Odoslať"
}