{
  "nav-home": "Hem",
  "nav-about": "Om",
  "nav-tech": "Teknikstack",
  "nav-resume": "CV",
  "nav-portfolio": "Portfölj",
  "nav-contact": "Kontakt",
  "language-label": "Språk",
  "language-selector-header": "Välj språk ({count} tillgängliga)",
  "hero-subtitle": "Få AI att tala ditt språk, en modell i taget",
  "multilingual-typed": [
    "I train LLMs to speak your language.",
    "我训练大型语言模型来讲你的语言。",
    "Entreno LLMs para hablar tu idioma.",
    "Ich trainiere LLMs, damit sie deine Sprache sprechen.",
    "J'entraîne des LLM pour qu'ils parlent votre langue.",
    "あなたの言語を话せるように、LLMを訓練しています。",
    "Treino LLMs para falar o seu idioma.",
    "أقوم بتدريب LLM لتتحدث لغتك.",
    "Alleno LLM per parlare la tua lingua.",
    "Я обучаю LLM говорить на вашем языке."
  ],
  "about-title": "Om mig i O(1)",
  "about-description": "Jag är en AI-forskare och ingenjör med fokus på flerspråkiga stora språkmodeller.",
  "about-role": "AI-ingenjör och forskare",
  "about-intro": "På Translated hjälpte jag till att bygga Lara från dag ett, en maskinöversättnings-LLM som driver innehåll i realtid för Airbnb, Uber, Shopify och andra, och når över 200 miljoner användare.",
  "birth-place-label": "Födelseort:",
  "birth-place": "Neapel, Italien",
  "email-label": "E-post:",
  "city-label": "Stad:",
  "city": "Rom, Italien",
  "masters-label": "Magisterexamen:",
  "masters-degree": "AI och datateknik",
  "bachelors-label": "Kandidatexamen:",
  "bachelors-degree": "Datateknik",
  "university-label": "Universitet:",
  "university": "Universitetet i Pisa",
  "languages-label": "Språk:",
  "languages": "Italienska, engelska",
  "focus-label": "Fokus:",
  "focus": "Flerspråkiga LLM:er",
  "about-conclusion": "Jag har skalat upp utbildningen till över 1 000 GPU:er och utökat maskinöversättningens täckning till 201 språk. Jag var med och grundade <a href=\"https://picarta.ai/\" target=\"_blank\" style=\"color: var(--accent-primary); text-decoration: none; font-weight: 600;\">Picarta.ai</a>, ett AI-startupföretag som bygger en plattform för bildgeolokalisering. Jag är en glupsk elev som ständigt strävar efter att förbättra hur jag tänker, tränar och bygger. Jag kan inte föreställa mig ett liv utan någon form av träning, oavsett om det är GPU:er, gymplattor eller maratonförberedelser.",
  "tech-title": "Teknik och verktyg",
  "tech-pytorch": "Djupinlärning",
  "tech-python": "Primärt språk",
  "tech-slurm": "HPC-jobbschemaläggning",
  "tech-vllm": "Högpresterande LLM-servering",
  "tech-transformers": "LLMs och NLP",
  "tech-mongodb": "Datalagring",
  "tech-docker": "Containerisering",
  "tech-git": "Versionskontroll",
  "focus-title": "Nuvarande fokus",
  "focus-description": "Vad jag bygger och forskar om just nu",
  "focus-scaling-title": "Skala maskinöversättning till 201 språk",
  "focus-scaling-desc": "Utöka maskinöversättningens täckning samtidigt som kvaliteten bibehålls. Arbeta med massiva flerspråkiga dataset och optimera för språk med låga resurser med hjälp av avancerade överföringsinlärningstekniker.",
  "focus-production-title": "Flerspråkig AI i produktion",
  "focus-production-desc": "Bygga robusta översättningssystem som hanterar verklig komplexitet i stor skala. Att hantera utmaningar som kodväxling, domänanpassning, bullrigt användargenererat innehåll och bibehålla kvalitet för över 200 miljoner dagliga användare.",
  "tag-realtime": "Servering i realtid",
  "tag-quality": "Kvalitetssäkring",
  "tag-data": "Data",
  "resume-title": "CV",
  "resume-description": "AI-ingenjör och forskare med lång erfarenhet av att bygga och skala flerspråkiga maskinöversättningssystem. Bevisad erfarenhet av att betjäna över 200 miljoner användare genom innovativa LLM-lösningar.",
  "experience-title": "Arbetslivserfarenhet",
  "current-role": "AI-ingenjör och forskare",
  "current-company": "Translated, Rom, Italien",
  "lara-desc": "<strong>Lara:</strong> Arbetade med hela FoU-pipelinen för en LLM optimerad för maskinöversättning: från datainsamling och modellträning till justering och slutledningsoptimering. Byggdes från grunden inom ett startup-liknande team på fyra personer som arbetar inom företaget. Nu är det flaggskeppsprodukten B2B, som översätter allt innehåll över hela världen för Airbnb och det mesta av Uber, Shopify, Nike och mer, och når över 200 miljoner användare globalt. En B2C-version har också nyligen lanserats.",
  "try-here": "Prova det här",
  "lara-grande-desc": "<strong>Lara Grande:</strong> Nyckelroll i skalning av LLM för att matcha kvaliteten på de bästa 1 % av professionella översättare. Använde över 1 000 GPU:er på CINECA:s HPC-kluster för storskalig distribuerad utbildning.",
  "language-expansion-desc": "<strong>Språkutvidgning:</strong> Identifierade och ledde ett framgångsrikt forskningsprojekt för att utöka maskinöversättningens täckning från 56 till 201 språk, en fyrdubbling, vilket gör det till den första kommersiella maskinöversättningsmotorn som stöder ett sådant utbud. Föreslog riktningen, utformade genomförandeplanen och ledde den till slutförande inom åtta månader.",
  "instruction-mt-desc": "<strong>Instruktionsföljande maskinöversättning:</strong> Ledde forskning som anpassade LLM för att följa detaljerade stilguider med hjälp av SFT och DPO.",
  "trust-attention-desc": "<strong>Förtroendeuppmärksamhet:</strong> Föreslog och validerade en ny teknik som prioriterar högvärdiga träningsdata, vilket uppnådde de mest betydande förbättringarna av maskinöversättningskvaliteten på fem år.",
  "polyglot-desc": "<strong>Polyglot:</strong> Utvecklade en språkidentifieringsmodell som stöder 201 språk.",
  "startup-title": "Erfarenhet från nystartat företag",
  "startup-role": "Medgrundare och AI-ingenjör",
  "italy": "Italien",
  "startup-desc1": "Grundade AI-startup som en del av en tre-personers grundarteam som byggde en geolokaliseringsplattform för bilder",
  "startup-desc2": "Utvecklade kärnmodellen för bildgeolokalisering med hjälp av visionstransformatorer och återhämtningsbaserade tekniker",
  "startup-desc3": "Fick värdefull erfarenhet i en snabb startup-miljö och produktutveckling",
  "startup-desc4": "Lärde sig viktiga lärdomar om teamdynamik, osäkerhetshantering och snabb iteration",
  "education-title": "Utbildning",
  "masters-full": "M.S. i artificiell intelligens och datateknik",
  "university-location": "Universitetet i Pisa, Pisa, Italien",
  "masters-description": "110/110 summa cum laude (4,0 GPA). Specialiserad på datautvinning, maskininlärning, datorseende, naturlig språkbearbetning, optimeringsteori och processutvinning. Fick praktisk erfarenhet av distribuerade system, molntjänster och verktyg som MongoDB, Neo4j, Docker, Kubernetes, TensorFlow och PyTorch.",
  "bachelors-full": "Kandidatexamen i datateknik",
  "bachelors-description": "110/110 (4,0 GPA). Stark grund i datateknik inklusive matematik, fysik, algoritmer, databaser, datorarkitektur, datornätverk, operativsystem och programmering i C, C++, Java, Python, Matlab, SQL, JavaScript och PHP.",
  "portfolio-title": "Portfölj",
  "portfolio-description": "En samling av mina AI- och maskininlärningsprojekt, från akademisk forskning till produktionssystem som betjänar miljontals användare över hela världen.",
  "t4sa-desc": "Korsmodal visuell sentimentanalys med kunskapsdestillation från text till visionsmodeller. Publicerad på ECAI 2023, uppnår toppmoderna resultat på visuell känsloförebyggande.",
  "numpygpt-desc": "En GPT byggd från grunden med NumPy och Pythons standardbibliotek. Ingen autograd, inga ramverk: varje lager återimplementeras med sitt eget framåt- och bakåtpass. Gradienter beräknas manuellt, uppdateringar är transparenta och varje operation är uttalad.",
  "fake-news-desc": "Multimodalt AI-system för detektering av felinformation med hjälp av transformerarkitekturer. Innehåller ställningsanalys och källans trovärdighetspoäng.",
  "unimusic-desc": "Skalbar plattform för musikupptäckt med hybrid MongoDB/Neo4j-arkitektur. Hanterar miljontals spår med rekommendationsalgoritmer i realtid.",
  "voice-vibes-desc": "Tal- och känsloregistreringssystem med sex nya AI-arkitekturer. Uppnådde 94 % noggrannhet med hjälp av ensemblemetoder och avancerad funktionskonstruktion.",
  "federated-dbscan-desc": "Integritetsskyddande distribuerad klusterbildning med federated learning. Möjliggör samarbetsbaserad ML utan datadelning, vilket uppnår 99 % integritetsskydd.",
  "pagerank-desc": "Högpresterande PageRank-algoritmimplementering med optimerade glesa matrisoperationer. Hanterar grafer med miljontals noder effektivt.",
  "contact-title": "Kontakt",
  "contact-description": "Låt oss prata! Oavsett om du vill diskutera AI, maskininlärning eller potentiella samarbeten är jag alltid öppen för intressanta samtal.",
  "location-label": "Plats:",
  "location": "Rom, Italien",
  "form-name": "Ditt namn",
  "form-email": "Din e-postadress",
  "form-subject": "Ämne",
  "form-message": "Meddelande",
  "form-loading": "Laddar",
  "form-success": "Ditt meddelande har skickats. Tack!",
  "form-send": "Skicka meddelande"
}