{
  "nav-home": "หน้าหลัก",
  "nav-about": "เกี่ยวกับ",
  "nav-tech": "เทคโนโลยี",
  "nav-resume": "ประวัติย่อ",
  "nav-portfolio": "ผลงาน",
  "nav-contact": "ติดต่อ",
  "language-label": "ภาษา",
  "language-selector-header": "เลือกภาษา (มีให้เลือก {count} ภาษา)",
  "hero-subtitle": "ทำให้ AI พูดภาษาของคุณได้ทีละโมเดล",
  "multilingual-typed": [
    "I train LLMs to speak your language.",
    "我训练大型语言模型来讲你的语言。",
    "Entreno LLMs para hablar tu idioma.",
    "Ich trainiere LLMs, damit sie deine Sprache sprechen.",
    "J'entraîne des LLM pour qu'ils parlent votre langue.",
    "あなたの言語を话せるように、LLMを訓練しています。",
    "Treino LLMs para falar o seu idioma.",
    "أقوم بتدريب LLM لتتحدث لغتك.",
    "Alleno LLM per parlare la tua lingua.",
    "Я обучаю LLM говорить на вашем языке."
  ],
  "about-title": "เกี่ยวกับฉันใน O(1)",
  "about-description": "ฉันเป็นนักวิจัยและวิศวกร AI ที่มุ่งเน้นไปที่โมเดลภาษาขนาดใหญ่หลายภาษา",
  "about-role": "วิศวกรและนักวิจัย AI",
  "about-intro": "ที่ Translated ฉันช่วยสร้าง Lara ตั้งแต่วันแรก ซึ่งเป็น LLM การแปลด้วยเครื่องที่ช่วยสร้างเนื้อหาแบบเรียลไทม์ให้กับ Airbnb, Uber, Shopify และอื่นๆ โดยมีผู้ใช้งานมากกว่า 200 ล้านคน",
  "birth-place-label": "สถานที่เกิด:",
  "birth-place": "เนเปิลส์, อิตาลี",
  "email-label": "อีเมล:",
  "city-label": "เมือง:",
  "city": "โรม, อิตาลี",
  "masters-label": "ปริญญาโท:",
  "masters-degree": "AI และวิศวกรรมข้อมูล",
  "bachelors-label": "ปริญญาตรี:",
  "bachelors-degree": "วิศวกรรมคอมพิวเตอร์",
  "university-label": "มหาวิทยาลัย:",
  "university": "มหาวิทยาลัยปิซา",
  "languages-label": "ภาษา:",
  "languages": "ภาษาอิตาลี, ภาษาอังกฤษ",
  "focus-label": "โฟกัส:",
  "focus": "LLM หลายภาษา",
  "about-conclusion": "ฉันได้ขยายการฝึกให้มี GPU มากกว่า 1,000 ตัว และขยายความครอบคลุมการแปลด้วยเครื่องจักรเป็น 201 ภาษา ผมเป็นผู้ร่วมก่อตั้ง <a href=\"https://picarta.ai/\" target=\"_blank\" style=\"color: var(--accent-primary); text-decoration: none; font-weight: 600;\">Picarta.ai</a> ซึ่งเป็นบริษัทสตาร์ทอัพด้าน AI ที่สร้างแพลตฟอร์มสำหรับระบุตำแหน่งภาพ ผมเป็นนักเรียนที่กระหายความรู้และพยายามปรับปรุงวิธีคิด ฝึกฝน และสร้างสรรค์อยู่เสมอ ฉันไม่สามารถจินตนาการถึงชีวิตที่ไม่มีการฝึกอบรม ไม่ว่าจะเป็น GPU, จานยิม หรือการเตรียมตัววิ่งมาราธอน",
  "tech-title": "เทคโนโลยีและเครื่องมือ",
  "tech-pytorch": "การเรียนรู้เชิงลึก",
  "tech-python": "ภาษาหลัก",
  "tech-slurm": "การจัดตารางงาน HPC",
  "tech-vllm": "การให้บริการ LLM ประสิทธิภาพสูง",
  "tech-transformers": "LLMs และ NLP",
  "tech-mongodb": "การจัดเก็บข้อมูล",
  "tech-docker": "การบรรจุภัณฑ์",
  "tech-git": "การควบคุมเวอร์ชัน",
  "focus-title": "จุดสนใจในปัจจุบัน",
  "focus-description": "สิ่งที่ฉันกำลังสร้างและวิจัยอยู่ตอนนี้",
  "focus-scaling-title": "การปรับขนาดการแปลด้วยเครื่องจักรเป็น 201 ภาษา",
  "focus-scaling-desc": "การขยายความครอบคลุมของการแปลด้วยเครื่องจักรโดยยังคงรักษาคุณภาพ การทำงานกับชุดข้อมูลหลายภาษาขนาดใหญ่และการเพิ่มประสิทธิภาพสำหรับภาษาที่มีทรัพยากรน้อยโดยใช้เทคนิคการเรียนรู้แบบถ่ายโอนขั้นสูง",
  "focus-production-title": "AI หลายภาษาในการผลิต",
  "focus-production-desc": "การสร้างระบบการแปลที่มีประสิทธิภาพซึ่งสามารถจัดการกับความซับซ้อนในโลกแห่งความเป็นจริงได้อย่างกว้างขวาง รับมือกับความท้าทาย เช่น การสลับรหัส การปรับโดเมน เนื้อหาที่ผู้ใช้สร้างขึ้นที่มีสัญญาณรบกวน และการรักษาคุณภาพให้กับผู้ใช้กว่า 200 ล้านคนทุกวัน",
  "tag-realtime": "การให้บริการแบบเรียลไทม์",
  "tag-quality": "การประกันคุณภาพ",
  "tag-data": "ข้อมูล",
  "resume-title": "ประวัติย่อ",
  "resume-description": "วิศวกรและนักวิจัยด้าน AI ที่มีประสบการณ์ในการสร้างและปรับขนาดระบบแปลภาษาโดยใช้เครื่องมือ ประวัติการให้บริการผู้ใช้กว่า 200 ล้านคนผ่านโซลูชัน LLM ที่เป็นนวัตกรรมใหม่",
  "experience-title": "ประสบการณ์การทำงาน",
  "current-role": "วิศวกรและนักวิจัย AI",
  "current-company": "Translated, โรม, อิตาลี",
  "lara-desc": "<strong>ลารา:</strong> ทำงานในทุกขั้นตอนการวิจัยและพัฒนา LLM ที่ปรับให้เหมาะกับการแปลด้วยเครื่อง: ตั้งแต่การเก็บรวบรวมข้อมูลและการฝึกโมเดล ไปจนถึงการปรับแนวและการเพิ่มประสิทธิภาพการอนุมาน สร้างขึ้นใหม่ทั้งหมดโดยทีมสไตล์สตาร์ทอัพ 4 คนที่ดำเนินงานภายในบริษัท ตอนนี้เป็นผลิตภัณฑ์ B2B รุ่นเรือธงที่แปลเนื้อหาทั้งหมดทั่วโลกให้กับ Airbnb และส่วนใหญ่ของ Uber, Shopify, Nike และอื่นๆ โดยเข้าถึงผู้ใช้กว่า 200 ล้านคนทั่วโลก และเพิ่งเปิดตัวเวอร์ชัน B2C ไปไม่นานมานี้",
  "try-here": "ลองเลย",
  "lara-grande-desc": "<strong>Lara Grande:</strong> มีบทบาทสำคัญในการปรับขนาด LLM ให้ตรงกับคุณภาพของนักแปลมืออาชีพอันดับต้นๆ 1% ใช้ GPU กว่า 1,000 ตัวบนคลัสเตอร์ HPC ของ CINECA สำหรับการฝึกแบบกระจายขนาดใหญ่",
  "language-expansion-desc": "<strong>การเพิ่มภาษา:</strong> ระบุและนำโครงการวิจัยที่ประสบความสำเร็จในการเพิ่มความครอบคลุมการแปลด้วยเครื่องจาก 56 เป็น 201 ภาษา ซึ่งเพิ่มขึ้น 4 เท่า ทำให้เป็นเครื่องมือแปลด้วยเครื่องเชิงพาณิชย์เครื่องแรกที่รองรับภาษามากมายขนาดนี้ เสนอทิศทาง ออกแบบแผนการดำเนินงาน และนำไปสู่ความสำเร็จภายในแปดเดือน",
  "instruction-mt-desc": "<strong>การแปลด้วยเครื่องตามคำแนะนำ:</strong> นำการวิจัยที่จัดเรียง LLM เพื่อปฏิบัติตามคู่มือรูปแบบโดยละเอียดโดยใช้ SFT และ DPO",
  "trust-attention-desc": "<strong>ความสนใจในความน่าเชื่อถือ:</strong> เสนอและตรวจสอบเทคนิคใหม่ที่จัดลำดับความสำคัญของข้อมูลการฝึกที่มีมูลค่าสูง ทำให้คุณภาพการแปลด้วยเครื่องมือดีขึ้นอย่างมีนัยสำคัญที่สุดในรอบ 5 ปี",
  "polyglot-desc": "<strong>Polyglot:</strong> พัฒนาโมเดลการระบุภาษาที่รองรับ 201 ภาษา",
  "startup-title": "ประสบการณ์ในธุรกิจสตาร์ทอัพ",
  "startup-role": "ผู้ร่วมก่อตั้งและวิศวกร AI",
  "italy": "อิตาลี",
  "startup-desc1": "ร่วมก่อตั้งบริษัทสตาร์ทอัพด้าน AI ในฐานะสมาชิกหนึ่งในทีมก่อตั้ง 3 คนที่สร้างแพลตฟอร์มระบุตำแหน่งทางภูมิศาสตร์ของภาพ",
  "startup-desc2": "พัฒนาโมเดลหลักสำหรับการระบุตำแหน่งทางภูมิศาสตร์ของภาพโดยใช้ทรานส์ฟอร์เมอร์ภาพและเทคนิคการดึงข้อมูล",
  "startup-desc3": "ได้รับประสบการณ์อันมีค่าในสภาพแวดล้อมการเริ่มต้นที่รวดเร็วและการพัฒนาผลิตภัณฑ์",
  "startup-desc4": "ได้เรียนรู้บทเรียนสำคัญเกี่ยวกับพลวัตของทีม การจัดการความไม่แน่นอน และการทำซ้ำอย่างรวดเร็ว",
  "education-title": "การศึกษา",
  "masters-full": "ปริญญาโทสาขาปัญญาประดิษฐ์และวิศวกรรมข้อมูล",
  "university-location": "มหาวิทยาลัยปิซา ปิซา อิตาลี",
  "masters-description": "110/110 ด้วยเกียรตินิยมสูงสุด (4.0 GPA) มีความเชี่ยวชาญด้านการทำเหมืองข้อมูล การเรียนรู้ของเครื่อง การมองเห็นของคอมพิวเตอร์ การประมวลผลภาษาธรรมชาติ ทฤษฎีการเพิ่มประสิทธิภาพ และการทำเหมืองกระบวนการ ได้รับประสบการณ์จริงเกี่ยวกับระบบกระจาย การประมวลผลบนคลาวด์ และเครื่องมือ เช่น MongoDB, Neo4j, Docker, Kubernetes, TensorFlow และ PyTorch",
  "bachelors-full": "ปริญญาตรีสาขาวิศวกรรมคอมพิวเตอร์",
  "bachelors-description": "110/110 (4.0 GPA) พื้นฐานที่แข็งแกร่งในวิศวกรรมคอมพิวเตอร์ รวมถึงคณิตศาสตร์ ฟิสิกส์ อัลกอริทึม ฐานข้อมูล สถาปัตยกรรมคอมพิวเตอร์ เครือข่ายคอมพิวเตอร์ ระบบปฏิบัติการ และการเขียนโปรแกรมในภาษา C, C++, Java, Python, Matlab, SQL, JavaScript และ PHP",
  "portfolio-title": "ผลงาน",
  "portfolio-description": "คอลเลกชันโปรเจกต์ AI และ Machine Learning ของฉัน ตั้งแต่การวิจัยทางวิชาการไปจนถึงระบบการผลิตที่ให้บริการผู้ใช้หลายล้านคนทั่วโลก",
  "t4sa-desc": "ระบบวิเคราะห์ความรู้สึกด้วยภาพแบบข้ามสื่อ โดยใช้การกลั่นกรองความรู้จากข้อความไปยังโมเดลการมองเห็น เผยแพร่ที่ ECAI 2023 โดยบรรลุผลลัพธ์ล่าสุดในการคาดการณ์ความรู้สึกจากภาพ",
  "numpygpt-desc": "GPT ที่สร้างขึ้นใหม่ด้วย NumPy และไลบรารีมาตรฐานของ Python ไม่มีการเรียกเกรเดียนท์อัตโนมัติ ไม่มีเฟรมเวิร์ก: ทุกเลเยอร์จะถูกนำไปใช้ใหม่ด้วยการส่งต่อและย้อนกลับของตัวเอง การคำนวณเกรเดียนท์ด้วยตนเอง การอัปเดตที่โปร่งใส และการดำเนินการทุกอย่างที่มีการอธิบายอย่างละเอียด",
  "fake-news-desc": "ระบบ AI แบบหลายโหมดสำหรับการตรวจจับข้อมูลที่ผิดพลาดโดยใช้สถาปัตยกรรมทรานส์ฟอร์เมอร์ มีการวิเคราะห์จุดยืนและให้คะแนนความน่าเชื่อถือของแหล่งข้อมูล",
  "unimusic-desc": "แพลตฟอร์มการค้นหาเพลงที่ปรับขนาดได้ด้วยสถาปัตยกรรม MongoDB/Neo4j แบบไฮบริด จัดการเพลงนับล้านด้วยอัลกอริทึมแนะนำแบบเรียลไทม์",
  "voice-vibes-desc": "ระบบจดจำอารมณ์จากคำพูดด้วยสถาปัตยกรรม AI แบบใหม่ 6 แบบ บรรลุความแม่นยำ 94% โดยใช้วิธีการแบบชุดและวิศวกรรมฟีเจอร์ขั้นสูง",
  "federated-dbscan-desc": "การจัดกลุ่มแบบกระจายที่รักษาความเป็นส่วนตัวด้วยการเรียนรู้แบบรวมกลุ่ม เปิดใช้งาน ML แบบทำงานร่วมกันโดยไม่ต้องแชร์ข้อมูล ซึ่งช่วยรักษาความเป็นส่วนตัวได้ถึง 99%",
  "pagerank-desc": "การใช้งานอัลกอริทึม PageRank ประสิทธิภาพสูงด้วยการดำเนินการเมทริกซ์แบบห่างกัน จัดการกราฟที่มีโหนดนับล้านอย่างมีประสิทธิภาพ",
  "contact-title": "ติดต่อ",
  "contact-description": "มาติดต่อกันเถอะ! ไม่ว่าคุณจะต้องการพูดคุยเกี่ยวกับ AI, การเรียนรู้ของเครื่อง หรือความร่วมมือที่อาจเกิดขึ้น ฉันพร้อมสนทนาที่น่าสนใจเสมอ",
  "location-label": "สถานที่:",
  "location": "โรม, อิตาลี",
  "form-name": "ชื่อของคุณ",
  "form-email": "อีเมลของคุณ",
  "form-subject": "หัวข้อ",
  "form-message": "ข้อความ",
  "form-loading": "กำลังโหลด",
  "form-success": "ข้อความของคุณถูกส่งแล้ว ขอบคุณ",
  "form-send": "ส่งข้อความ"
}