{
  "nav-home": "Ana Sayfa",
  "nav-about": "Hakkında",
  "nav-tech": "Teknoloji Yığını",
  "nav-resume": "Özgeçmiş",
  "nav-portfolio": "Portföy",
  "nav-contact": "İletişim",
  "language-label": "Dil",
  "language-selector-header": "Dil seçin ({count} mevcut)",
  "hero-subtitle": "Yapay zekânın dilinizi konuşmasını sağlamak, her seferinde bir model",
  "multilingual-typed": [
    "I train LLMs to speak your language.",
    "我训练大型语言模型来讲你的语言。",
    "Entreno LLMs para hablar tu idioma.",
    "Ich trainiere LLMs, damit sie deine Sprache sprechen.",
    "J'entraîne des LLM pour qu'ils parlent votre langue.",
    "あなたの言語を话せるように、LLMを訓練しています。",
    "Treino LLMs para falar o seu idioma.",
    "أقوم بتدريب LLM لتتحدث لغتك.",
    "Alleno LLM per parlare la tua lingua.",
    "Я обучаю LLM говорить на вашем языке."
  ],
  "about-title": "Hakkımda",
  "about-description": "Çok dilli büyük dil modellerine odaklanmış bir yapay zeka araştırmacısı ve mühendisiyim.",
  "about-role": "Yapay Zeka Mühendisi ve Araştırmacı",
  "about-intro": "Translated'da, Airbnb, Uber, Shopify ve diğerleri için gerçek zamanlı içerik sağlayan ve 200 milyondan fazla kullanıcıya ulaşan bir makine çevirisi LLM'si olan Lara'nın ilk günden itibaren oluşturulmasına yardımcı oldum.",
  "birth-place-label": "Doğum Yeri:",
  "birth-place": "Napoli, İtalya",
  "email-label": "E-posta:",
  "city-label": "Şehir:",
  "city": "Roma, İtalya",
  "masters-label": "Yüksek Lisans Derecesi:",
  "masters-degree": "Yapay Zeka ve Veri Mühendisliği",
  "bachelors-label": "Lisans Derecesi:",
  "bachelors-degree": "Bilgisayar Mühendisliği",
  "university-label": "Üniversite:",
  "university": "Pisa Üniversitesi",
  "languages-label": "Diller:",
  "languages": "İtalyanca, İngilizce",
  "focus-label": "Odak:",
  "focus": "Çok dilli LLM'ler",
  "about-conclusion": "Eğitimi 1.000'den fazla GPU'ya ölçeklendirdim ve makine çevirisi kapsamını 201 dile genişlettim. Görüntülerin coğrafi konumunu belirleme platformu geliştiren bir yapay zeka girişimi olan <a href=\"https://picarta.ai/\" target=\"_blank\" style=\"color: var(--accent-primary); text-decoration: none; font-weight: 600;\">Picarta.ai</a> şirketinin kurucu ortağıyım. Sürekli düşünme, eğitim ve geliştirme şeklimi iyileştirmek için çabalayan, öğrenmeye aç biriyim. GPU'lar, spor salonu ağırlıkları veya maraton hazırlığı olsun, bir tür eğitim olmadan bir hayat düşünemiyorum.",
  "tech-title": "Teknolojiler ve Araçlar",
  "tech-pytorch": "Derin Öğrenme",
  "tech-python": "Birincil Dil",
  "tech-slurm": "HPC İş Zamanlama",
  "tech-vllm": "Yüksek Performanslı LLM Hizmeti",
  "tech-transformers": "LLM'ler ve NLP",
  "tech-mongodb": "Veri Depolama",
  "tech-docker": "Konteynerizasyon",
  "tech-git": "Sürüm Kontrolü",
  "focus-title": "Mevcut Odak",
  "focus-description": "Şu anda ne inşa ediyor ve araştırıyorum?",
  "focus-scaling-title": "Makine çevirisini 201 dile ölçeklendirme",
  "focus-scaling-desc": "Kaliteyi korurken makine çevirisi kapsamını genişletiyoruz. Büyük çok dilli veri kümeleriyle çalışma ve gelişmiş aktarım öğrenimi tekniklerini kullanarak düşük kaynaklı diller için optimizasyon.",
  "focus-production-title": "Üretimde Çok Dilli Yapay Zeka",
  "focus-production-desc": "Gerçek dünyadaki karmaşıklığı büyük ölçekte ele alan sağlam çeviri sistemleri oluşturuyoruz. Kod değiştirme, alan uyarlaması, gürültülü kullanıcı tarafından oluşturulan içerik ve günlük 200 milyondan fazla kullanıcı arasında kaliteyi koruma gibi zorluklarla mücadele ediyoruz.",
  "tag-realtime": "Gerçek Zamanlı Hizmet",
  "tag-quality": "Kalite Güvencesi",
  "tag-data": "Veri",
  "resume-title": "Özgeçmiş",
  "resume-description": "Çok dilli makine çevirisi sistemleri oluşturma ve ölçeklendirme konusunda kapsamlı deneyime sahip yapay zeka mühendisi ve araştırmacısı. Yenilikçi LLM çözümleri aracılığıyla 200 milyondan fazla kullanıcıya hizmet veren kanıtlanmış bir geçmişe sahip.",
  "experience-title": "Mesleki Deneyim",
  "current-role": "Yapay Zeka Mühendisi ve Araştırmacı",
  "current-company": "Translated, Roma, İtalya",
  "lara-desc": "<strong>Lara:</strong> Makine çevirisi için optimize edilmiş bir LLM'nin veri toplama ve model eğitiminden hizalama ve çıkarım optimizasyonuna kadar tüm Ar-Ge süreci üzerinde çalıştı. Şirket içinde faaliyet gösteren dört kişilik startup tarzı bir ekip içinde sıfırdan inşa edildi. Şu anda amiral gemisi B2B ürünü olan bu ürün, Airbnb ve Uber, Shopify, Nike ve daha fazlasının çoğu için dünya çapındaki tüm içerikleri çevirerek küresel olarak 200 milyondan fazla kullanıcıya ulaşıyor. Kısa süre önce bir B2C sürümü de piyasaya sürüldü.",
  "try-here": "Buradan deneyin",
  "lara-grande-desc": "<strong>Lara Grande:</strong> Profesyonel çevirmenlerin en iyi %1'lik kesiminin kalitesine ulaşmak için LLM'nin ölçeklendirilmesinde kilit rol. Büyük ölçekli dağıtılmış eğitim için CINECA'nın HPC kümesinde 1.000'den fazla GPU kullanıldı.",
  "language-expansion-desc": "<strong>Dil Genişletme:</strong> Makine çevirisi üretim kapsamını 56'dan 201 dile, yani 4 katına çıkarmak için başarılı bir araştırma projesi belirledim ve yönettim. Bu, projeyi bu kadar çok dili destekleyen ilk ticari makine çevirisi motoru yaptı. Yönlendirme önerisi sundum, uygulama planını tasarladım ve sekiz ay içinde tamamlanmasını sağladım.",
  "instruction-mt-desc": "<strong>Talimatlara uygun makine çevirisi:</strong> SFT ve DPO kullanarak LLM'nin ayrıntılı stil kılavuzlarına uyumunu sağlayan araştırmalara öncülük ettim.",
  "trust-attention-desc": "<strong>Güven Konusunda Dikkat:</strong> Yüksek değerli eğitim verilerine öncelik veren yeni bir teknik önerdi ve doğruladı, beş yıl içinde makine çevirisi kalitesinde en önemli iyileştirmeleri elde etti.",
  "polyglot-desc": "<strong>Polyglot:</strong> 201 dili destekleyen bir dil tanımlama modeli geliştirildi.",
  "startup-title": "Girişim Deneyimi",
  "startup-role": "Kurucu Ortak ve Yapay Zeka Mühendisi",
  "italy": "İtalya",
  "startup-desc1": "Üç kişilik kurucu ekip olarak görüntü coğrafi konumlandırma platformu oluşturmak için AI girişimine ortaklık ettim",
  "startup-desc2": "Görüntü dönüştürücüleri ve geri alma tabanlı teknikler kullanarak görüntü coğrafi konumlandırma için temel modeli geliştirdi",
  "startup-desc3": "Hızlı tempolu startup ortamında ve ürün geliştirmede değerli deneyimler kazandım",
  "startup-desc4": "Ekip dinamikleri, belirsizlik yönetimi ve hızlı yineleme hakkında önemli dersler çıkarıldı",
  "education-title": "Eğitim",
  "masters-full": "Yüksek Lisans Yapay Zeka ve Veri Mühendisliği",
  "university-location": "Pisa Üniversitesi, Pisa, İtalya",
  "masters-description": "110/110 yüksek akademik başarı (4.0 GNO). Veri Madenciliği, Makine Öğrenimi, Bilgisayar Görü, Doğal Dil İşleme, Optimizasyon Teorisi ve Süreç Madenciliği alanlarında uzmanlaşmıştır. Dağıtılmış Sistemler, Bulut Bilişim ve MongoDB, Neo4j, Docker, Kubernetes, TensorFlow ve PyTorch gibi araçlarla uygulamalı deneyim kazandım.",
  "bachelors-full": "Bilgisayar Mühendisliği Lisans Derecesi",
  "bachelors-description": "110/110 (4.0 GPA). Matematik, fizik, algoritmalar, veritabanları, bilgisayar mimarisi, bilgisayar ağları, işletim sistemleri ve C, C++, Java, Python, Matlab, SQL, JavaScript ve PHP ile programlama dahil olmak üzere bilgisayar mühendisliğinde güçlü bir temel.",
  "portfolio-title": "Portföy",
  "portfolio-description": "Akademik araştırmalardan dünya çapında milyonlarca kullanıcıya hizmet veren üretim sistemlerine kadar yapay zeka ve makine öğrenimi projelerimden oluşan bir koleksiyon.",
  "t4sa-desc": "Metinden görsel modellere bilgi damıtmayı kullanan çapraz görsel duygu analizi sistemi. ECAI 2023'te yayınlandı, görsel duygu tahmininde en son teknoloji ürünü sonuçlar elde etti.",
  "numpygpt-desc": "NumPy ve Python'un standart kütüphanesi ile sıfırdan oluşturulmuş bir GPT. Otomatik türev yok, çerçeve yok: Her katman kendi ileri ve geri geçişiyle yeniden uygulanır. Gradyanlar manuel olarak hesaplanır, güncellemeler şeffaftır ve her işlem ayrıntılı olarak açıklanır.",
  "fake-news-desc": "Dönüştürücü mimarileri kullanarak yanlış bilgi tespiti için çok modlu yapay zeka sistemi. Duruş analizi ve kaynak güvenilirlik puanlaması özelliklerine sahiptir.",
  "unimusic-desc": "Hibrit MongoDB/Neo4j mimarisine sahip ölçeklenebilir müzik keşif platformu. Gerçek zamanlı öneri algoritmalarıyla milyonlarca parçayı işler.",
  "voice-vibes-desc": "Altı yeni yapay zeka mimarisine sahip konuşma duygusu tanıma sistemi. Topluluk yöntemleri ve gelişmiş özellik mühendisliği kullanılarak %94 doğruluk elde edildi.",
  "federated-dbscan-desc": "Birleşik öğrenme ile gizliliği koruyan dağıtılmış kümeleme. Veri paylaşımı olmadan iş birliğine dayalı makine öğrenimi sağlayarak %99 gizlilik koruması elde eder.",
  "pagerank-desc": "Optimize edilmiş seyrek matris işlemleri ile yüksek performanslı PageRank algoritması uygulaması. Milyonlarca düğüme sahip grafikleri verimli bir şekilde işler.",
  "contact-title": "İletişim",
  "contact-description": "Bağlantı kuralım! Yapay zeka, makine öğrenimi veya potansiyel iş birlikleri hakkında konuşmak istiyorsanız, ilginç konuşmalara her zaman açığım.",
  "location-label": "Konum:",
  "location": "Roma, İtalya",
  "form-name": "Adınız",
  "form-email": "E-posta adresiniz",
  "form-subject": "Konu",
  "form-message": "Mesaj",
  "form-loading": "Yükleniyor",
  "form-success": "Mesajınız gönderildi. Teşekkürler!",
  "form-send": "Mesaj Gönder"
}