{
  "nav-home": "Головна",
  "nav-about": "Про мене",
  "nav-tech": "Технологічний стек",
  "nav-resume": "Резюме",
  "nav-portfolio": "Портфоліо",
  "nav-contact": "Контакти",
  "language-label": "Мова",
  "language-selector-header": "Виберіть мову (доступно: {count})",
  "hero-subtitle": "Змушуємо ШІ говорити вашою мовою, модель за моделлю",
  "multilingual-typed": [
    "I train LLMs to speak your language.",
    "我训练大型语言模型来讲你的语言。",
    "Entreno LLMs para hablar tu idioma.",
    "Ich trainiere LLMs, damit sie deine Sprache sprechen.",
    "J'entraîne des LLM pour qu'ils parlent votre langue.",
    "あなたの言語を话せるように、LLMを訓練しています。",
    "Treino LLMs para falar o seu idioma.",
    "أقوم بتدريب LLM لتتحدث لغتك.",
    "Alleno LLM per parlare la tua lingua.",
    "Я обучаю LLM говорить на вашем языке."
  ],
  "about-title": "Про мене в O(1)",
  "about-description": "Я дослідник і інженер у сфері ШІ, який спеціалізується на багатомовних великих мовних моделях.",
  "about-role": "Інженер та дослідник у сфері ШІ",
  "about-intro": "У Translated я допомагав будувати Lara з першого дня, LLM машинного перекладу, який забезпечує контент у режимі реального часу для Airbnb, Uber, Shopify та інших, охоплюючи понад 200 мільйонів користувачів.",
  "birth-place-label": "Місце народження:",
  "birth-place": "Неаполь, Італія",
  "email-label": "Електронна пошта:",
  "city-label": "Місто:",
  "city": "Рим, Італія",
  "masters-label": "Ступінь магістра:",
  "masters-degree": "Штучний інтелект і інженерія даних",
  "bachelors-label": "Ступінь бакалавра:",
  "bachelors-degree": "Комп’ютерна інженерія",
  "university-label": "Університет:",
  "university": "Пізанський університет",
  "languages-label": "Мови:",
  "languages": "Італійська, англійська",
  "focus-label": "Фокус:",
  "focus": "Багатомовні LLM",
  "about-conclusion": "Я розширив навчання до понад 1000 графічних процесорів і збільшив охоплення машинного перекладу до 201 мови. Я став співзасновником <a href=\"https://picarta.ai/\" target=\"_blank\" style=\"color: var(--accent-primary); text-decoration: none; font-weight: 600;\">Picarta.ai</a>, стартапу в галузі штучного інтелекту, який створює платформу для геолокації зображень. Я ненаситний учень, який постійно прагне вдосконалювати свої способи мислення, навчання та побудови. Я не можу уявити життя без будь-якої форми навчання, чи то графічні процесори, чи гантелі, чи підготовка до марафону.",
  "tech-title": "Технології та інструменти",
  "tech-pytorch": "Глибоке навчання",
  "tech-python": "Основна мова",
  "tech-slurm": "Планування завдань HPC",
  "tech-vllm": "Високопродуктивне обслуговування великих мовних моделей",
  "tech-transformers": "LLMs та NLP",
  "tech-mongodb": "Зберігання даних",
  "tech-docker": "Контейнеризація",
  "tech-git": "Контроль версій",
  "focus-title": "Поточний фокус",
  "focus-description": "Над чим я зараз працюю",
  "focus-scaling-title": "Масштабування машинного перекладу на 201 мову",
  "focus-scaling-desc": "Розширення охоплення машинного перекладу з одночасним збереженням якості. Робота з величезними багатомовними наборами даних та оптимізація для мов із низьким рівнем ресурсів за допомогою передових методів трансферного навчання.",
  "focus-production-title": "Багатомовний ШІ у виробництві",
  "focus-production-desc": "Створення надійних систем перекладу, які можуть масштабуватися для вирішення складних завдань у реальному світі. Вирішення таких проблем, як перемикання кодів, адаптація доменів, шумний контент, створений користувачами, і підтримка якості для понад 200 мільйонів користувачів щодня.",
  "tag-realtime": "Обслуговування в режимі реального часу",
  "tag-quality": "Забезпечення якості",
  "tag-data": "Дані",
  "resume-title": "Резюме",
  "resume-description": "Інженер і дослідник у сфері штучного інтелекту з великим досвідом побудови та масштабування багатомовних систем машинного перекладу. Підтверджений досвід обслуговування понад 200 мільйонів користувачів за допомогою інноваційних рішень LLM.",
  "experience-title": "Професійний досвід",
  "current-role": "Інженер та дослідник у сфері ШІ",
  "current-company": "Translated, Рим, Італія",
  "lara-desc": "<strong>Лара:</strong> Працювала над повним циклом досліджень і розробок LLM, оптимізованого для машинного перекладу: від збору даних і навчання моделей до оптимізації узгодження та висновків. Створено з нуля в рамках команди з чотирьох осіб у стилі стартапу, що працює всередині компанії. Тепер флагманський продукт B2B перекладає весь контент по всьому світу для Airbnb і більшості Uber, Shopify, Nike тощо, охоплюючи понад 200 мільйонів користувачів по всьому світу. Нещодавно також було запущено версію B2C.",
  "try-here": "Спробуйте тут",
  "lara-grande-desc": "<strong>Lara Grande:</strong> ключова роль у масштабуванні LLM для досягнення якості перекладу, що відповідає найкращим 1% професійних перекладачів. Використовувалося понад 1000 графічних процесорів у кластері високопродуктивних обчислень CINECA для великомасштабного розподіленого навчання.",
  "language-expansion-desc": "<strong>Розширення мов:</strong> визначив і провів успішний дослідницький проєкт для розширення охоплення машинного перекладу з 56 до 201 мови, що є збільшенням у 4 рази, що робить його першим комерційним механізмом машинного перекладу, який підтримує такий діапазон. Запропонував напрямок, розробив план реалізації та довів його до завершення протягом восьми місяців.",
  "instruction-mt-desc": "<strong>Машинний переклад за інструкціями:</strong> провів дослідження, що узгоджують LLM для дотримання детальних посібників зі стилю за допомогою SFT та DPO.",
  "trust-attention-desc": "<strong>Увага до довіри:</strong> запропоновано та перевірено нову техніку, яка надає пріоритет високоякісним даним для навчання, що дозволило досягти найзначнішого покращення якості машинного перекладу за п’ять років.",
  "polyglot-desc": "<strong>Polyglot:</strong> розроблена модель ідентифікації мови, яка підтримує 201 мову.",
  "startup-title": "Досвід роботи в стартапі",
  "startup-role": "Співзасновник та інженер ШІ",
  "italy": "Італія",
  "startup-desc1": "Співзасновник стартапу ШІ в складі команди із трьох осіб, що створює платформу геолокації зображень",
  "startup-desc2": "Розроблена основна модель для геолокації зображень за допомогою трансформаторів зображень і методів на основі пошуку",
  "startup-desc3": "Отримано цінний досвід роботи в динамічному середовищі стартапу та розробки продукту",
  "startup-desc4": "отримано важливі уроки щодо динаміки команди, управління невизначеністю та швидкої ітерації.",
  "education-title": "Освіта",
  "masters-full": "Магістр наук у галузі штучного інтелекту та інженерії даних",
  "university-location": "Пізанський університет, Піза, Італія",
  "masters-description": "110/110 з відзнакою (4.0 GPA). Спеціалізація: видобуток даних, машинне навчання, комп’ютерний зір, обробка природної мови, теорія оптимізації та видобуток процесів. Отримано практичний досвід роботи з розподіленими системами, хмарними обчисленнями та такими інструментами, як MongoDB, Neo4j, Docker, Kubernetes, TensorFlow та PyTorch.",
  "bachelors-full": "Бакалавр комп’ютерної інженерії",
  "bachelors-description": "110/110 (4.0 GPA). Сильна основа в комп’ютерній інженерії, включаючи математику, фізику, алгоритми, бази даних, комп’ютерну архітектуру, комп’ютерні мережі, операційні системи та програмування на C, C++, Java, Python, Matlab, SQL, JavaScript та PHP.",
  "portfolio-title": "Портфоліо",
  "portfolio-description": "Колекція моїх проєктів у сфері ШІ та машинного навчання, від академічних досліджень до виробничих систем, які обслуговують мільйони користувачів по всьому світу.",
  "t4sa-desc": "Система крос-модального аналізу візуальних настроїв з використанням дистиляції знань від текстових до візуальних моделей. Опубліковано на ECAI 2023, досягнуто найсучасніших результатів у прогнозуванні візуальних настроїв.",
  "numpygpt-desc": "GPT, побудований з нуля за допомогою NumPy та стандартної бібліотеки Python. Жодних автоградієнтів, жодних фреймворків: кожен шар реалізовано заново з власним прямим і зворотним проходом. Градієнти обчислюються вручну, оновлення прозорі, і кожна операція прописана.",
  "fake-news-desc": "Мультимодальна система ШІ для виявлення дезінформації з використанням архітектур трансформерів. Містить аналіз позицій та оцінку достовірності джерела.",
  "unimusic-desc": "Масштабована платформа для відкриття музики з гібридною архітектурою MongoDB/Neo4j. Обробляє мільйони треків за допомогою алгоритмів рекомендацій у режимі реального часу.",
  "voice-vibes-desc": "Система розпізнавання емоцій мовлення з шістьма новими архітектурами ШІ. Досягнуто точності 94% за допомогою ансамблевих методів та розширеної інженерії функцій.",
  "federated-dbscan-desc": "Розподілена кластеризація з федеративним навчанням, що зберігає конфіденційність. Забезпечує спільне машинне навчання без обміну даними, досягаючи 99% збереження конфіденційності.",
  "pagerank-desc": "Високопродуктивна реалізація алгоритму PageRank з оптимізованими операціями з розрідженими матрицями. Ефективно обробляє графіки з мільйонами вузлів.",
  "contact-title": "Контакти",
  "contact-description": "Давайте спілкуватися! Якщо ви хочете обговорити штучний інтелект, машинне навчання або потенційну співпрацю, я завжди відкритий для цікавих розмов.",
  "location-label": "Місцезнаходження:",
  "location": "Рим, Італія",
  "form-name": "Ваше ім’я",
  "form-email": "Ваша електронна адреса",
  "form-subject": "Тема",
  "form-message": "Повідомлення",
  "form-loading": "Завантаження",
  "form-success": "Ваше повідомлення надіслано. Дякуємо!",
  "form-send": "Надіслати повідомлення"
}